<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="第一次发吹水文，今天和某机器学习大佬聊关于社交网络中的人际关系问题，其实并不是在聊和谁谁谁的关系，而是探讨一些关于“关系”本质上的结构性问题，没什么营养，不过也大概稍微笔记一下吧w">
<meta property="og:type" content="article">
<meta property="og:title" content="杂谈一下社交网络当中的人际问题">
<meta property="og:url" content="http://yoursite.com/心情随笔/ 杂谈一下社交网络当中的人际问题/index.html">
<meta property="og:site_name" content="アカリの部屋">
<meta property="og:description" content="第一次发吹水文，今天和某机器学习大佬聊关于社交网络中的人际关系问题，其实并不是在聊和谁谁谁的关系，而是探讨一些关于“关系”本质上的结构性问题，没什么营养，不过也大概稍微笔记一下吧w">
<meta property="og:updated_time" content="2017-04-24T14:55:26.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="杂谈一下社交网络当中的人际问题">
<meta name="twitter:description" content="第一次发吹水文，今天和某机器学习大佬聊关于社交网络中的人际关系问题，其实并不是在聊和谁谁谁的关系，而是探讨一些关于“关系”本质上的结构性问题，没什么营养，不过也大概稍微笔记一下吧w">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/心情随笔/ 杂谈一下社交网络当中的人际问题/"/>





  <title> 杂谈一下社交网络当中的人际问题 | アカリの部屋 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">アカリの部屋</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <p class="site-subtitle"></p>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-links">
          <a href="/links" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-question-circle"></i> <br />
            
            友链
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/心情随笔/ 杂谈一下社交网络当中的人际问题/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="アカリ">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/icon.jpeg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="アカリの部屋">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="アカリの部屋" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                杂谈一下社交网络当中的人际问题
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-04-24T15:00:00+08:00">
                2017-04-24
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/心情随笔/" itemprop="url" rel="index">
                    <span itemprop="name">心情随笔</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          
              <div class="post-description">
                  第一次发吹水文，今天和某机器学习大佬聊关于社交网络中的人际关系问题，其实并不是在聊和谁谁谁的关系，而是探讨一些关于“关系”本质上的结构性问题，没什么营养，不过也大概稍微笔记一下吧w
              </div>
          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x6BB5;&#x843D;1&#xFF08;&#x804A;&#x5929;&#x4E2D;&#x4F7F;&#x7528;&#x56FE;&#x7247;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#xFF09;"><a href="#&#x6BB5;&#x843D;1&#xFF08;&#x804A;&#x5929;&#x4E2D;&#x4F7F;&#x7528;&#x56FE;&#x7247;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#xFF09;" class="headerlink" title="&#x6BB5;&#x843D;1&#xFF08;&#x804A;&#x5929;&#x4E2D;&#x4F7F;&#x7528;&#x56FE;&#x7247;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#xFF09;"></a>&#x6BB5;&#x843D;1&#xFF08;&#x804A;&#x5929;&#x4E2D;&#x4F7F;&#x7528;&#x56FE;&#x7247;&#x7684;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#xFF09;</h2><p>&#x4EBA;&#x4EEC;&#x4F1A;&#x5728;&#x4E00;&#x4E2A;&#x7FA4;&#x91CC;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x8D34;&#x7EB8;&#x8868;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x53D1;&#x73B0;&#x6211;&#x81EA;&#x5DF1;&#x6BD4;&#x8F83;&#x4E60;&#x60EF;&#x7528;&#x989C;&#x6587;&#x5B57;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;(&#xB4; &#x25BD; `)&#xFF89;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x540E;&#x6765;&#x601D;&#x8003;&#x81EA;&#x5DF1;&#x80CC;&#x540E;&#x7684;&#x52A8;&#x673A;&#xFF0C;&#x662F;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x8FD9;&#x79CD;&#x989C;&#x6587;&#x5B57;&#x5F88;&#x4F20;&#x795E;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x5B58;&#x5728;&#x591A;&#x4F59;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x540C;&#x4E00;&#x4E2A;&#x8868;&#x60C5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x767E;&#x79CD;&#x5C0F;&#x59D0;&#x59D0;/&#x5C0F;&#x5F1F;&#x5F1F;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7684;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#xFF0C;&#x7136;&#x800C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x53E3;&#x5473;&#x4E0D;&#x540C;&#xFF0C;&#x6BD4;&#x5982;&#x6709;&#x7684;&#x4EBA;&#x5C31;&#x662F;&#x4E0D;&#x559C;&#x6B22;&#x808C;&#x8089;&#x517D;&#x4EBA;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x5BFC;&#x81F4;&#x4EFB;&#x4F55;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x56FE;&#x7684;&#x4EBA;&#x7684;&#x5FC3;&#x7406;&#x4E0D;&#x9002;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x8FD9;&#x5F20;&#x56FE;&#x800C;&#x4E0D;&#x5E0C;&#x671B;&#x8BA9;&#x5176;&#x4ED6;&#x4EBA;&#x611F;&#x5230;&#x4E0D;&#x9002;&#x7684;&#x8BDD;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x6240;&#x6709;&#x4EBA;&#x62C9;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x663E;&#x7136;&#x4E0D;&#x53EF;&#x63A7;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x81EA;&#x5DF1;&#x8003;&#x8651;&#x4E86;&#x65C1;&#x89C2;&#x8005;&#x7684;&#x5FC3;&#x7406;&#x611F;&#x53D7;&#xFF0C;&#x65E2;&#x7136;&#x6CA1;&#x6CD5;&#x8981;&#x6C42;&#x522B;&#x4EBA;&#x90FD;&#x4E0D;&#x201C;&#x7740;&#x76F8;&#x201D;&#xFF0C;&#x5C31;&#x53EA;&#x80FD;&#x514B;&#x5236;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x53D1;&#x9001;&#x8FD9;&#x79CD;&#x56FE;&#x7247;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x201C;&#x5931;&#x793C;&#x201D;&#x7684;&#x884C;&#x4E3A;&#x5462;&#xFF1F;</p>
<p>&#x7136;&#x800C;&#x5728;&#x4E2D;&#x56FD;&#x6587;&#x5316;&#x5708;&#x91CC;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E5F;&#x8BB8;&#x662F;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x8FD9;&#x79CD;&#x5931;&#x793C;&#x7684;&#x5427;&#xFF1F;</p>
<p>&#x7B54;&#x66F0;&#xFF0C;&#x5708;&#x5B50;&#x4E00;&#x822C;&#x6709;&#x9690;&#x55BB;&#xFF0C;&#x6392;&#x4ED6;&#x662F;&#x5708;&#x5B50;&#x7684;&#x672C;&#x8D28;&#x3002;</p>
<h2 id="&#x6BB5;&#x843D;2&#xFF08;&#x5708;&#x5B50;&#x95F4;&#x8026;&#x5408;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#xFF09;"><a href="#&#x6BB5;&#x843D;2&#xFF08;&#x5708;&#x5B50;&#x95F4;&#x8026;&#x5408;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#xFF09;" class="headerlink" title="&#x6BB5;&#x843D;2&#xFF08;&#x5708;&#x5B50;&#x95F4;&#x8026;&#x5408;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#xFF09;"></a>&#x6BB5;&#x843D;2&#xFF08;&#x5708;&#x5B50;&#x95F4;&#x8026;&#x5408;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#xFF09;</h2><p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4ECE;&#x8FD9;&#x4E2A;&#x6839;&#x4E0A;&#x8BA8;&#x538C;&#x4EFB;&#x4F55;&#x5708;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x5143;&#x6570;&#x636E;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#x5708;&#x5B50;&#x8FD9;&#x4E1C;&#x897F;&#x672C;&#x8EAB;&#x5B58;&#x5728;&#x5F0A;&#x7AEF;&#x3002;</p>
<p>&#x4E0D;&#x5982;&#x901A;&#x8FC7;&#x5708;&#x5B50;&#x7684;&#x6E20;&#x9053;&#x5EFA;&#x7ACB;&#x4E24;&#x4EBA;&#x7684;&#x4EB2;&#x5BC6;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x89E3;&#x51B3;&#x4E86;&#x81EA;&#x5DF1;&#x5BF9;&#x5708;&#x5B50;&#x7684;&#x5F3A;&#x8026;&#x5408;&#xFF0C;&#x4E8C;&#x907F;&#x514D;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x867D;&#x7136;&#x6709;&#x7528;&#xFF0C;&#x4E00;&#x662F;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x4F1A;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5708;&#x5B50;&#xFF0C;&#x4E8C;&#x662F;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x8D28;&#x91CF;&#x8FD0;&#x8425;&#x6210;&#x672C;&#x6781;&#x9AD8;&#xFF0C;&#x4E0D;&#x592A;&#x80FD;&#x8D70;&#x6781;&#x7AEF;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x5230;&#x63A8;&#x7279;/&#x5FAE;&#x535A;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x5C0F;&#x5708;&#x5B50;&#xFF0C;&#x90FD;&#x6709;&#x6240;&#x8C13;&#x7684;&#x5708;&#x5185;&#x72EC;&#x6709;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x67D0;&#x753B;&#x5E08;&#x5708;&#x5B50;&#x51FA;&#x4E86;&#x4EC0;&#x4E48;&#x6284;&#x88AD;&#x7EA0;&#x7EB7;&#xFF0C;&#x4E8E;&#x662F;&#x6302;&#x4E86;&#x4E2A;&#x4EBA;&#x3002;&#x800C;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x5E76;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x548C;&#x8FD9;&#x4E2A;&#x5708;&#x65E0;&#x5173;&#x7684;&#x4EBA;&#x90FD;&#x613F;&#x610F;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x5C5E;&#x4E8E;&#x5783;&#x573E;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x4F60;&#x53D1;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x5708;&#x5185;&#x4E5F;&#x8BB8;&#x8FBE;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x56FE;&#xFF0C;&#x5BF9;&#x5708;&#x5916;&#x5C31;&#x662F;&#x5931;&#x793C;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x4EBA;&#x4EEC;&#x4EFF;&#x4F5B;&#x5BF9;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x7684;&#x5931;&#x793C;&#x4E0E;&#x5426;&#x5E76;&#x4E0D;&#x592A;&#x5173;&#x5FC3;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x4E86;&#x5708;&#x5B50;&#x548C;&#x5708;&#x5B50;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x65E2;&#x7136;&#x4E24;&#x4E2A;&#x5708;&#x5B50;&#x6709;&#x8F83;&#x4F4E;&#x7684;&#x8026;&#x5408;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x8026;&#x5408;&#x5FC5;&#x7136;&#x88AB;&#x63A8;&#x5230;&#x4E86;&#x4F60;&#x8FD9;&#x4E2A;&#x8D26;&#x53F7;&#x8282;&#x70B9;&#x672C;&#x8EAB;&#x4E0A;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6211;&#xFF0C;&#x5FAE;&#x4FE1;&#x52A0;&#x4E09;&#x6B21;&#x5143;&#x7684;&#x719F;&#x4EBA;&#xFF0C;&#x53E6;&#x5916;&#x5206;&#x5F00;&#x5DE5;&#x4F5C;&#x7528;&#x5FAE;&#x4FE1;&#x5E94;&#x4ED8;&#x5DEE;&#x4E8B;&#x51E0;&#x4E4E;&#x4E0D;&#x770B;&#xFF0C;&#x5DE5;&#x4F5C;&#x7684;&#x4E8B;&#x4E00;&#x6982;&#x53EA;&#x80FD;RTX&#x627E;&#x5230;&#x6211;&#xFF0C;&#x63A8;&#x7279;&#x53EA;&#x52A0;&#x65E5;&#x672C;&#x4EBA;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x63A8;&#x7279;&#x53F7;&#x53EA;&#x52A0;&#x4E2D;&#x56FD;&#x4EBA;&#x7FFB;&#x5899;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5FAE;&#x535A;&#x53EA;&#x52A0;&#x57FA;&#x672C;&#x4E0D;&#x7FFB;&#x5899;&#x7684;&#x8001;&#x670B;&#x53CB;&#x3002;&#x8FD9;&#x6837;&#x5F7B;&#x5F7B;&#x5E95;&#x5E95;&#x7684;&#x6CA1;&#x8026;&#x5408;&#xFF0C;&#x5C31;&#x8FDE;&#x90AE;&#x7BB1;&#x4E5F;&#x5206;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x3002;</p>
<p>&#x7B54;&#x66F0;&#xFF1A;&#x90A3;&#x6837;&#x5F88;&#x7D2F;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6211;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x4E3A;&#x522B;&#x4EBA;&#x670D;&#x52A1;&#x3002;&#x6709;&#x65F6;&#x5019;&#x60F3;&#x5355;&#x72EC;&#x5F00;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x53F7;&#xFF0C;&#x4F46;&#x662F;&#x89C9;&#x5F97;&#x5206;&#x53F7;&#x540E;&#x89C9;&#x5F97;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x4EBA;&#x683C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8981;&#x6DE1;&#x5316;&#x201C;&#x6211;&#x201D;&#xFF0C;&#x610F;&#x8BC6;&#x7684;&#x5DEE;&#x5F02;&#x5C31;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x65E5;&#x672C;&#x4EBA;&#x5E73;&#x5747;&#x6BCF;&#x4EBA;&#x7528;3.5&#x4E2A;&#x63A8;&#x7279;&#x53F7;&#x6765;&#x89E3;&#x51B3;&#x8026;&#x5408;&#x95EE;&#x9898;&#x3002;&#x6211;&#x975E;&#x5E38;&#x719F;&#x6089;&#x65E5;&#x672C;&#x4EBA;&#x90A3;&#x5957;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x6839;&#x672C;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x201C;&#x4E0D;&#x8981;&#x5F71;&#x54CD;&#x522B;&#x4EBA;&#x201D;&#xFF0C;&#x751A;&#x81F3;&#x4E8E;&#x6839;&#x672C;&#x4E0D;&#x4F1A;&#x53BB;&#x8003;&#x8651;&#x8FD9;&#x79CD;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x7684;&#x8026;&#x5408;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x597D;&#x6BD4;&#x4E2D;&#x56FD;&#x83DC;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x628A;&#x4EC0;&#x4E48;&#x90FD;&#x6DF7;&#x5728;&#x4E00;&#x8D77;&#x7FFB;&#x7092;&#x706B;&#x706B;&#x70ED;&#x70ED;&#xFF0C;&#x800C;&#x65E5;&#x6599;&#x90FD;&#x662F;&#x5206;&#x5F00;&#x7684;&#x800C;&#x4E14;&#x751F;&#x51B7;&#x5C45;&#x591A;&#x3002;</p>
<h2 id="&#x6BB5;&#x843D;3&#xFF08;&#x601D;&#x8003;&#x95EE;&#x9898;&#x65B9;&#x5F0F;&#x95EE;&#x9898;&#xFF09;"><a href="#&#x6BB5;&#x843D;3&#xFF08;&#x601D;&#x8003;&#x95EE;&#x9898;&#x65B9;&#x5F0F;&#x95EE;&#x9898;&#xFF09;" class="headerlink" title="&#x6BB5;&#x843D;3&#xFF08;&#x601D;&#x8003;&#x95EE;&#x9898;&#x65B9;&#x5F0F;&#x95EE;&#x9898;&#xFF09;"></a>&#x6BB5;&#x843D;3&#xFF08;&#x601D;&#x8003;&#x95EE;&#x9898;&#x65B9;&#x5F0F;&#x95EE;&#x9898;&#xFF09;</h2><p>&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x6CA1;&#x6709;&#x201C;&#x4E0D;&#x8981;&#x5F71;&#x54CD;&#x522B;&#x4EBA;&#x201D;&#x7684;&#x89C2;&#x5FF5;&#x8FD8;&#x8981;&#x628A;&#x4EC0;&#x4E48;&#x90FD;&#x6405;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x662F;&#x4E2A;&#x5F88;&#x53EF;&#x6015;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x7B54;&#x66F0;&#xFF1A;&#x6BD4;&#x5982;&#x6211;&#x4F1A;&#x8FD9;&#x4E48;&#x60F3;&#xFF0C;&#x6405;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x8FD9;&#x662F;&#x597D;&#x4E8B;&#x8FD8;&#x662F;&#x574F;&#x4E8B;&#x5462;&#xFF1F;&#x800C;&#x4E0D;&#x662F;&#x60F3;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x597D;&#x4E48;&#xFF1F;</p>
<p>&#x5BF9;&#x66F0;&#xFF1A;&#x597D;&#x574F;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x4E00;&#x5957;&#x6807;&#x51C6;&#x6846;&#x67B6;&#x7684;&#x526F;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x7B54;&#x66F0;&#xFF1A;&#x6211;&#x7684;&#x601D;&#x8003;&#x5B9A;&#x5F0F;&#x662F; what if not</p>
<p>&#x5BF9;&#x66F0;&#xFF1A;&#x6211;&#x7684;&#x601D;&#x8003;&#x6A21;&#x5F0F;&#x662F; &#x73B0;&#x8C61;-&gt;&#x6846;&#x67B6;&#x4E0A;&#x7684;-&gt;&#x6587;&#x5316;&#x4E0A;&#x7684;-&gt;&#x53CD;&#x601D;&#x8FD9;&#x6761;&#x6587;&#x5316;&#x6846;&#x67B6;-&gt;&#x5982;&#x4F55;&#x5957;&#x7528;&#x5230;&#x81EA;&#x5DF1;&#x8EAB;&#x4E0A;&#xFF0C;&#x662F;&#x5F62;&#x800C;&#x4E0A;&#x7684;&#xFF0C;&#x5148;&#x641E;&#x4E2A;&#x6846;&#x67B6;</p>
<p>&#x7B54;&#x66F0;&#xFF1A;&#x5F62;&#x800C;&#x4E0B;&#x6539;&#x4E0D;&#x8FC7;&#x6765;&#x4E86;</p>
<p>&#x5BF9;&#x66F0;&#xFF1A;&#x6211;&#x4E5F;&#x6539;&#x4E0D;&#x8FC7;&#x6765;&#x4E86;</p>
<p>&#x7B54;&#x66F0;&#xFF1A;&#x597D;&#x574F;&#x6216;&#x8005;&#x793E;&#x4F1A;&#x8003;&#x8651;&#x90FD;&#x662F;&#x670D;&#x52A1;&#x4E8E; what if not &#x7684;&#xFF0C;&#x4F60;&#x8FD9;&#x79CD;&#x5BB9;&#x6613;&#x8E29;&#x5751;</p>
<p>&#x5BF9;&#x66F0;&#xFF1A;&#x662F;&#x7684;&#xFF0C;&#x6837;&#x672C;&#x91CF;&#x592A;&#x5C0F;&#x5BB9;&#x6613;&#x8D70;&#x504F;</p>
<p>&#x7B54;&#x66F0;&#xFF1A;&#x662F;&#x7684;&#x5C31;&#x4E8B;&#x8BBA;&#x4E8B;&#x4E5F;&#x5BB9;&#x6613;&#x8D70;&#x504F;</p>
<p>&#x5BF9;&#x66F0;&#xFF1A;&#x662F;&#x554A;&#xFF0C;&#x641E;N&#x5957;&#x6A21;&#x578B;&#xFF0C;&#x89E3;&#x91CA;&#x4E00;&#x4E2A;&#x9690;&#x53D8;&#x91CF;&#xFF0C;&#x6700;&#x540E;&#x600E;&#x4E48;&#x4FEE;&#x6B63;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x8FD8;&#x662F;&#x5F88;&#x4E3B;&#x89C2;&#x7684;</p>
<p>&#x7B54;&#x66F0;&#xFF1A;LSTM&#x2026;&#x2026;</p>
<p>&#x4E4B;&#x540E;&#x5C31;&#x5728;&#x804A;&#x4EC0;&#x4E48;ML&#x4EC0;&#x4E48;Spark&#x4EC0;&#x4E48;&#x67B6;&#x6784;&#x5E08;&#x4EC0;&#x4E48;&#x5B66;&#x65E5;&#x8BED;&#x4EC0;&#x4E48;&#x5531;K&#x4E86;&#x2026;&#x2026;&#x8FD9;&#x6837;&#x7684;&#x804A;&#x5929;&#x771F;&#x662F;&#x9178;&#x723D;&#xFF0C;&#x6B63;&#x4EA7;&#x4EBA;&#x7C7B;&#x770B;&#x4E86;&#x60F3;&#x5410;w</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/机器学习/概率图模型/" rel="next" title="概率图模型">
                <i class="fa fa-chevron-left"></i> 概率图模型
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/其他技术/不要把架构搞得太复杂/" rel="prev" title="不要把架构搞得太复杂">
                不要把架构搞得太复杂 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/icon.jpeg"
               alt="アカリ" />
          <p class="site-author-name" itemprop="name">アカリ</p>
          <p class="site-description motion-element" itemprop="description">很羡慕工作后辞职读研的人，能腾出一两年的大片时间来专心学习某个自己喜欢的领域的知识技能其实是一件非常幸福的事……</p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/">
                <span class="site-state-item-count">23</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#段落1（聊天中使用图片的过拟合问题）"><span class="nav-number">1.</span> <span class="nav-text">段落1（聊天中使用图片的过拟合问题）</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#段落2（圈子间耦合度的问题）"><span class="nav-number">2.</span> <span class="nav-text">段落2（圈子间耦合度的问题）</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#段落3（思考问题方式问题）"><span class="nav-number">3.</span> <span class="nav-text">段落3（思考问题方式问题）</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">アカリ</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	





  




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=default"></script>
  


  

  

  


</body>
</html>
