<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="写在二月，记录一些关于社交网络评论区的感慨">
<meta property="og:type" content="article">
<meta property="og:title" content="人的认知局限和社交网络评论区">
<meta property="og:url" content="http://yoursite.com/心情随笔/人的认知局限和社交网络评论区/index.html">
<meta property="og:site_name" content="アカリの部屋">
<meta property="og:description" content="写在二月，记录一些关于社交网络评论区的感慨">
<meta property="og:updated_time" content="2018-06-13T11:58:42.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="人的认知局限和社交网络评论区">
<meta name="twitter:description" content="写在二月，记录一些关于社交网络评论区的感慨">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/心情随笔/人的认知局限和社交网络评论区/"/>





  <title> 人的认知局限和社交网络评论区 | アカリの部屋 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">アカリの部屋</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <p class="site-subtitle"></p>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-links">
          <a href="/links" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-question-circle"></i> <br />
            
            友链
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/心情随笔/人的认知局限和社交网络评论区/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="アカリ">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/icon.jpeg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="アカリの部屋">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="アカリの部屋" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                人的认知局限和社交网络评论区
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2018-02-04T23:00:00+08:00">
                2018-02-04
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/心情随笔/" itemprop="url" rel="index">
                    <span itemprop="name">心情随笔</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          
              <div class="post-description">
                  写在二月，记录一些关于社交网络评论区的感慨
              </div>
          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6700;&#x8FD1;&#x9971;&#x548C;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x548C;&#x5BB6;&#x91CC;&#x53D1;&#x751F;&#x7684;&#x4E00;&#x5207;&#x4E8B;&#x60C5;&#x628A;&#x65F6;&#x95F4;&#x6324;&#x6EE1;&#x4E86;&#xFF0C;&#x6DF1;&#x5207;&#x4F53;&#x4F1A;&#x5230;&#x4EC0;&#x4E48;&#x53EB;&#xFF3B;&#x6CA1;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#xFF0C;&#x6CA1;&#x65F6;&#x95F4;&#x5199;&#x535A;&#x5BA2;&#xFF3D;&#xFF0C;&#x4E00;&#x6708;&#x4EFD;&#x4E00;&#x6574;&#x4E2A;&#x6708;&#x80FD;&#x62BD;&#x51FA;&#x6765;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x95F4;&#x5927;&#x6982;&#x53EA;&#x6709;6&#x6B21;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x56F4;&#x7ED5;&#x7740;tensorflow&#x3002;&#x81EA;&#x5B66;ML&#x5165;&#x5751;&#x4E5F;&#x6709;&#x4E00;&#x5E74;&#x4E86;&#x5427;&#xFF0C;&#x4E5F;&#x505A;&#x4E86;&#x4E00;&#x4E9B;DM&#x7684;&#x9879;&#x76EE;&#x9700;&#x6C42;&#xFF0C;&#x6700;&#x8D77;&#x521D;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x662F;&#x6253;&#x7B97;&#x8BB0;&#x5F55;&#x4E00;&#x4E9B;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x5728;&#x5F88;&#x5C0F;&#x7684;&#x8303;&#x56F4;&#x516C;&#x5F00;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x50CF;&#x73B0;&#x5728;&#x770B;&#x5230;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x4F46;&#x7F51;&#x7AD9;&#x524D;&#x7AEF;&#x6709;&#x7684;&#x9875;&#x9762;&#x8FD8;&#x662F;&#x767D;&#x7684;&#x6CA1;&#x5F04;&#xFF0C;&#x6709;&#x4E9B;&#x529F;&#x80FD;&#x90FD;&#x6CA1;&#x52A0;&#x4E0A;&#x53BB;&#xFF0C;&#x6587;&#x7AE0;&#x6570;&#x4E5F;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5B66;&#x4E60;&#x5230;&#x7684;ML&#x7684;&#x4E3B;&#x9898;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x800C;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x6709;&#x5F88;&#x591A;&#x5BF9;ML&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#x6839;&#x672C;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x5B8C;&#x5584;&#x5230;&#x4EE5;&#x524D;&#x535A;&#x5BA2;&#x91CC;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x6709;&#x591A;&#x5199;&#x5199;Spark&#x548C;&#x5176;&#x4ED6;&#x5185;&#x5BB9;&#x591A;&#x60F3;&#x6CD5;&#xFF0C;&#x4E5F;&#x6CA1;&#x65F6;&#x95F4;&#x5B9E;&#x73B0;&#xFF0C;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x4E8B;&#x4ECA;&#x5E74;&#x80FD;&#x505A;&#x597D;&#x4E9B;&#xFF0C;&#x8D77;&#x7801;&#x628A;&#x539F;&#x6765;&#x7684;&#x5E16;&#x5B50;&#x518D;&#x591A;&#x5B8C;&#x5584;&#x5B8C;&#x5584;&#x3002;</p>
<p>&#x6BD4;&#x8D77;&#x6280;&#x672F;&#xFF0C;&#x4ECA;&#x5929;&#x6765;&#x603B;&#x7ED3;&#x4E00;&#x4E9B;&#x6700;&#x8FD1;&#x7684;&#x4F53;&#x4F1A;&#x5427;&#xFF0C;&#x6700;&#x8FD1;&#x5728;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x5FAE;&#x535A;&#x4E0A;&#x51FA;&#x4E86;&#x4E0D;&#x5C11;&#x4E8B;&#xFF0C;&#x4ECE;&#x65E5;&#x672C;&#x7559;&#x5B66;&#x751F;&#x6740;&#x4EBA;&#x6848;&#x3001;&#x5230;&#x6740;&#x72D7;&#x89C6;&#x9891;&#x3001;&#x5230;&#x767D;&#x5AD6;&#x4E0E;&#x6B63;&#x7248;&#x4E4B;&#x4E89;&#x3001;&#x5230;&#x4E3E;&#x62A5;&#x6C49;&#x5316;&#x3001;blabla&#x2026;&#x8BC4;&#x8BBA;&#x533A;&#x4E5F;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x662F;&#x5BF9;&#x9A82;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x8D77;&#x9A82;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x8FD9;&#x6211;&#x4E0D;&#x592A;&#x60F3;&#x8BF4;&#x5177;&#x4F53;&#x5BF9;&#x4E8B;&#x4EF6;&#xFF0C;&#x60F3;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x62BD;&#x8C61;&#x5C42;&#x9762;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x6240;&#x5728;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x5C9B;A&#xFF0C;&#x548C;&#x51E0;&#x4E2A;&#x5176;&#x4ED6;&#x5C0F;&#x5C9B;BCD&#x2026;&#xFF0C;A&#x5C9B;&#x4E0A;&#x6709;&#x4E09;&#x4E2A;&#x5F3A;&#x76D7;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x5730;&#x53BB;&#x63A0;&#x593A;&#x5176;&#x4ED6;&#x5C9B;&#x4E0A;&#x7684;&#x98DF;&#x7269;&#x3002;<br>&#x55EF;&#xFF0C;&#x5230;&#x8FD9;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B0;&#x95FB;/&#x89C6;&#x9891;&#x7206;&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x60F3;&#x5FC5;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x9A82;&#x5F3A;&#x76D7;&#xFF0C;&#x7136;&#x540E;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6545;&#x4E8B;&#x6362;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x5C9B;A&#xFF0C;&#x548C;&#x51E0;&#x4E2A;&#x5176;&#x4ED6;&#x5C0F;&#x5C9B;BCD&#x2026;&#xFF0C;A&#x5C9B;&#x4E0A;&#x6709;&#x4E09;&#x4E2A;&#x4EBA;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x5730;&#x53BB;&#x63A0;&#x593A;&#x5176;&#x4ED6;&#x5C9B;&#x4E0A;&#x7684;&#x98DF;&#x7269;&#xFF0C;A&#x5C9B;&#x662F;&#x4E2A;&#x5F88;&#x8D2B;&#x7620;&#x7684;&#x5C9B;&#x5C7F;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x51FA;&#x4EA7;&#xFF0C;&#x5728;&#x8FD9;&#x4E09;&#x4E2A;&#x4EBA;&#x7684;&#x52AA;&#x529B;&#x4E0B;&#xFF0C;A&#x5C9B;&#x4E0A;&#x7684;&#x4EBA;&#x751F;&#x6D3B;&#x8FC7;&#x5F97;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x8FD9;&#x4E09;&#x4EBA;&#x88AB;&#x8A89;&#x4E3A;&#x82F1;&#x96C4;&#x3002;<br>&#x5230;&#x8FD9;&#xFF0C;&#x5927;&#x5BB6;&#x4F1A;&#x5BF9;&#x8FD9;&#x4E09;&#x4E2A;&#x4EBA;&#x62B1;&#x7740;&#x8912;&#x8D2C;&#x4E0D;&#x4E00;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x6709;&#x7684;&#x8868;&#x793A;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x6709;&#x7684;&#x8868;&#x793A;&#x9519;&#x7684;&#x5C31;&#x662F;&#x9519;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x6495;&#x903C;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x518D;&#x7EE7;&#x7EED;&#x5199;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x5929;&#xFF0C;A&#x5C9B;&#x4E0A;&#x7684;&#x4E09;&#x4E2A;&#x5F3A;&#x76D7;&#x88AB;&#x5176;&#x4ED6;&#x5C9B;&#x7684;&#x4EBA;&#x6293;&#x4F4F;&#x6253;&#x6B7B;&#x4E86;&#xFF0C;&#x4ECE;&#x6B64;A&#x5C9B;&#x7684;&#x597D;&#x65E5;&#x5B50;&#x4E00;&#x53BB;&#x4E0D;&#x590D;&#x8FD4;&#xFF0C;A&#x5C9B;&#x58F0;&#x79F0;&#x5176;&#x4ED6;&#x5C9B;&#x662F;&#x90AA;&#x6076;&#x7684;&#xFF08;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x70B9;&#x671D;&#x9C9C;&#x7684;&#x5473;&#x9053;&#xFF1F;&#xFF09;&#xFF0C;&#x81EA;&#x5DF1;&#x662F;&#x53D7;&#x5BB3;&#x8005;&#xFF0C;&#x5176;&#x4ED6;&#x5C9B;&#x5219;&#x58F0;&#x79F0;A&#x662F;&#x90AA;&#x6076;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x5C9B;&#x624D;&#x662F;&#x53D7;&#x5BB3;&#x8005;&#xFF0C;&#x5176;&#x4ED6;&#x5C9B;&#x81EA;&#x8EAB;&#x6D88;&#x706D;&#x4E86;&#x5F3A;&#x76D7;&#x624D;&#x662F;&#x6B63;&#x4E49;&#x7684;&#x3002;<br>&#x8FD9;&#x4F3C;&#x4E4E;&#x5F00;&#x59CB;&#x6709;&#x70B9;Fate Zero&#x7684;&#x5473;&#x9053;&#x4E86;&#xFF1F;&#x7ED3;&#x8BBA;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8FD9;&#x65F6;&#x5019;&#x7F51;&#x6C11;&#x4EEC;&#x5F00;&#x59CB;&#x5206;&#x9635;&#x8425;&#x76F8;&#x4E92;&#x603C;&#x4E86;&#xFF0C;&#x660E;&#x767D;&#x4E00;&#x4E9B;&#x7684;&#x5C31;&#x5F00;&#x59CB;&#x8BA8;&#x8BBA;&#x6240;&#x8C13;&#x6B63;&#x4E49;&#x6839;&#x672C;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x53EA;&#x6709;&#x5229;&#x76CA;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x4E2A;&#x58F0;&#x97F3;&#x4E5F;&#x8BB8;&#x4F1A;&#x76F4;&#x63A5;&#x88AB;&#x6DF9;&#x6CA1;&#x3002;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x6211;&#x4EEC;&#x7684;&#x6545;&#x4E8B;&#x2026;&#x2026;</p>
<p>&#x63D2;&#x4E2A;&#x4EBA;&#x5DE5;&#x5206;&#x5272;&#x7EBF;&#x2026;<br>&#x6B63;&#x6253;&#x5230;&#x8FD9;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x5BA3;&#x5E03;&#x8DD1;&#x8DEF;&#x53BB;&#x65E5;&#x672C;&#x5DE5;&#x4F5C;&#xFF0C;&#x5A18;&#x7684;&#xFF0C;&#x8DDF;&#x6211;&#x4EA4;&#x670B;&#x53CB;&#x7684;&#x4EBA;&#x4E00;&#x4E2A;&#x4E2A;&#x90FD;&#x8089;&#x7FFB;&#x4E86;&#xFF0C;&#x4ECE;&#x6B64;&#x80FD;&#x89C1;&#x9762;&#x7684;&#x53C8;&#x5C11;&#x4E86;&#x4E00;&#x4E2A;&#xFF0C;&#x304B;&#x306A;&#x3057;&#x3044;&#x2026;<br>&#x5206;&#x5272;&#x7EBF;&#x5B8C;&#xFF08;&#xFF08;&#xFF08;</p>
<p>A&#x5C9B;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x5B69;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x5C9B;&#x4E0A;&#x5403;&#x4E0D;&#x9971;&#xFF0C;&#x6240;&#x4EE5;&#x6C11;&#x4F17;&#x5F7C;&#x6B64;&#x76F8;&#x5BB3;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x4E0D;&#x5C11;&#xFF0C;&#x8FD9;&#x5B69;&#x5B50;&#x5C0F;&#x65F6;&#x5019;&#x4E5F;&#x5403;&#x4E0D;&#x9971;&#xFF0C;&#x6709;&#x4E00;&#x6B21;&#x4ED6;&#x88AB;&#x4E00;&#x4E2A;&#x5176;&#x4ED6;&#x5C9B;&#x6765;&#x7684;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x7537;&#x4EBA;&#x6551;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x4E86;&#x4ED6;&#x4E00;&#x987F;&#x9971;&#x996D;&#xFF0C;&#x5C0F;&#x7537;&#x5B69;&#x61A7;&#x61AC;&#x8FD9;&#x4E2A;&#x7537;&#x4EBA;&#xFF0C;&#x4E8E;&#x662F;&#x52AA;&#x529B;&#x594B;&#x6597;&#xFF0C;&#x6210;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x529E;&#x4E86;&#x5F88;&#x591A;&#x5F88;&#x82F1;&#x52C7;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4EF0;&#x4ED7;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x529B;&#x91CF;&#x56E2;&#x7ED3;&#x4E86;&#x6C11;&#x4F17;&#xFF0C;&#x6539;&#x53D8;&#x4E86;&#x6C11;&#x98CE;&#xFF0C;&#x6210;&#x4E3A;&#x4E86;&#x4EBA;&#x4EBA;&#x4F20;&#x9882;&#x7684;&#x82F1;&#x96C4;&#x3002;&#x5BF9;&#xFF0C;&#x4ED6;&#x5C31;&#x662F;&#x540E;&#x6765;&#x7684;&#x4E09;&#x4E2A;&#x5F3A;&#x76D7;&#x4E4B;&#x4E00;&#x3002;<br>&#x8FD9;&#x4E0B;&#x6545;&#x4E8B;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x597D;&#x591A;&#x6D77;&#x8D3C;&#x52A8;&#x6F2B;&#x7684;&#x6807;&#x51C6;&#x6846;&#x67B6;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x6CA1;&#x6CD5;&#x60F3;&#x8C61;&#x7F51;&#x6C11;&#x600E;&#x4E48;&#x8BC4;&#x8BBA;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x9B54;&#x9B3C;&#x627E;&#x5230;&#x4E0A;&#x5E1D;&#xFF0C;&#x8BF4;&#x8FD9;&#x4E9B;&#x6C11;&#x5BF9;&#x795E;&#x4E0D;&#x5FE0;&#x5FC3;&#xFF0C;&#x6211;&#x8981;&#x8BD5;&#x9A8C;&#x4E00;&#x4E0B;&#x8FD9;&#x5730;&#x4E0A;&#x7684;&#x6C11;&#x4F1A;&#x4E0D;&#x4F1A;&#x80CC;&#x53DB;&#x4F60;&#xFF01;&#x4E0A;&#x5E1D;&#x8BF4;&#x4F60;&#x53BB;&#x5427;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x8981;&#x4F24;&#x4ED6;&#x4EEC;&#x6027;&#x547D;&#x3002;&#x4E8E;&#x662F;&#x9B54;&#x9B3C;&#x4F7F;A&#x5C9B;&#x8D2B;&#x4E4F;&#xFF0C;&#x4F7F;&#x6076;&#x5FF5;&#x8FDB;&#x5165;&#x4E86;&#x4EBA;&#x4EEC;&#x7684;&#x5FC3;&#xFF0C;&#x4F7F;&#x4EBA;&#x4EEC;&#x5F7C;&#x6B64;&#x884C;&#x6076;&#x3002;&#x800C;&#x4E0A;&#x5E1D;&#x5219;&#x65F6;&#x4E0D;&#x65F6;&#x5730;&#x5B89;&#x6392;&#x4E00;&#x4E9B;&#x667A;&#x8005;&#x53BB;&#x8FD9;&#x5EA7;&#x5C9B;&#x4E0A;&#xFF0C;&#x5076;&#x5C14;&#x7ED9;&#x4EBA;&#x5E26;&#x6765;&#x4E00;&#x70B9;&#x751F;&#x7684;&#x5E0C;&#x671B;&#x3002;&#x4E0A;&#x5E1D;&#x548C;&#x9B54;&#x9B3C;&#x90FD;&#x59CB;&#x7EC8;&#x4E0D;&#x5BF9;&#x4EBA;&#x76F4;&#x63A5;&#x663E;&#x73B0;&#xFF0C;&#x4E0D;&#x548C;&#x4EBA;&#x76F4;&#x63A5;&#x8BF4;&#x8BDD;&#x3002;<br>&#x662F;&#x4E0D;&#x662F;&#x6709;&#x5723;&#x7ECF;&#x7EA6;&#x4F2F;&#x8BB0;&#x7684;&#x5473;&#x9053;&#xFF1F;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x4E94;&#x767E;&#x5E74;&#x524D;&#xFF0C;&#x5728;&#x8FDC;&#x79BB;ABCD&#x5C9B;&#x4E0A;&#x7684;&#x5927;&#x9646;&#x4E0A;&#xFF0C;&#x6709;&#x4E00;&#x540D;&#x5148;&#x77E5;&#xFF0C;&#x4ED6;&#x7684;&#x4E66;&#x4E0A;&#x5199;&#x7740;&#xFF1A;&#xFF3B;&#x5728;&#x90A3;&#x65F6;&#xFF0C;&#x707E;&#x96BE;&#x8981;&#x4E34;&#x5230;&#x8FD9;&#x5730;&#xFF0C;&#x5728;&#x5C9B;&#x4E0A;&#x5FC5;&#x8D77;&#x7EB7;&#x4E89;&#xFF0C;&#x65E0;&#x77E5;&#x7684;&#x6C11;&#x90FD;&#x8981;&#x81EA;&#x4EE5;&#x4E3A;&#x6B63;&#x4E49;&#x3001;&#x4ED6;&#x4EEC;&#x5FC5;&#x8981;&#x5F7C;&#x6B64;&#x76F8;&#x4E89;&#xFF0C;&#x5374;&#x4E0D;&#x6094;&#x6539;&#x4ED6;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x2026;&#xFF3D;&#x8FD9;&#x4E66;&#x6CA1;&#x4EBA;&#x80FD;&#x8BFB;&#x5F97;&#x61C2;&#xFF0C;&#x8FC7;&#x4E86;&#x4E00;&#x5343;&#x5E74;&#x540E;&#xFF0C;&#x9884;&#x8A00;&#x624D;&#x88AB;&#x5386;&#x53F2;&#x5B66;&#x5BB6;&#x7834;&#x8BD1;&#x3002;<br>&#x55EF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5178;&#x578B;&#x7684;&#x5723;&#x7ECF;&#x6A21;&#x5F0F;&#x4E86;&#x3002;</p>
<p>&#x770B;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x5417;&#xFF1F;&#x8FD9;&#x4E9B;&#x6210;&#x5929;&#x778E;&#x903C;&#x903C;&#x7684;&#x7F51;&#x6C11;&#x6839;&#x672C;&#x770B;&#x4E0D;&#x5230;&#x4E8B;&#x60C5;&#x7684;&#x5168;&#x8C8C;&#xFF0C;&#x4E0A;&#x5E1D;&#x4E5F;&#x4E0D;&#x7ED9;&#x4EBA;&#x89E3;&#x91CA;&#x5168;&#x8C8C;&#xFF0C;&#x4E0A;&#x5E1D;&#x53EA;&#x53EB;&#x4EBA;&#x4E0D;&#x8981;&#x8BBA;&#x65AD;&#x3002;&#x4EBA;&#xFF0C;&#x5403;&#x4E86;&#x5206;&#x8FA8;&#x5584;&#x6076;&#x6811;&#x7684;&#x679C;&#x5B50;&#xFF0C;&#x50CF;&#x795E;&#x4E00;&#x6837;&#x6709;&#x667A;&#x6167;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x795E;&#x7684;&#x5168;&#x77E5;&#xFF0C;&#x8FD8;&#x5E26;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x9A84;&#x50B2;&#xFF0C;&#x4E00;&#x5F20;&#x5634;&#xFF0C;&#x5C31;&#x662F;&#xFF3B;&#x6211;&#x662F;&#x5BF9;&#x7684;&#x4F60;&#x662F;&#x9519;&#x7684;&#xFF3D;&#x3002;</p>
<p>&#x8981;&#x8BF4;&#x7F51;&#x4E0A;&#x4EBA;&#x7FA4;&#x5206;&#x88C2;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x8C01;&#x5F15;&#x8D77;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#x4E89;&#x8BBA;&#x5462;&#xFF1F;&#x5C82;&#x4E0D;&#x662F;&#x53D1;&#x89C6;&#x9891;&#x3001;&#x53D1;&#x6587;&#x7AE0;&#x3001;&#x5E26;&#x8282;&#x594F;&#x7684;&#x5927;V&#x4E48;&#xFF1F;&#x4ED6;&#x4EEC;&#x80CC;&#x540E;&#x53C8;&#x662F;&#x8C01;&#x6307;&#x4F7F;&#x7684;&#x5462;&#xFF1F;&#x8BA9;&#x767E;&#x540D;&#x5FD9;&#x4E8E;&#x6495;&#x903C;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x76EE;&#x7684;&#x5462;&#xFF1F;<br>&#x8BF4;&#x771F;&#x7684;&#xFF0C;&#x9648;&#x6740;&#x6C5F;&#x4E00;&#x4E2A;&#x6C11;&#x4E8B;&#x6848;&#x4EF6;&#xFF0C;&#x8DDF;&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x4EBA;&#x6253;&#x6B7B;&#x4E00;&#x6761;&#x72D7;&#xFF0C;&#x8DDF;&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x6211;&#x6B7B;&#x4E86;&#x8DDF;&#x4ED6;&#x4EEC;&#x4E5F;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#x4E00;&#x6837;&#x3002;&#x6211;&#x5929;&#x5929;&#x5FD9;&#x5F97;&#x8981;&#x6B7B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x6CA1;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x6D6A;&#x8D39;&#x7CBE;&#x529B;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8FD8;&#x5F97;&#x88C5;&#x6210;&#x4E00;&#x4E2A;&#x6240;&#x8C13;&#x6B63;&#x4E49;&#x4F7F;&#x8005;&#x6765;&#x6279;&#x5224;&#x4ED6;&#x4EEC;&#x4E00;&#x756A;&#x624D;&#x884C;&#x3001;&#x4E0D;&#x7136;&#x5C31;&#x88AB;&#x89C6;&#x4F5C;&#x4EC0;&#x4E48;&#x9EBB;&#x6728;&#x4EC0;&#x4E48;&#x5947;&#x8469;&#xFF1F;</p>
<p>&#x8111;&#x5B50;&#x662F;&#x4E2A;&#x597D;&#x4E1C;&#x897F;&#xFF0C;&#x53CD;&#x6B63;&#x65E5;&#x63A8;&#x4E0A;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x4E9B;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#xFF0C;&#x7D2F;&#x4E86;&#xFF0C;&#x4ECA;&#x5929;&#x5C31;&#x5199;&#x5230;&#x8FD9;&#xFF0C;&#x7ED3;&#x8BBA;&#x5C31;&#x662F;&#xFF1A;&#xFF3B;&#x5FD9;&#x7740;&#x4EAB;&#x4E50;&#xFF0C;&#x6CA1;&#x65F6;&#x95F4;&#x770B;&#x50BB;&#x903C;&#x6495;&#x903C;&#xFF3D;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/机器学习/循环神经网络/" rel="next" title="循环神经网络">
                <i class="fa fa-chevron-left"></i> 循环神经网络
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/机器学习/TensorFlow数据预处理和共享变量/" rel="prev" title="TensorFlow数据预处理和共享变量">
                TensorFlow数据预处理和共享变量 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/icon.jpeg"
               alt="アカリ" />
          <p class="site-author-name" itemprop="name">アカリ</p>
          <p class="site-description motion-element" itemprop="description">很羡慕工作后辞职读研的人，能腾出一两年的大片时间来专心学习某个自己喜欢的领域的知识技能其实是一件非常幸福的事……</p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/">
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">アカリ</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	





  




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=default"></script>
  


  

  

  


</body>
</html>
