<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="由于最近个人原因，学习的重点并没有放在学技术上，而且主要最近在弄一些大数据框架，和机器学习也不太沾边，技术的内容就迟迟没有更新，于是发这第二篇吹水文，还是谈谈对一些话题的思考。">
<meta property="og:type" content="article">
<meta property="og:title" content="分辨善恶">
<meta property="og:url" content="http://yoursite.com/心情随笔/分辨善恶/index.html">
<meta property="og:site_name" content="アカリの部屋">
<meta property="og:description" content="由于最近个人原因，学习的重点并没有放在学技术上，而且主要最近在弄一些大数据框架，和机器学习也不太沾边，技术的内容就迟迟没有更新，于是发这第二篇吹水文，还是谈谈对一些话题的思考。">
<meta property="og:updated_time" content="2018-06-14T16:44:15.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="分辨善恶">
<meta name="twitter:description" content="由于最近个人原因，学习的重点并没有放在学技术上，而且主要最近在弄一些大数据框架，和机器学习也不太沾边，技术的内容就迟迟没有更新，于是发这第二篇吹水文，还是谈谈对一些话题的思考。">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/心情随笔/分辨善恶/"/>





  <title> 分辨善恶 | アカリの部屋 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">アカリの部屋</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <p class="site-subtitle"></p>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-links">
          <a href="/links" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-question-circle"></i> <br />
            
            友链
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/心情随笔/分辨善恶/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="アカリ">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/icon.jpeg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="アカリの部屋">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="アカリの部屋" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                分辨善恶
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2018-06-24T20:00:00+08:00">
                2018-06-24
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/心情随笔/" itemprop="url" rel="index">
                    <span itemprop="name">心情随笔</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          
              <div class="post-description">
                  由于最近个人原因，学习的重点并没有放在学技术上，而且主要最近在弄一些大数据框架，和机器学习也不太沾边，技术的内容就迟迟没有更新，于是发这第二篇吹水文，还是谈谈对一些话题的思考。
              </div>
          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x95EE;&#x9898;"><a href="#&#x95EE;&#x9898;" class="headerlink" title="&#x95EE;&#x9898;"></a>&#x95EE;&#x9898;</h2><p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7B97;&#x662F;&#x6211;&#x5728;&#x4E8C;&#x6708;&#x4EFD;&#x5199;&#x7684;&#x90A3;&#x7BC7;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x8BC4;&#x8BBA;&#x533A;&#x611F;&#x53D7;&#x7684;&#x5EF6;&#x7EED;&#xFF0C;&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x8FA9;&#x8BBA;&#x4E00;&#x4E2A;&#x8BDD;&#x9898;&#x2014;&#x2014;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x76D7;&#x7248;&#xFF0C;&#x6216;&#x8005;&#xFF0C;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x5356;&#x9ED1;&#x4EA7;&#x3002;</p>
<p>&#x9996;&#x5148;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x4E00;&#x770B;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9493;&#x9C7C;&#x5E16;&#xFF0C;&#x53D1;&#x5230;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E0A;&#x53EA;&#x4F1A;&#x6709;&#x4E24;&#x79CD;&#x7ED3;&#x679C;&#xFF0C;&#x4E00;&#x662F;&#x4EBA;&#x5206;&#x6210;&#x4E24;&#x6CE2;&#x76F8;&#x4E92;&#x6495;&#x903C;&#x76F8;&#x4E92;&#x9053;&#x5FB7;&#x5BA1;&#x5224;&#xFF0C;&#x201C;&#x6211;&#x662F;&#x5BF9;&#x7684;&#x4F60;&#x662F;&#x9519;&#x7684;&#x201D;&#xFF0C;&#x8FDB;&#x800C;&#x5F15;&#x53D1;&#x4EBA;&#x9645;&#x5173;&#x7CFB;&#x5206;&#x88C2;&#xFF0C;&#x4E8C;&#x662F;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x8D77;&#x6765;&#x5BF9;&#x9898;&#x4E3B;&#x8FDB;&#x884C;&#x9053;&#x5FB7;&#x5BA1;&#x5224;&#xFF0C;&#x4E25;&#x683C;&#x6765;&#x8BB2;&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x5C5E;&#x4E8E;&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x4F8B;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x4ECE;&#x56DB;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x5206;&#x6790;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<p>1.&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#xFF3B;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x76D7;&#x7248;&#xFF3D;&#xFF0C;&#x4F1A;&#x88AB;&#xFF3B;&#x5927;&#x591A;&#x6570;&#x4EBA;&#xFF3D;&#x4EE5;&#x4E00;&#x79CD;&#xFF3B;&#x96C6;&#x4F53;&#x653F;&#x6CBB;&#x6B63;&#x786E;&#xFF3D;&#x5BA1;&#x5224;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x8FD9;&#xFF3B;&#x5C31;&#x662F;&#xFF3D;&#x4E0D;&#x5BF9;&#x7684;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x7406;&#x7531;&#xFF0C;&#x7136;&#x540E;&#x5F62;&#x6210;&#x4E00;&#x79CD;&#x4EBA;&#x591A;&#x529B;&#x91CF;&#x5927;&#x7684;&#x58F0;&#x52BF;&#x6765;&#x6DF9;&#x6CA1;&#x4F60;&#x3002;<br>2.&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#xFF3B;&#x4E0D;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x76D7;&#x7248;&#xFF3D;&#x6216;&#x7C7B;&#x4F3C;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x4F60;&#x66FE;&#x7ECF;&#x662F;&#x76D7;&#x7248;&#x7684;&#x53D7;&#x76CA;&#x8005;(&#x4E0D;&#x8BBA;&#x81EA;&#x77E5;&#x6216;&#x4E0D;&#x81EA;&#x77E5;)&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x6492;&#x8C0E;&#x7684;&#xFF0C;&#x88AB;&#x63ED;&#x7A7F;&#x7684;&#x8BDD;&#x4F60;&#x5C31;&#x8981;&#x8D77;&#x6765;&#x4E3A;&#x81EA;&#x5DF1;&#x5F00;&#x8131;&#x8FA9;&#x89E3;&#xFF0C;&#x7136;&#x800C;&#x4F60;&#x5DF2;&#x7ECF;&#x6D17;&#x4E0D;&#x6E05;&#x4E86;&#x3002;<br>3.&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#xFF3B;&#x76D7;&#x7248;&#x6709;&#x76CA;&#x5904;&#x4F46;&#x4E5F;&#x6709;&#x574F;&#x5904;&#xFF3D;&#xFF0C;&#x7AD9;&#x5728;&#x4E2D;&#x7ACB;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F60;&#x4E00;&#x6837;&#x4F1A;&#x88AB;&#x5BA1;&#x5224;&#x4E3A;&#xFF3B;&#x5077;&#x6362;&#x6982;&#x5FF5;&#x3001;&#x5584;&#x6076;&#x4E0D;&#x5206;&#x3001;&#x7ACB;&#x573A;&#x4E0D;&#x575A;&#x5B9A;&#xFF3D;&#xFF0C;&#x6700;&#x7EC8;&#x4E5F;&#x4F1A;&#x53D7;&#x5230;&#xFF3B;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x76D7;&#x7248;&#xFF3D;&#x7684;&#x5BA1;&#x5224;&#x3002;<br>4.&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#xFF3B;&#x4F60;&#x7279;&#x4E48;&#x5C31;&#x662F;&#x5728;&#x9493;&#x9C7C;&#xFF3D;&#xFF0C;&#x6211;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x5BA1;&#x5224;&#x4F60;&#x8BF4;&#x4F60;&#x8FD9;&#x4E48;&#x8BF4;&#x5728;&#x88C5;&#x6E05;&#x9AD8;&#x3002;<br>5.&#x5916;&#x52A0;&#x4E00;&#x4E2A;&#x7B2C;&#x4E94;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x4ECE;&#x4E0A;&#x9762;&#x56DB;&#x4E2A;&#x65B9;&#x9762;&#x6765;&#x8BA8;&#x8BBA;&#xFF0C;&#x4F60;&#x4F1A;&#x5BA1;&#x5224;&#x8BF4;&#x6211;&#x5728;&#x98A0;&#x5012;&#xFF3B;&#x4F60;&#x8BA4;&#x4E3A;&#x7684;&#x9ED1;&#x767D;&#xFF3D;&#xFF0C;&#x662F;&#x8BE1;&#x8FA9;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x731C;&#x6D4B;&#x53D1;&#x5E16;&#x4EBA;&#x7684;&#x7528;&#x610F;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x5C31;&#x662F;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x6216;&#x8005;QQ&#x7FA4;&#x70B8;&#x9505;&#x6495;&#x903C;&#x7684;&#x65E5;&#x5E38;&#x73B0;&#x8C61;&#x5417;&#xFF1F;</p>
<h2 id="&#x9000;&#x540E;"><a href="#&#x9000;&#x540E;" class="headerlink" title="&#x9000;&#x540E;"></a>&#x9000;&#x540E;</h2><p>&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8BDA;&#x5B9E;&#x7684;&#x56DE;&#x7B54;&#x662F;&#xFF0C;&#x76D7;&#x7248;&#x5BF9;&#x5546;&#x4E1A;&#x65B9;&#x9762;&#x786E;&#x5B9E;&#x6709;&#x5BB3;&#xFF0C;&#x800C;&#x6269;&#x5927;&#x4EA7;&#x54C1;&#x5F71;&#x54CD;&#x5374;&#x6709;&#x76CA;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x591A;&#x5C11;&#x65E2;&#x7136;&#x90FD;&#x662F;&#x76D7;&#x7248;&#x7684;&#x53D7;&#x76CA;&#x8005;&#xFF0C;&#x90A3;&#x4E48;&#x5047;&#x8BBE;&#x76D7;&#x7248;&#x53C8;&#x9519;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x90FD;&#x662F;&#x7F6A;&#x72AF;&#xFF0C;&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x4F1A;&#x5F15;&#x5165;&#x201C;&#x5EA6;&#x201D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x4EE5;&#x9ED1;&#x767D;&#x4E8C;&#x5143;&#x8BBA;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x672C;&#x8EAB;&#x6709;&#x7F6A;&#x4E4B;&#x4EBA;&#x5C31;&#x6839;&#x672C;&#x4E0D;&#x80FD;&#x8D77;&#x6765;&#x8BC4;&#x4EF7;&#x76D7;&#x7248;&#x4F7F;&#x7528;&#x8005;&#xFF0C;&#x76F4;&#x63A5;&#x5C31;&#x5B9A;&#x81EA;&#x5DF1;&#x7684;&#x7F6A;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5927;&#x5BB6;&#x660E;&#x660E;&#x53C8;&#x77E5;&#x9053;&#x76D7;&#x7248;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x6709;&#x76CA;&#x5904;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x77E5;&#x9053;&#x7ED9;&#x76D7;&#x7248;&#x4E00;&#x80A1;&#x8111;&#x5224;&#x6B7B;&#x5211;&#x5C31;&#x662F;&#x5728;&#x8BF4;&#x8C0E;&#x3002;&#x90A3;&#x5C31;&#x5F97;&#x627F;&#x8BA4;&#x73B0;&#x5B9E;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x628A;&#x6211;&#x4EEC;&#x63A8;&#x5230;&#x4E2D;&#x7ACB;&#x7684;&#x5730;&#x6B65;&#x4E0A;&#x3002;</p>
<p>&#x9000;&#x4E00;&#x6B65;&#x770B;&#xFF0C;&#x5728;&#x8FD9;&#x80CC;&#x540E;&#x8FD8;&#x6709;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<p>1.&#x4E3E;&#x7740;&#xFF3B;&#x8FD9;&#x662F;&#x81EA;&#x7531;&#x5F00;&#x653E;&#x8BA8;&#x8BBA;&#xFF3D;&#x7684;&#x610F;&#x8BC6;&#x5F62;&#x6001;&#x5927;&#x65D7;&#x5F7C;&#x6B64;&#x201C;&#x770B;&#x4F3C;&#x5BF9;&#x4E8B;&#x5B9E;&#x9645;&#x5BF9;&#x4EBA;&#x201D;&#x8BBA;&#x65AD;&#x662F;&#x5426;&#x5408;&#x7406;&#xFF1F;<br>2.&#x5355;&#x7EAF;&#x57FA;&#x4E8E;&#x4E16;&#x4FD7;&#x5584;&#x6076;&#x4EF7;&#x503C;&#xFF08;&#x4EBA;&#x7684;&#x76F4;&#x89C9;&#x3001;&#x591A;&#x6570;&#x4EBA;&#x5224;&#x65AD;&#x3001;&#x88AB;&#x5F15;&#x5BFC;&#x7684;&#x4E3B;&#x6D41;&#x89C2;&#x70B9;&#xFF09;&#x6765;&#x5206;&#x8FA8;&#x4E8B;&#x60C5;&#x662F;&#x5426;&#x5408;&#x7406;&#xFF1F;<br>3.&#x5982;&#x4E4B;&#x524D;&#x6587;&#x7AE0;&#x6240;&#x8BF4;&#xFF0C;&#x4E8B;&#x60C5;&#x7684;&#x5168;&#x8C8C;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x591A;&#x5C11;&#xFF0C;&#x6B63;&#x9762;&#x548C;&#x8D1F;&#x9762;&#x7684;&#x5F71;&#x54CD;&#x8303;&#x56F4;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x591A;&#x5C11;&#xFF1F;<br>4.&#x4F60;&#x660E;&#x77E5;&#x6CA1;&#x4EBA;&#x77E5;&#x9053;&#x4E00;&#x5207;&#x80CC;&#x540E;&#x7684;&#x771F;&#x7406;&#xFF0C;&#x90A3;&#x4F60;&#x8BA4;&#x4E3A;&#x7684;&#xFF3B;&#x6B63;&#x786E;&#xFF3D;&#x7684;&#x4EF7;&#x503C;&#x6765;&#x6E90;&#x4E8E;&#x54EA;&#xFF1F;<br>5.&#x4F60;&#x7684;&#x4E00;&#x5207;&#x8BC4;&#x8BBA;&#x53D1;&#x8A00;&#x7ACB;&#x6709;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x60F3;&#x8981;&#x8BC1;&#x660E;&#xFF3B;&#x6211;&#x6BD4;&#x4F60;&#x5BF9;&#xFF3D;&#x7684;&#x6B32;&#x671B;&#xFF1F;&#x81F4;&#x4F7F;&#x4F60;&#x53BB;&#x641C;&#x96C6;&#x5404;&#x79CD;&#x89C2;&#x70B9;&#x6750;&#x6599;&#xFF1F;&#x6216;&#x60F3;&#x5C3D;&#x529E;&#x6CD5;&#x8BF4;&#x670D;&#x5BF9;&#x65B9;&#xFF1F;</p>
<p>&#x51FA;&#x4E86;&#x4E8B;&#x4EBA;&#x90FD;&#x559C;&#x6B22;&#x8FFD;&#x7A76;&#x8D23;&#x4EFB;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x4E8B;&#x60C5;&#x4F60;&#x5C31;&#x662F;&#x6CA1;&#x6CD5;&#x627E;&#x5230;&#x6240;&#x8C13;&#x7684;&#x8D23;&#x4EFB;&#x5F52;&#x5C5E;&#xFF0C;&#x800C;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x53D1;&#x751F;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x4EBA;&#x548C;&#x4EBA;&#x5F7C;&#x6B64;&#x4EBA;&#x5403;&#x4EBA;&#xFF0C;&#x975E;&#x8981;&#x5206;&#x51FA;&#x4F60;&#x9519;&#x6211;&#x5BF9;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x611A;&#x8822;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x914D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x770B;&#x5230;&#x4E86;&#x4EBA;&#x7684;&#x4E00;&#x5207;&#x4E89;&#x8FA9;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x662F;&#x628A;&#x4EBA;&#x63A8;&#x5411;&#x4E00;&#x4E2A;&#x65E0;&#x89E3;&#x7684;&#x6DF1;&#x6E0A;&#x5F53;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x8BBA;&#x54EA;&#x8FB9;&#x6253;&#x8D25;&#x4E86;&#x54EA;&#x8FB9;&#xFF0C;<strong>&#x9B54;&#x9B3C;&#x90FD;&#x5FC5;&#x7136;&#x6700;&#x7EC8;&#x5F97;&#x80DC;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F7F;&#x4EBA;&#x9A84;&#x50B2;&#xFF0C;&#x4F7F;&#x4EBA;&#x9645;&#x5173;&#x7CFB;&#x8D25;&#x574F;&#xFF0C;&#x8BA9;&#x4EBA;&#x95F4;&#x6210;&#x4E3A;&#x4E86;&#x5730;&#x72F1;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4EBA;&#x5374;&#x4E0D;&#x81EA;&#x77E5;&#x3002;&#x90A3;&#x4E2A;&#x6316;&#x9677;&#x9631;&#x7684;&#x4EBA;&#x5B9E;&#x5728;&#x662F;&#x6709;&#x7978;&#x4E86;&#xFF01;</p>
<p>&#x5723;&#x7ECF;&#x8BF4;&#xFF1A;<strong>&#x6CA1;&#x6709;&#x4E49;&#x4EBA;&#xFF0C;&#x8FDE;&#x4E00;&#x4E2A;&#x4E5F;&#x6CA1;&#x6709;&#xFF0C;&#x6CA1;&#x6709;&#x660E;&#x767D;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x5BFB;&#x6C42;&#x795E;&#x7684;&#xFF1B;&#x4EBA;&#x4EBA;&#x90FD;&#x504F;&#x79BB;&#x4E86;&#x6B63;&#x9053;&#xFF0C;&#x4E00;&#x540C;&#x53D8;&#x6210;&#x6C61;&#x79FD;&#xFF1B;&#x6CA1;&#x6709;&#x884C;&#x5584;&#x7684;&#xFF0C;&#x8FDE;&#x4E00;&#x4E2A;&#x4E5F;&#x6CA1;&#x6709;&#x3002;</strong></p>
<p>&#x5723;&#x7ECF;&#x8BF4;&#xFF1A;<strong>&#x6211;&#x4EEC;&#x4E3A;&#x5B69;&#x7AE5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D7;&#x7BA1;&#x4E8E;&#x4E16;&#x4FD7;&#x5C0F;&#x5B66;&#x4E4B;&#x4E0B;&#x3002;</strong> &#x4E16;&#x4FD7;&#x5C0F;&#x5B66;&#x5C31;&#x662F;&#x5F8B;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x4EBA;&#x4EE5;&#x4E3A;&#x7684;&#x6B63;&#x786E;&#x7684;&#x90A3;&#x4E00;&#x5957;&#xFF0C;&#x5C31;&#x662F;&#x4EBA;&#x641E;&#x51FA;&#x6765;&#x7684;&#x79CD;&#x79CD;&#x6559;&#x6761;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x4EBA;&#x548C;&#x4EBA;&#x7684;&#x4E09;&#x89C2;&#x672C;&#x8EAB;&#x5C31;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x52A0;&#x4E0A;&#xFF3B;&#x6211;&#x8981;&#x8BC1;&#x660E;&#x6211;&#x6BD4;&#x4F60;&#x5BF9;&#xFF3D;&#x7684;&#x6B32;&#x671B;&#x8BF1;&#x60D1;&#xFF0C;&#x5F80;&#x5F80;&#x628A;&#x5BF9;&#x4E8B;&#x60C5;&#x7684;&#x8FA9;&#x8BBA;&#x8F6C;&#x5316;&#x4E3A;&#x5BF9;&#x4EBA;&#x7684;&#x5BA1;&#x5224;&#xFF0C;&#x54EA;&#x6015;&#x4F60;&#x5634;&#x4E0A;&#x4E0D;&#x8BF4;&#xFF0C;&#x5FC3;&#x91CC;&#x4E5F;&#x5FC5;&#x7136;&#x5728;&#x5BA1;&#x5224;&#x4EBA;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x80FD;&#x9003;&#x5F97;&#x51FA;&#x53BB;&#x3002;</p>
<h2 id="&#x601D;&#x7EF4;"><a href="#&#x601D;&#x7EF4;" class="headerlink" title="&#x601D;&#x7EF4;"></a>&#x601D;&#x7EF4;</h2><p>&#x592A;&#x6781;&#x7684;&#x9634;&#x9633;&#x9C7C;&#xFF0C;&#x662F;&#x4E2A;&#x4E8C;&#x7EF4;&#x7684;&#x751F;&#x7269;&#xFF0C;&#x4E24;&#x6761;&#x9C7C;&#x4E00;&#x9ED1;&#x4E00;&#x767D;&#xFF0C;&#x5404;&#x81EA;&#x5934;&#x90E8;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x989C;&#x8272;&#x7684;&#x70B9;&#x70B9;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x767D;&#x8272;&#x7684;&#x9C7C;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x53E6;&#x4E00;&#x6761;&#x9ED1;&#x8272;&#x7684;&#x9C7C;&#xFF0C;&#x5B83;&#x7684;&#x6D3B;&#x52A8;&#x8303;&#x56F4;&#x53D7;&#x9650;&#xFF0C;&#x4E8C;&#x8005;&#x53EA;&#x80FD;&#x5F7C;&#x6B64;&#x8FFD;&#x9010;&#x3002;&#x767D;&#x7684;&#x8D77;&#x6765;&#x5BA1;&#x5224;&#x9ED1;&#x7684;&#xFF0C;&#x628A;&#x9ED1;&#x7684;&#x67D3;&#x767D;&#x591A;&#x5C11;&#xFF0C;&#x5C31;&#x540C;&#x65F6;&#x88AB;&#x67D3;&#x9ED1;&#x591A;&#x5C11;&#x3002;</p>
<p>&#x5E76;&#x4E14;&#x767D;&#x9C7C;&#x770B;&#x4E0D;&#x89C1;&#x81EA;&#x5DF1;&#x91CC;&#x9762;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x9ED1;&#x7684;&#xFF0C;&#x800C;&#x9ED1;&#x9C7C;&#x867D;&#x7136;&#x81EA;&#x8BA4;&#x4E3A;&#x9ED1;&#xFF0C;&#x7136;&#x800C;&#x5B83;&#x91CC;&#x9762;&#x4E5F;&#x662F;&#x767D;&#x7684;&#x3002;&#x4E24;&#x4E2A;&#x4E8C;&#x7EF4;&#x7A7A;&#x95F4;&#x91CC;&#x7684;&#x9C7C;&#x5934;&#xFF0C;&#x90FD;&#x770B;&#x4E0D;&#x89C1;&#x5BF9;&#x65B9;&#x4F53;&#x5185;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#x3002;</p>
<p>&#x4E8C;&#x8005;&#x76F8;&#x4E92;&#x8FFD;&#x9010;&#x4E0D;&#x5206;&#x80DC;&#x8D1F;&#xFF0C;&#x4E24;&#x6761;&#x9C7C;&#x80FD;&#x4E0D;&#x80FD;&#x6405;&#x548C;&#x6210;&#x7070;&#x8272;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x7136;&#x800C;&#x4ECE;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x7684;&#x9AD8;&#x5904;&#x770B;&#x6765;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x591A;&#x4E48;&#x7684;&#x611A;&#x8822;&#x554A;&#xFF01;</p>
<p>&#x5728;&#x8FD9;&#x5957;&#x975E;&#x9ED1;&#x5373;&#x767D;&#x7684;&#x4E89;&#x8BBA;&#x5F53;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x53CC;&#x65B9;&#x90FD;&#x6536;&#x96C6;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x8BBA;&#x70B9;&#xFF0C;&#x663E;&#x7136;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#x5C31;&#x662F;<strong>&#x4E8C;&#x5143;&#x8BBA;&#x7684;&#x601D;&#x7EF4;&#x6846;&#x67B6;&#x5B58;&#x5728;&#x9519;&#x8BEF;</strong>&#x3002;</p>
<h2 id="&#x539F;&#x59D4;"><a href="#&#x539F;&#x59D4;" class="headerlink" title="&#x539F;&#x59D4;"></a>&#x539F;&#x59D4;</h2><p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x8981;&#x5F15;&#x7533;&#x4E00;&#x5219;&#x7535;&#x89C6;&#x8282;&#x76EE;&#xFF0C;&#x6765;&#x770B;&#x770B;&#x8FD9;&#x79CD;&#x6076;&#x6BD2;&#x7684;&#x601D;&#x7EF4;&#x662F;&#x600E;&#x4E48;&#x6E10;&#x6E10;&#x4FB5;&#x8680;&#x6211;&#x4EEC;&#x7684;&#xFF01;</p>
<p>&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x5219;&#x65B0;&#x95FB;&#x62A5;&#x9053;&#x8BF4;&#xFF1A;&#x201C;xx&#x6708;xx&#x65E5;&#x5728;xxx&#x5730;&#xFF0C;&#x4E00;&#x540D;&#x7537;&#x5B50;&#x9152;&#x540E;&#x5F00;&#x8C6A;&#x8F66;&#x73A9;&#x6F02;&#x79FB;&#xFF0C;&#x649E;&#x4F24;xxx&#x2026;&#xFF0C;&#x8B66;&#x5BDF;&#x5DF2;&#x7ECF;&#x63A7;&#x5236;&#x6B64;&#x4EBA;&#xFF0C;&#x5728;&#x8FDB;&#x4E00;&#x6B65;&#x5BA1;&#x7406;&#x4E2D;&#x201D;</p>
<p>&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x89C2;&#x5BDF;&#x8FC7;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x5219;&#x62A5;&#x5BFC;&#x5C31;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x5C31;&#x4E8B;&#x8BBA;&#x4E8B;&#xFF0C;&#x4F46;&#x662F;&#x7535;&#x89C6;&#x4E3B;&#x6301;&#x4EBA;&#x5BF9;&#x62A5;&#x5BFC;&#x8FD8;&#x6CA1;&#x5B8C;&#xFF0C;&#x8BF4;&#xFF1A;</p>
<p>1.&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x6F02;&#x79FB;&#x662F;&#x5934;&#x6587;&#x5B57;D&#x91CC;&#x7684;&#x2026;<br>2.&#x73B0;&#x5728;&#x5E74;&#x8F7B;&#x4EBA;&#x5F00;&#x8C6A;&#x8F66;&#x8FC7;&#x7740;&#x4EFF;&#x4F5B;&#x4EBA;&#x751F;&#x8D62;&#x5BB6;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5374;&#x2026;</p>
<p>&#x6709;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#xFF0C;&#x5B57;&#x91CC;&#x884C;&#x95F4;&#x90FD;&#x900F;&#x9732;&#x7740;&#x5BF9;&#x52A8;&#x6F2B;&#x6216;&#x67D0;&#x4E9B;&#x4EBA;&#x7684;&#x9053;&#x5FB7;&#x5BA1;&#x5224;&#xFF0C;&#x524D;&#x8005;&#x662F;&#x8BF1;&#x5BFC;&#x89C2;&#x4F17;&#x5F52;&#x56E0;&#xFF0C;&#x540E;&#x8005;&#x52A0;&#x4E0A;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x81C6;&#x6D4B;&#xFF0C;&#x662F;&#x591A;&#x4E48;&#x53EF;&#x6015;&#x7684;&#x4E00;&#x79CD;&#x4EBA;&#x5403;&#x4EBA;&#xFF01;</p>
<p>&#x66F4;&#x53EF;&#x6015;&#x7684;&#x662F;&#xFF0C;&#x7535;&#x89C6;&#x91CC;&#x5929;&#x5929;&#x8FD9;&#x6837;&#x8BB2;&#xFF0C;&#x64AD;&#x97F3;&#x5458;&#x8BF4;&#x4E60;&#x60EF;&#x4E86;&#x4ED6;&#x81EA;&#x5DF1;&#x90FD;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#xFF0C;&#x5927;&#x5BB6;&#x542C;&#x7740;&#x6709;&#x9053;&#x7406;&#xFF0C;&#x5C31;&#x90FD;&#x5BB9;&#x6613;&#x8FD9;&#x6837;&#x60F3;&#xFF0C;&#x90FD;&#x5F00;&#x59CB;&#x4EBA;&#x5403;&#x4EBA;&#xFF0C;&#x4E5F;&#x81EA;&#x5DF1;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x3002;&#x4F60;&#x53EF;&#x77E5;&#x9053;&#x8FD9;&#x5C31;&#x662F;&#x9B54;&#x9B3C;&#x62FF;&#x7740;&#x534A;&#x672C;&#x5723;&#x7ECF;&#x62FF;&#x51FA;&#x90E8;&#x5206;&#x771F;&#x7406;&#x5F00;&#x59CB;&#x5751;&#x5BB3;&#x4F60;&#x4E86;&#x5417;&#xFF1F;&#x5B83;&#x6210;&#x529F;&#x4E86;&#xFF01;&#x5B83;&#x770B;&#x7740;&#x4EBA;&#x548C;&#x4EBA;&#x6495;&#x903C;&#xFF0C;&#x5B83;&#x5F88;&#x9AD8;&#x5174;&#xFF01;</p>
<p>&#x4F46;&#x4F60;&#x660E;&#x660E;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5386;&#x53F2;&#x6559;&#x79D1;&#x4E66;&#xFF0C;&#x90FD;&#x4F1A;&#x5E26;&#x4E0A;&#x4E00;&#x79CD;&#x7AD9;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x5229;&#x76CA;&#x96C6;&#x56E2;&#x89D2;&#x5EA6;&#x4E0A;&#x7684;&#x611F;&#x60C5;&#x6E32;&#x67D3;&#x8272;&#x5F69;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x5BA3;&#x626C;&#x6C11;&#x65CF;&#x4E3B;&#x4E49;&#x60C5;&#x611F;&#x8272;&#x5F69;&#xFF0C;&#x800C;&#x5E76;&#x4E0D;&#x662F;&#x516C;&#x6B63;&#x53C8;&#x67AF;&#x71E5;&#x7684;&#x7F16;&#x5E74;&#x53F2;&#xFF01;&#x4F60;&#x600E;&#x4E48;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#x5462;&#xFF1F;&#x9B54;&#x9B3C;&#x518D;&#x6B21;&#x5F97;&#x80DC;&#x4E86;&#xFF01;</p>
<p>&#x800C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x518D;&#x5E73;&#x5E38;&#x4E0D;&#x8FC7;&#x7684;&#x804A;&#x5929;&#x554A;&#xFF01;&#x770B;&#x5230;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x4F60;&#x6307;&#x8D23;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E5F;&#x662F;&#x90A3;&#x4EBA;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x4F60;&#x6CA1;&#x505A;&#x6240;&#x4E3A;&#x9519;&#x4E8B;&#x7684;&#x673A;&#x4F1A;&#x800C;&#x5DF2;&#xFF0C;&#x4F60;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x902E;&#x7740;&#x673A;&#x4F1A;&#x80FD;&#x6765;&#x6EE1;&#x8DB3;&#x4E00;&#x4E0B;&#x4F60;&#x90A3;&#xFF3B;&#x6211;&#x60F3;&#x88AB;&#x522B;&#x4EBA;&#x8BF4;&#x597D;&#xFF3D;&#x7684;&#x60C5;&#x611F;&#x4E86;&#xFF0C;&#x4F60;&#x5C31;&#x7B97;&#x8BF4;&#x4E8B;&#x60C5;&#x5E76;&#x4E0D;&#x662F;&#x975E;&#x9ED1;&#x5373;&#x767D;&#x4E5F;&#x65E0;&#x975E;&#x662F;&#x60F3;&#x4E24;&#x8FB9;&#x8BA8;&#x597D;&#xFF0C;&#x4F60;&#x7684;&#x826F;&#x5FC3;&#x90FD;&#x662F;&#x5047;&#x7684;&#xFF0C;&#x4F60;&#x8BF4;&#x7684;&#x6240;&#x8C13;&#x6B63;&#x4E49;&#x7684;&#x8A00;&#x8F9E;&#x4E5F;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x4F60;&#x81EA;&#x5DF1;&#x5728;&#x522B;&#x4EBA;&#x770B;&#x6765;&#x4F3C;&#x4E4E;&#x662F;&#x6B63;&#x4E49;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x5F97;&#x522B;&#x4EBA;&#x8D5E;&#x7F8E;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x8BDA;&#x6073;&#x7684;&#x6001;&#x5EA6;&#x662F;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x4EBA;&#x5F53;&#x4E2D;&#xFF0C;&#x6211;&#x505A;&#x7684;&#x6BD4;&#x8C01;&#x90FD;&#x5DEE;&#x3002;</p>
<p>&#x5723;&#x7ECF;&#x8BF4;&#xFF1A;<strong>&#x4F60;&#x4EEC;&#x600E;&#x6837;&#x8BBA;&#x65AD;&#x4EBA;&#xFF0C;&#x4E5F;&#x5FC5;&#x600E;&#x6837;&#x88AB;&#x8BBA;&#x65AD;&#x3002;</strong> &#x4EBA;&#x9690;&#x853D;&#x7684;&#x5FC3;&#x601D;&#x610F;&#x5FF5;&#xFF0C;&#x5728;&#x795E;&#x9762;&#x524D;&#x90FD;&#x662F;&#x655E;&#x5F00;&#x7684;&#x3002;</p>
<p>&#x5723;&#x7ECF;&#x8BF4;&#xFF1A;<strong>&#x4F60;&#x4EEC;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5F7C;&#x6B64;&#x8FA9;&#x8BBA;&#x3002;&#x4F60;&#x4EEC;&#x7684;&#x7F6A;&#x867D;&#x50CF;&#x6731;&#x7EA2;&#xFF0C;&#x5FC5;&#x53D8;&#x6210;&#x96EA;&#x767D;&#xFF1B;&#x867D;&#x7EA2;&#x5982;&#x4E39;&#x989C;&#xFF0C;&#x5FC5;&#x767D;&#x5982;&#x7F8A;&#x6BDB;&#x3002;</strong> &#x6731;&#x7EA2;&#x5C31;&#x662F;&#x67D3;&#x6210;&#x534E;&#x4E3D;&#x7684;&#x7EA2;&#x8272;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x88C5;&#x626E;&#x5F97;&#x5F88;&#x4E49;&#x4E00;&#x6837;&#xFF0C;&#x767D;&#x5982;&#x7F8A;&#x6BDB;&#x5C31;&#x662F;&#x6F0F;&#x51FA;&#x4E86;&#x4F60;&#x7684;&#x5927;&#x9EBB;&#x98CE;&#x75C5;&#xFF0C;&#x4F60;&#x8FA9;&#x8BBA;&#x4E5F;&#x6CA1;&#x7528;&#xFF0C;&#x4F60;&#x4EE5;&#x4E3A;&#x7A7F;&#x4E0A;&#x9A6C;&#x7532;&#xFF0C;&#x4E0A;&#x5E1D;&#x5C31;&#x770B;&#x4E0D;&#x900F;&#x4F60;&#x4E86;&#x5417;&#xFF1F;</p>
<h2 id="&#x89E3;&#x51B3;"><a href="#&#x89E3;&#x51B3;" class="headerlink" title="&#x89E3;&#x51B3;"></a>&#x89E3;&#x51B3;</h2><p>&#x95EE;&#x9898;&#x672C;&#x8EAB;&#x662F;&#x4E0D;&#x53EF;&#x89E3;&#x7684;&#xFF0C;&#x6838;&#x5FC3;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x95EE;&#x9898;&#x7684;&#x80CC;&#x540E;&#x662F;&#x9B54;&#x9B3C;&#x8BA9;&#x6211;&#x4EEC;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x660E;&#x660E;&#x65E0;&#x77E5;&#xFF0C;&#x8FD8;&#x81EA;&#x4EE5;&#x4E3A;&#x4E49;&#x626E;&#x6F14;&#x4E0A;&#x5E1D;&#x6765;&#x63A7;&#x544A;&#x522B;&#x7684;&#x4EBA;&#x3002;&#x4EBA;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x80CC;&#x540E;&#x7684;&#x5C5E;&#x7075;&#x4E89;&#x6218;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x795E;&#x7684;&#x601C;&#x60AF;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x652F;&#x6301;&#x8FD8;&#x662F;&#x4E0D;&#x652F;&#x6301;&#x76D7;&#x7248;&#xFF0C;&#x6211;&#x4EEC;&#x61C2;&#x4EC0;&#x4E48;&#xFF0C;&#x8D77;&#x6765;&#x6495;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x672C;&#x8EAB;&#x96BE;&#x5B9A;&#x9ED1;&#x767D;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x8981;&#x628A;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x8FD9;&#x4E0A;&#xFF0C;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x88AB;&#x4E16;&#x4FD7;&#x5C0F;&#x5B66;&#x6346;&#x7ED1;&#x7684;&#x5B69;&#x5B50;&#xFF1F;&#x800C;&#x5B66;&#x4E0D;&#x4F1A;&#x5F7C;&#x6B64;&#x5BBD;&#x5BB9;&#x5C0A;&#x91CD;&#xFF1F;</p>
<p>&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x8D77;&#x6765;&#x968F;&#x4FBF;&#x62FF;&#x51FA;&#x70B9;&#x5C0F;&#x9ED1;&#x8D26;&#x6307;&#x63A7;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E00;&#x5B9A;&#x80FD;&#x628A;&#x4EBA;&#x6253;&#x5165;&#x5730;&#x72F1;&#xFF0C;&#x4EBA;&#x5C31;&#x6CA1;&#x6709;&#x51FA;&#x8DEF;&#x4E86;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x8981;&#x56FA;&#x6267;&#x575A;&#x6301;&#x4E00;&#x5957;&#x5E7C;&#x7A1A;&#x5230;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x662F;&#x7684;&#x5584;&#x6076;&#x6807;&#x51C6;&#x8D77;&#x6765;&#x4E0E;&#x4EBA;&#x4E89;&#x6218;&#xFF1F;&#x628A;&#x4E16;&#x754C;&#x6405;&#x548C;&#x5F97;&#x9E21;&#x72AC;&#x4E0D;&#x5B81;&#x800C;&#x540E;&#x5FEB;&#xFF1F;&#x4EBA;&#x80FD;&#x50CF;&#x795E;&#x4E00;&#x6837;&#x5206;&#x8FA9;&#x5584;&#x6076;&#x662F;&#x4E00;&#x5207;&#x8D25;&#x574F;&#x7684;&#x8D77;&#x5934;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x53E3;&#x820C;&#x4E4B;&#x5FEB;&#x7ED3;&#x679C;&#x4E00;&#x5B9A;&#x662F;&#xFF3B;&#x6211;&#x5584;&#x4F60;&#x6076;&#xFF3D;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x9003;&#x4E0D;&#x6389;&#x8FD9;&#x4E2A;&#x6346;&#x9501;&#xFF0C;&#x6240;&#x4EE5;&#x5206;&#x8FA8;&#x5584;&#x6076;&#x4E00;&#x5B9A;&#x8981;&#x65F6;&#x523B;&#x8B66;&#x60D5;&#x3001;&#x8981;&#x6709;&#x8282;&#x5236;&#xFF01;</p>
<p>&#x5728;&#x8BBA;&#x65AD;&#x7684;&#x4E8B;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8BA4;&#x7F6A;&#x6094;&#x6539;&#xFF0C;&#x5728;&#x77E5;&#x8BC6;&#x4E0A;&#x8981;&#x4E0D;&#x65AD;&#x6709;&#x6240;&#x66F4;&#x65B0;&#xFF0C;&#x9762;&#x5BF9;&#x4E16;&#x4FD7;&#x95EE;&#x9898;&#x7684;&#x9677;&#x9631;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x8DF3;&#x51FA;&#x95EE;&#x9898;&#x672C;&#x8EAB;&#xFF0C;&#x7AD9;&#x5728;&#x4E0A;&#x5E1D;&#x89C6;&#x89D2;&#x6765;&#x770B;&#x4E8B;&#x60C5;&#x3001;&#x770B;&#x4EBA;&#x7FA4;&#x3001;&#x5173;&#x952E;&#x8FD8;&#x8981;&#x770B;&#x81EA;&#x5DF1;&#xFF01;</p>
<p>&#x5723;&#x7ECF;&#x8BF4;&#xFF1A;<strong>&#x7978;&#x54C9;&#x3001;&#x6211;&#x706D;&#x4EA1;&#x4E86;; &#x56E0;&#x4E3A;&#x6211;&#x662F;&#x5634;&#x5507;&#x4E0D;&#x6D01;&#x7684;&#x4EBA;&#x3001;&#x53C8;&#x4F4F;&#x5728;&#x5634;&#x5507;&#x4E0D;&#x6D01;&#x7684;&#x6C11;&#x4E2D;&#x3002;</strong></p>
<h2 id="&#x7ED3;&#x8BED;"><a href="#&#x7ED3;&#x8BED;" class="headerlink" title="&#x7ED3;&#x8BED;"></a>&#x7ED3;&#x8BED;</h2><p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4EE3;&#x8868;&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;&#xFF0C;&#x559C;&#x6B22;&#x4E89;&#x8FA9;&#x7684;&#x4EBA;&#x53EF;&#x4EE5;&#x626A;&#x5FC3;&#x81EA;&#x95EE;&#x81EA;&#x5DF1;&#x5206;&#x8FA8;&#xFF0C;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x9519;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x7070;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x6211;&#x7684;&#x8BDD;&#x662F;&#x8BDA;&#x5B9E;&#x7684;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/机器学习/迁移学习/" rel="next" title="迁移学习">
                <i class="fa fa-chevron-left"></i> 迁移学习
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/icon.jpeg"
               alt="アカリ" />
          <p class="site-author-name" itemprop="name">アカリ</p>
          <p class="site-description motion-element" itemprop="description">很羡慕工作后辞职读研的人，能腾出一两年的大片时间来专心学习某个自己喜欢的领域的知识技能其实是一件非常幸福的事……</p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/">
                <span class="site-state-item-count">23</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#问题"><span class="nav-number">1.</span> <span class="nav-text">问题</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#退后"><span class="nav-number">2.</span> <span class="nav-text">退后</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#思维"><span class="nav-number">3.</span> <span class="nav-text">思维</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#原委"><span class="nav-number">4.</span> <span class="nav-text">原委</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#解决"><span class="nav-number">5.</span> <span class="nav-text">解决</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#结语"><span class="nav-number">6.</span> <span class="nav-text">结语</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">アカリ</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	





  




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=default"></script>
  


  

  

  


</body>
</html>
