<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="在一个问题场景和另一个问题场景当中，当一个人有足够的领悟之后，会发现有很多东西都是相通的，而对于机器来说，重新去训练模型会很麻烦，如何借用老模型在新的问题上做优化是一个值得探讨的问题。迁移学习是一种复用之前已经训练好的神经网络，进而用在特定任务上的一种手段，避免了从头开始构造和训练复杂的网络。">
<meta property="og:type" content="article">
<meta property="og:title" content="迁移学习">
<meta property="og:url" content="http://yoursite.com/机器学习/迁移学习/index.html">
<meta property="og:site_name" content="アカリの部屋">
<meta property="og:description" content="在一个问题场景和另一个问题场景当中，当一个人有足够的领悟之后，会发现有很多东西都是相通的，而对于机器来说，重新去训练模型会很麻烦，如何借用老模型在新的问题上做优化是一个值得探讨的问题。迁移学习是一种复用之前已经训练好的神经网络，进而用在特定任务上的一种手段，避免了从头开始构造和训练复杂的网络。">
<meta property="og:image" content="http://yoursite.com/机器学习/迁移学习/保守训练.png">
<meta property="og:image" content="http://yoursite.com/机器学习/迁移学习/层迁移.png">
<meta property="og:image" content="http://yoursite.com/机器学习/迁移学习/Multitask Learning.png">
<meta property="og:image" content="http://yoursite.com/机器学习/迁移学习/渐进式神经网络.png">
<meta property="og:image" content="http://yoursite.com/机器学习/迁移学习/域对抗.png">
<meta property="og:updated_time" content="2018-04-02T09:13:10.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="迁移学习">
<meta name="twitter:description" content="在一个问题场景和另一个问题场景当中，当一个人有足够的领悟之后，会发现有很多东西都是相通的，而对于机器来说，重新去训练模型会很麻烦，如何借用老模型在新的问题上做优化是一个值得探讨的问题。迁移学习是一种复用之前已经训练好的神经网络，进而用在特定任务上的一种手段，避免了从头开始构造和训练复杂的网络。">
<meta name="twitter:image" content="http://yoursite.com/机器学习/迁移学习/保守训练.png">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/机器学习/迁移学习/"/>





  <title> 迁移学习 | アカリの部屋 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">アカリの部屋</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <p class="site-subtitle"></p>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-links">
          <a href="/links" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-question-circle"></i> <br />
            
            友链
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/机器学习/迁移学习/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="アカリ">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/icon.jpeg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="アカリの部屋">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="アカリの部屋" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                迁移学习
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2018-04-02T21:00:00+08:00">
                2018-04-02
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/机器学习/" itemprop="url" rel="index">
                    <span itemprop="name">机器学习</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          
              <div class="post-description">
                  在一个问题场景和另一个问题场景当中，当一个人有足够的领悟之后，会发现有很多东西都是相通的，而对于机器来说，重新去训练模型会很麻烦，如何借用老模型在新的问题上做优化是一个值得探讨的问题。迁移学习是一种复用之前已经训练好的神经网络，进而用在特定任务上的一种手段，避免了从头开始构造和训练复杂的网络。
              </div>
          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5982;&#x679C;&#x60F3;&#x4F7F;&#x7528;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#xFF0C;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x8981;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x6BD4;&#x5982;&#x7528;&#x7167;&#x76F8;&#x673A;&#x62CD;&#x4E0B;&#x6765;&#x7684;&#x732B;&#x72D7;&#x7167;&#x7247;&#x505A;&#x5206;&#x7C7B;&#xFF0C;&#x53EF;&#x4EE5;&#x8FC1;&#x79FB;&#x5230;&#x8001;&#x9E70;&#x548C;&#x5E03;&#x8C37;&#x9E1F;&#x7684;&#x5206;&#x7C7B;&#xFF08;&#x76F8;&#x901A;Domain&#x4E0D;&#x540C;&#x4EFB;&#x52A1;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FC1;&#x79FB;&#x5230;&#x5361;&#x901A;&#x9AD8;&#x98DE;&#x72D7;&#x548C;&#x62DB;&#x8D22;&#x732B;&#xFF08;&#x4E0D;&#x540C;Domain&#x76F8;&#x540C;&#x4EFB;&#x52A1;&#xFF09;&#x4E0A;&#x3002;</p>
<h2 id="Fine-tune"><a href="#Fine-tune" class="headerlink" title="Fine-tune"></a>Fine-tune</h2><p>&#x5728;&#x5DE5;&#x4E1A;&#x754C;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x5360;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;&#x7684;&#x4E3B;&#x4F53;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x9014;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x662F;&#x6709;&#x76D1;&#x7763;&#x6A21;&#x578B;&#x5230;&#x65B0;&#x7684;&#x6709;&#x76D1;&#x7763;&#x6A21;&#x578B;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5FAE;&#x8C03;&#x518D;&#x4F18;&#x5316;&#xFF08;Fine-tune&#xFF09;&#x3002;</p>
<p>&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#x5F53;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x8BA4;&#x4E3A;&#x7279;&#x5F81;&#x662F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x62BD;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x9762;&#x4E34;&#x7684;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6570;&#x636E;&#x7684;&#x6570;&#x91CF;&#x548C;&#x8D28;&#x91CF;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x5F88;&#x591A;&#x9886;&#x57DF;&#x6570;&#x636E;&#x662F;&#x5F88;&#x96BE;&#x83B7;&#x53D6;&#x7684;&#xFF08;&#x6BD4;&#x5982;&#x533B;&#x7597;&#x5F71;&#x50CF;&#xFF09;&#x3002;Fine-tune&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x62FF;ImageNet&#x8FD9;&#x6837;&#x5927;&#x578B;&#x6570;&#x636E;&#x96C6;&#x751F;&#x6210;&#x7684;&#x6A21;&#x578B;&#x505A;&#x6743;&#x91CD;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x518D;&#x4E00;&#x4E2A;&#x5C11;&#x91CF;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x518D;&#x4F18;&#x5316;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x6A21;&#x578B;&#x5BB9;&#x91CF;&#x592A;&#x5927;&#xFF0C;&#x968F;&#x4FBF;&#x52A8;&#x52A8;&#x5C31;&#x80FD;&#x628A;&#x5C0F;&#x6570;&#x636E;&#x90FD;&#x80CC;&#x4E0B;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x8FC7;&#x62DF;&#x5408;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x964D;&#x4F4E;&#x5B66;&#x4E60;&#x7387;&#x662F;&#x6CA1;&#x7528;&#x7684;&#xFF0C;&#x5B66;&#x4E60;&#x7387;&#x53EA;&#x5F71;&#x54CD;&#x901F;&#x5EA6;&#xFF0C;&#x8F6E;&#x6B21;&#x591A;&#x7167;&#x6837;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<h2 id="&#x4FDD;&#x5B88;&#x8BAD;&#x7EC3;&#xFF08;Conservative-Training&#xFF09;"><a href="#&#x4FDD;&#x5B88;&#x8BAD;&#x7EC3;&#xFF08;Conservative-Training&#xFF09;" class="headerlink" title="&#x4FDD;&#x5B88;&#x8BAD;&#x7EC3;&#xFF08;Conservative Training&#xFF09;"></a>&#x4FDD;&#x5B88;&#x8BAD;&#x7EC3;&#xFF08;Conservative Training&#xFF09;</h2><p>&#x5728;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x4E2D;&#x6709;&#x4FDD;&#x5B88;&#x8BAD;&#x7EC3;&#xFF08;Conservative Training&#xFF09;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6709;&#x4E24;&#x4E2A;&#x601D;&#x8DEF;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x662F;&#x7EA6;&#x675F;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x5F88;&#x63A5;&#x8FD1;&#xFF0C;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x6B63;&#x5219;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x6709;Dropout&#x548C;L1/L2&#xFF0C;&#x501F;&#x7528;L1/L2&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x5373;&#x5047;&#x8BBE;&#x4E4B;&#x524D;&#x7684;&#x6A21;&#x578B;&#x662F;&#x4E00;&#x4E2A;&#x8303;&#x5316;&#x80FD;&#x529B;&#x5F88;&#x597D;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5728;&#x65B0;&#x7684;&#x5C0F;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x4E0D;&#x635F;&#x5931;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#xFF0C;&#x9700;&#x8981;&#x52A0;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x5316;&#x9650;&#x5236;&#xFF0C;&#x4FDD;&#x8BC1;&#x65B0;&#x7684;&#x53C2;&#x6570;&#x548C;&#x539F;&#x6765;&#x63A5;&#x8FD1;&#xFF0C;&#x53D8;&#x52A8;&#x5E45;&#x5EA6;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#x3002;&#x505A;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x539F;&#x59CB;&#x7684;&#x7F51;&#x7EDC;&#x5B9E;&#x9645;&#x5C31;&#x662F;&#x4E00;&#x5806;&#x6743;&#x91CD;w&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x5C3E;&#x5DF4;&#x4E0A;&#x628A;&#x5404;&#x7EF4;&#x5EA6;&#x5DEE;&#x503C;&#xFF08;&#x6BD4;&#x5982;2&#x8303;&#x6570;&#xFF09;&#x52A0;&#x4E0A;&#xFF0C;&#x5F53;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x635F;&#x5931;&#x9879;&#xFF0C;&#x518D;&#x8BAD;&#x7EC3;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x662F;&#x7EA6;&#x675F;&#x8F93;&#x51FA;&#x5411;&#x91CF;&#x5F88;&#x63A5;&#x8FD1;&#xFF0C;&#x65B0;&#x7684;&#x6570;&#x636E;&#x96C6;&#x7ECF;&#x8FC7;&#x8001;&#x7684;&#x548C;&#x4F18;&#x5316;&#x540E;&#x7684;&#x7F51;&#x7EDC;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x8F93;&#x51FA;&#x6982;&#x7387;&#x5411;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x8981;&#x5B9A;&#x4E49;&#x597D;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#x7684;&#x5DEE;&#x8DDD;&#x7B97;&#x6CD5;&#xFF0C;&#x52A0;&#x5230;lost&#x4E0A;&#x9762;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x8FD9;&#x4E24;&#x79CD;&#x7684;&#x65B9;&#x5F0F;&#x672C;&#x8D28;&#x4E0A;&#x90FD;&#x662F;&#x8981;&#x4FDD;&#x8BC1;&#x65B0;&#x7684;&#x6A21;&#x578B;&#x79BB;&#x8001;&#x7684;&#x6A21;&#x578B;&#x4E0D;&#x8981;&#x592A;&#x8FDC;&#x3002;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x8FC1;&#x79FB;&#x5B66;&#x4E60;/&#x4FDD;&#x5B88;&#x8BAD;&#x7EC3;.png" alt="logo"></p>
<h2 id="&#x5C42;&#x8FC1;&#x79FB;&#xFF08;Layer-Transfer&#xFF09;"><a href="#&#x5C42;&#x8FC1;&#x79FB;&#xFF08;Layer-Transfer&#xFF09;" class="headerlink" title="&#x5C42;&#x8FC1;&#x79FB;&#xFF08;Layer Transfer&#xFF09;"></a>&#x5C42;&#x8FC1;&#x79FB;&#xFF08;Layer Transfer&#xFF09;</h2><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x597D;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x6240;&#x6709;&#x53C2;&#x6570;&#x90FD;&#x76F4;&#x63A5;Copy&#x5230;&#x65B0;&#x7684;&#x6A21;&#x578B;&#x4E0A;&#xFF0C;&#x5728;&#x8FD9;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x628A;&#x4E4B;&#x524D;&#x4E00;&#x4E9B;&#x5C42;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x8C03;&#x6210;0&#xFF08;&#x6216;&#x8005;&#x5F88;&#x5C0F;&#x7684;&#x503C;&#x6BD4;&#x5982;0.00001&#xFF09;&#xFF0C;&#x53EA;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x5C42;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x7684;&#x53C2;&#x6570;&#x5C31;&#x5C11;&#x4E86;&#xFF0C;&#x65B0;&#x5C42;&#x5C31;&#x4E0D;&#x80FD;&#x65E0;&#x6CD5;&#x65E0;&#x5929;&#x5730;&#x53BB;&#x53D8;&#x52A8;&#xFF0C;&#x8FD8;&#x53D7;&#x5230;&#x5176;&#x4ED6;&#x5C42;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x7ED9;&#x65B0;&#x7684;&#x6A21;&#x578B;&#x592A;&#x5927;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#xFF0C;&#x901A;&#x5E38;&#x590D;&#x7528;&#x5F00;&#x59CB;&#x7684;&#x4E00;&#x4E9B;&#x5C42;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6982;&#x62EC;&#x7684;&#x662F;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x7279;&#x5F81;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E0D;&#x504F;&#x91CD;&#x5F88;&#x4E0A;&#x5C42;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x800C;&#x53EF;&#x4EE5;&#x4E0D;&#x8981;&#x6700;&#x540E;&#x7684;&#x9AD8;&#x5C42;&#x7279;&#x6027;&#x548C;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x800C;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x5219;&#x590D;&#x7528;&#x540E;&#x9762;&#x7684;&#x5C42;&#xFF0C;&#x56E0;&#x4E3A;&#x524D;&#x9762;&#x7684;&#x5C42;&#x504F;&#x91CD;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x53D1;&#x58F0;&#x65B9;&#x5F0F;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x5C42;&#x504F;&#x91CD;&#x4E8E;&#x8BED;&#x4E49;&#x3002;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x8FC1;&#x79FB;&#x5B66;&#x4E60;/&#x5C42;&#x8FC1;&#x79FB;.png" alt="logo"></p>
<h2 id="Multitask-Learning"><a href="#Multitask-Learning" class="headerlink" title="Multitask Learning"></a>Multitask Learning</h2><p>Fine-tune&#x5728;&#x610F;&#x7684;&#x662F;&#x5728;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#x4E0A;&#x8868;&#x73B0;&#x4E0D;&#x9519;&#xFF0C;&#x5373;&#x62FF;&#x6765;A&#x4EFB;&#x52A1;&#x7684;&#x6A21;&#x578B;&#x53BB;&#x6539;&#x9020;&#xFF0C;&#x66F4;&#x5173;&#x6CE8;&#x5728;B&#x4E0A;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x800C;&#x4E0D;&#x5173;&#x6CE8;&#x5728;A&#x4E0A;&#x7684;&#x8868;&#x73B0;&#xFF0C;Multitask Learning&#x5219;&#x5E0C;&#x671B;&#x4FDD;&#x8BC1;&#x62BD;&#x51FA;&#x6765;&#x6539;&#x9020;&#x540E;&#x7684;&#x90E8;&#x5206;&#x5728;&#x4E24;&#x4E2A;&#x4EFB;&#x52A1;&#x4E0A;&#x90FD;&#x8868;&#x73B0;&#x4E0D;&#x9519;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x9886;&#x57DF;&#xFF0C;&#x5F53;&#x4ECE;&#x7167;&#x7247;&#x5206;&#x7C7B;&#x8FC1;&#x79FB;&#x5230;&#x5361;&#x901A;&#x5206;&#x7C7B;&#x65F6;&#xFF0C;&#x503E;&#x5411;&#x4E8E;&#x516C;&#x7528;&#x4E2D;&#x95F4;&#x7684;&#x4E00;&#x4E9B;&#x5C42;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x62BD;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x662F;&#x53EF;&#x80FD;&#x5171;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E1A;&#x754C;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x786E;&#x8BA4;&#x54EA;&#x4E9B;&#x5C42;&#x662F;&#x53EF;&#x4EE5;&#x5171;&#x7528;&#x7684;&#x3002;</p>
<p>&#x5B83;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x5E94;&#x7528;&#x662F;&#x5728;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x4E0A;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x524D;&#x9762;&#x4E00;&#x4E9B;&#x5C42;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E9B;&#x5171;&#x540C;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x4EBA;&#x7684;&#x53D1;&#x58F0;&#x5171;&#x6027;&#xFF0C;&#x800C;&#x540E;&#x9762;&#x7684;&#x5C42;&#x5219;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x5404;&#x4E2A;&#x8BED;&#x79CD;&#x7684;&#x8BC6;&#x522B;&#x4EFB;&#x52A1;&#x4E0A;&#x3002;&#xFF08;&#x5373;&#x4FBF;&#x5728;&#x6C49;&#x8BED;&#x8BED;&#x97F3;&#x6570;&#x636E;&#x5F88;&#x5C11;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x80FD;&#x8FBE;&#x5230;&#x4E0D;&#x9519;&#x7684;&#x6548;&#x679C;&#xFF09;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x8FC1;&#x79FB;&#x5B66;&#x4E60;/Multitask Learning.png" alt="logo"></p>
<h2 id="&#x6E10;&#x8FDB;&#x5F0F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;"><a href="#&#x6E10;&#x8FDB;&#x5F0F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;" class="headerlink" title="&#x6E10;&#x8FDB;&#x5F0F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;"></a>&#x6E10;&#x8FDB;&#x5F0F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h2><p>&#x9996;&#x5148;&#x5BF9;&#x4EFB;&#x52A1;1&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5B58;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x4EFB;&#x52A1;1&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x67D0;&#x4E9B;&#x6743;&#x91CD;&#x63A5;&#x5165;&#x5230;&#x4EFB;&#x52A1;2&#x7F51;&#x7EDC;&#x7684;&#x6BCF;&#x4E00;&#x5C42;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x4EFB;&#x52A1;1&#x7684;&#x4E00;&#x4E9B;&#x7ED3;&#x8BBA;&#x8865;&#x5145;&#x5230;&#x4EFB;&#x52A1;2&#x4E2D;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6743;&#x91CD;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x3002;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x8FC1;&#x79FB;&#x5B66;&#x4E60;/&#x6E10;&#x8FDB;&#x5F0F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;.png" alt="logo"></p>
<h2 id="&#x57DF;&#x5BF9;&#x6297;&#x8BAD;&#x7EC3;"><a href="#&#x57DF;&#x5BF9;&#x6297;&#x8BAD;&#x7EC3;" class="headerlink" title="&#x57DF;&#x5BF9;&#x6297;&#x8BAD;&#x7EC3;"></a>&#x57DF;&#x5BF9;&#x6297;&#x8BAD;&#x7EC3;</h2><p>MNIST&#x6570;&#x636E;&#x5F88;&#x89C4;&#x8303;&#xFF0C;&#x9ED1;&#x5E95;&#x767D;&#x5B57;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x6807;&#x7B7E;&#xFF0C;&#x7136;&#x800C;MNIST-M&#x5219;&#x662F;&#x5E26;&#x6709;&#x989C;&#x8272;&#x80CC;&#x666F;&#x7EB9;&#x7406;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x65E0;&#x6807;&#x7B7E;&#xFF0C;&#x628A;MNIST&#x6709;&#x76D1;&#x7763;&#x5B66;&#x5230;&#x7684;&#x6A21;&#x578B;&#x8FC1;&#x79FB;&#x5230;MNIST-M&#x65E0;&#x76D1;&#x7763;&#x7684;&#x573A;&#x666F;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x57DF;&#x5BF9;&#x6297;&#xFF08;Domain-adversarial training&#xFF09;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;CNN&#xFF0C;&#x524D;&#x9762;&#x7684;&#x90E8;&#x5206;&#x5728;&#x62BD;&#x7279;&#x5F81;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x90E8;&#x5206;&#x5728;&#x505A;&#x5206;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x524D;&#x9762;&#x7684;&#x90E8;&#x5206;&#x5C31;&#x80FD;&#x62FF;&#x51FA;&#x6765;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x62BD;&#x53D6;&#x5668;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6BD4;&#x5982;4096&#x7EF4;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x5BF9;&#x5B83;&#x964D;&#x4E3A;&#x53EF;&#x89C6;&#x5316;&#x540E;&#x4F1A;&#x53D1;&#x73B0;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x505A;&#x5206;&#x7C7B;&#x662F;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x88AB;&#x5206;&#x5272;&#x5230;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#x80FD;&#x505A;&#x5206;&#x7C7B;&#x3002;&#x7136;&#x800C;&#x62FF;&#x5230;MNIST-M&#x4E0A;&#x4F1A;&#x53D1;&#x73B0;&#x6570;&#x636E;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x4E00;&#x5927;&#x5768;&#x91CC;&#xFF0C;&#x6CA1;&#x6CD5;&#x76F4;&#x63A5;&#x7528;&#x539F;&#x6765;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x505A;&#x5206;&#x7C7B;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5E0C;&#x671B;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5728;&#x80FD;&#x5BF9;&#x539F;&#x5148;&#x6570;&#x5B57;&#x505A;&#x8BC6;&#x522B;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x80FD;&#x6D88;&#x9664;&#x6389;&#x5BF9;&#x201C;&#x57DF;&#x201D;&#xFF08;&#x6765;&#x81EA;&#x54EA;&#x4E2A;&#x56FE;&#x7247;&#x6570;&#x636E;&#x96C6;&#xFF09;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x7F51;&#x7EDC;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x62BD;&#x53D6;&#x5668;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7F51;&#x7EDC;&#x662F;0-9&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x7F51;&#x7EDC;&#x7528;&#x6765;&#x533A;&#x5206;&#x662F;&#x6765;&#x81EA;&#x54EA;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4F1A;&#x5F88;&#x52AA;&#x529B;&#x5730;&#x62BD;&#x7279;&#x5F81;&#xFF0C;&#x4F7F;&#x5F97;&#x7279;&#x5F81;&#x5373;&#x8981;&#x5728;0-9&#x5206;&#x7C7B;&#x4E0A;&#x8868;&#x73B0;&#x5F97;&#x597D;&#xFF0C;&#x53C8;&#x8981;&#x4F7F;&#x5F97;&#x7B2C;&#x4E8C;&#x4E2A;&#x7F51;&#x7EDC;&#x5F88;&#x52AA;&#x529B;&#x5730;&#x53BB;&#x533A;&#x5206;&#x6765;&#x81EA;&#x54EA;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF08;&#x57DF;&#xFF09;&#x5374;&#x53C8;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;&#x751F;&#x6210;&#x5BF9;&#x6297;&#x7F51;&#x7EDC;&#x7684;&#x601D;&#x8DEF;&#x3002;&#x8D70;&#x524D;&#x4E24;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x7528;MNIST&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x6807;&#x7B7E;&#xFF0C;&#x8D70;1&#x548C;3&#x7F51;&#x7EDC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x90FD;&#x8981;&#x4F7F;&#x7528;&#x3002;&#x7B2C;&#x4E00;&#x6761;&#x8DEF;&#x5C31;&#x662F;&#x4E2A;CNN&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x7B2C;&#x4E8C;&#x6761;&#x8DEF;&#x7684;&#x201C;&#x8B66;&#x5BDF;&#x201C;&#x662F;&#x4E2A;SGD&#xFF0C;&#x7136;&#x800C;&#x7279;&#x5F81;&#x62BD;&#x53D6;&#x5668;&#x5E76;&#x4E0D;&#x60F3;&#x8BA9;&#x5B83;&#x80FD;&#x591F;&#x533A;&#x5206;&#x4E24;&#x4E2A;&#x57DF;&#xFF0C;&#x6240;&#x4EE5;&#x201D;&#x8B66;&#x5BDF;&#x201C;&#x7684;&#x68AF;&#x5EA6;&#x8981;&#x53CD;&#x7740;&#x4F20;&#x9012;&#x56DE;&#x6765;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x62BD;&#x5230;&#x7684;&#x7279;&#x5F81;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x90FD;&#x80FD;&#x6709;&#x4E0D;&#x9519;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x867D;&#x7136;&#x4F1A;&#x5F71;&#x54CD;&#x9662;&#x7EBF;MDIST&#x7684;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x4F46;&#x662F;&#x53BB;&#x6389;&#x57DF;&#x4FE1;&#x606F;&#x540E;&#xFF0C;&#x5373;&#x590D;&#x7528;&#x4E86;MDIST&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x53C8;&#x5728;MDIST-M&#x65E0;&#x76D1;&#x7763;&#x6570;&#x636E;&#x4E0A;&#x4E5F;&#x80FD;&#x591F;&#x8868;&#x73B0;&#x5F88;&#x597D;&#x3002;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x8FC1;&#x79FB;&#x5B66;&#x4E60;/&#x57DF;&#x5BF9;&#x6297;.png" alt="logo"></p>
<h2 id="&#x5176;&#x4ED6;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;"><a href="#&#x5176;&#x4ED6;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;" class="headerlink" title="&#x5176;&#x4ED6;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;"></a>&#x5176;&#x4ED6;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;</h2><p>&#x4ECE;&#x6709;&#x76D1;&#x7763;&#x5230;&#x65E0;&#x76D1;&#x7763;&#x7684;&#x8FC1;&#x79FB;&#x65B9;&#x5F0F;&#x8FD8;&#x6709;&#x96F6;&#x6837;&#x672C;&#x5B66;&#x4E60;&#xFF08;Zero-shot learning&#xFF09;&#xFF0C;&#x800C;&#x4ECE;&#x65E0;&#x76D1;&#x7763;&#x5230;&#x6709;&#x76D1;&#x7763;&#x53CA;&#x4ECE;&#x65E0;&#x76D1;&#x7763;&#x5230;&#x65E0;&#x76D1;&#x7763;&#x8FD8;&#x6709;Self-taught Learning&#x548C;Self-taught Clustering&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/机器学习/TensorFlow数据预处理和共享变量/" rel="next" title="TensorFlow数据预处理和共享变量">
                <i class="fa fa-chevron-left"></i> TensorFlow数据预处理和共享变量
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/icon.jpeg"
               alt="アカリ" />
          <p class="site-author-name" itemprop="name">アカリ</p>
          <p class="site-description motion-element" itemprop="description">很羡慕工作后辞职读研的人，能腾出一两年的大片时间来专心学习某个自己喜欢的领域的知识技能其实是一件非常幸福的事……</p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/">
                <span class="site-state-item-count">22</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#Fine-tune"><span class="nav-number">1.</span> <span class="nav-text">Fine-tune</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#保守训练（Conservative-Training）"><span class="nav-number">2.</span> <span class="nav-text">保守训练（Conservative Training）</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#层迁移（Layer-Transfer）"><span class="nav-number">3.</span> <span class="nav-text">层迁移（Layer Transfer）</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Multitask-Learning"><span class="nav-number">4.</span> <span class="nav-text">Multitask Learning</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#渐进式神经网络"><span class="nav-number">5.</span> <span class="nav-text">渐进式神经网络</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#域对抗训练"><span class="nav-number">6.</span> <span class="nav-text">域对抗训练</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#其他迁移学习方式"><span class="nav-number">7.</span> <span class="nav-text">其他迁移学习方式</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">アカリ</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	





  




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=default"></script>
  


  

  

  


</body>
</html>
