<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="一枚死宅记录2016年的生活，包括旅游、生活娱乐和工作学习。">
<meta property="og:type" content="article">
<meta property="og:title" content="2016回顾">
<meta property="og:url" content="http://yoursite.com/心情随笔/2016回顾/index.html">
<meta property="og:site_name" content="Akali's Room">
<meta property="og:description" content="一枚死宅记录2016年的生活，包括旅游、生活娱乐和工作学习。">
<meta property="og:image" content="http://yoursite.com/心情随笔/2016回顾/toukyou.jpeg">
<meta property="og:image" content="http://yoursite.com/心情随笔/2016回顾/kalafina.jpeg">
<meta property="og:image" content="http://yoursite.com/心情随笔/2016回顾/dalian.jpeg">
<meta property="og:updated_time" content="2017-01-28T10:21:59.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="2016回顾">
<meta name="twitter:description" content="一枚死宅记录2016年的生活，包括旅游、生活娱乐和工作学习。">
<meta name="twitter:image" content="http://yoursite.com/心情随笔/2016回顾/toukyou.jpeg">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/心情随笔/2016回顾/"/>





  <title> 2016回顾 | Akali's Room </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Akali's Room</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <p class="site-subtitle"></p>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-links">
          <a href="/links" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-question-circle"></i> <br />
            
            友链
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/心情随笔/2016回顾/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="アカリ">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/icon.jpeg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Akali's Room">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Akali's Room" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                2016回顾
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-01-07T15:00:00+08:00">
                2017-01-07
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/心情随笔/" itemprop="url" rel="index">
                    <span itemprop="name">心情随笔</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          
              <div class="post-description">
                  一枚死宅记录2016年的生活，包括旅游、生活娱乐和工作学习。
              </div>
          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5176;&#x5B9E;&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#x8FD8;&#x7B97;&#x6E05;&#x6670;&#xFF0C;&#x4F46;&#x662F;&#x6587;&#x7B14;&#x5374;&#x4E00;&#x76F4;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#xFF0C;&#x4E0D;&#x8FC7;&#x96BE;&#x5F97;&#x6709;&#x673A;&#x4F1A;&#x4EE5;&#x5E74;&#x4E3A;&#x5355;&#x4F4D;&#x601D;&#x8003;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x59A8;&#x5728;&#x8FD9;&#x91CC;&#x505A;&#x4E2A;&#x603B;&#x7ED3;&#x5427;&#x3002;&#x8FD9;&#x4E00;&#x5E74;&#x7684;&#x751F;&#x6D3B;&#x8BB2;&#x771F;&#x633A;&#x7D2F;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x7D2F;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x8FC7;&#x5F97;&#x6709;&#x591A;&#x4E48;&#x8F9B;&#x82E6;&#xFF0C;&#x800C;&#x662F;&#x5F88;&#x5145;&#x5B9E;&#xFF01;&#x867D;&#x8BF4;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x4E2A;&#x6280;&#x672F;&#x4EBA;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x59CB;&#x7EC8;&#x8BA4;&#x4E3A;&#x6280;&#x672F;&#x4EC5;&#x4EC5;&#x662F;&#x751F;&#x6D3B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x751F;&#x6D3B;&#x4E2D;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x5148;&#x4ECE;&#x65C5;&#x884C;&#x548C;&#x751F;&#x6D3B;&#x5F00;&#x59CB;&#x8BF4;&#x8D77;&#x5427;&#xFF0C;&#x6280;&#x672F;&#x653E;&#x5728;&#x6700;&#x540E;&#xFF01;</p>
<h2 id="&#x65C5;&#x884C;"><a href="#&#x65C5;&#x884C;" class="headerlink" title="&#x65C5;&#x884C;"></a>&#x65C5;&#x884C;</h2><p>&#x672C;&#x6765;&#x81EA;&#x5DF1;&#x662F;&#x4E00;&#x4E2A;&#x6B7B;&#x5B85;&#xFF0C;&#x8FD9;&#x4E00;&#x5E74;&#x5374;&#x5F00;&#x59CB;&#x559C;&#x6B22;&#x51FA;&#x53BB;&#x65C5;&#x884C;&#x4E86;&#xFF0C;&#x51FA;&#x53BB;&#x591A;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E5F;&#x662F;&#x5E94;&#x8BE5;&#x7684;&#xFF01;</p>
<p>&#x4ECE;&#x4E8C;&#x6708;&#x4EFD;&#x5F00;&#x59CB;&#x89C4;&#x5212;&#x4E1C;&#x4EAC;&#x81EA;&#x7531;&#x884C;&#xFF0C;&#x5230;&#x56DB;&#x6708;&#x4EFD;&#x51FA;&#x53BB;&#x65C5;&#x6E38;&#xFF0C;&#x8FD9;&#x7684;&#x786E;&#x662F;&#x6BD4;&#x8F83;&#x8003;&#x9A8C;&#x81EA;&#x5DF1;&#x7684;&#x89C4;&#x5212;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E1C;&#x897F;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x4E00;&#x5EA7;&#x964C;&#x751F;&#x57CE;&#x5E02;&#x7684;&#x5730;&#x56FE;&#x548C;&#x4EA4;&#x901A;&#x65B9;&#x5F0F;&#x7684;&#x8C03;&#x67E5;&#x3001;&#x5BF9;&#x666F;&#x70B9;&#x5F00;&#x653E;&#x65F6;&#x95F4;&#x548C;&#x5185;&#x5BB9;&#x3001;Event&#x65F6;&#x95F4;&#x3001;&#x8FD8;&#x6709;&#x7535;&#x5F71;&#x9662;&#x7B49;&#x7684;&#x8C03;&#x67E5;&#x3001;&#x8FD8;&#x6709;&#x8981;&#x53BB;&#x5403;&#x4EC0;&#x4E48;&#x9986;&#x5B50;&#x7B49;&#x7B49;&#x3002;&#x7531;&#x4E8E;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x81EA;&#x5DF1;&#x89C4;&#x5212;&#x51FA;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x6574;&#x4E2A;&#x4ECE;0&#x8FED;&#x4EE3;&#x4E86;4&#x7248;&#x884C;&#x7A0B;&#x51FA;&#x6765;&#xFF0C;&#x6700;&#x7EC8;&#x5F88;&#x987A;&#x5229;&#x5730;&#x73A9;&#x904D;&#x4E86;&#x4E1C;&#x4EAC;&#x90FD;&#x5185;&#x5927;&#x591A;&#x6570;&#x6709;&#x610F;&#x601D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD8;&#x770B;&#x4E86;&#x4E00;&#x573A;&#x67EF;&#x5357;M20&#x751F;&#x8089;~ &#x5F53;&#x7136;&#x8FD9;&#x4E5F;&#x591A;&#x4E8F;&#x4E86;&#x81EA;&#x5DF1;&#x65E5;&#x8BED;&#x51E0;&#x4E4E;&#x6CA1;&#x4EC0;&#x4E48;&#x969C;&#x788D;&#x3002;</p>
<p><img src="/&#x5FC3;&#x60C5;&#x968F;&#x7B14;/2016&#x56DE;&#x987E;/toukyou.jpeg" alt="logo"></p>
<p>&#x6211;&#x60F3;&#x6709;&#x975E;&#x5E38;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x53EA;&#x662F;&#x770B;&#x8D44;&#x6599;&#x9053;&#x542C;&#x9014;&#x8BF4;&#x800C;&#x6CA1;&#x6709;&#x4EB2;&#x81EA;&#x53BB;&#x8FC7;&#x65E5;&#x672C;&#x7684;&#x8BDD;&#x662F;&#x4F53;&#x4F1A;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x8DB3;&#x591F;&#x5199;&#x597D;&#x51E0;&#x7BC7;&#x535A;&#x6587;&#x6765;&#x8BF4;&#x660E;&#xFF0C;&#x8FD9;&#x91CC;&#x7565;&#x8FC7;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5982;&#x679C;&#x8BF4;&#x548C;&#x5317;&#x4EAC;&#x4E0A;&#x6D77;&#x76F8;&#x6BD4;&#x9996;&#x5C14;&#x5C31;&#x662F;&#x4E2A;&#x4E8C;&#x7EBF;&#x57CE;&#x5E02;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x548C;&#x4E1C;&#x4EAC;&#x76F8;&#x6BD4;&#x5317;&#x4EAC;&#x4E0A;&#x6D77;&#x6050;&#x6015;&#x5C31;&#x662F;&#x4E2A;&#x4E09;&#x7EBF;&#x57CE;&#x5E02;&#x4E86;&#x3002;</p>
<p>&#x4E94;&#x6708;&#x4EFD;&#x53BB;&#x4E86;&#x8D9F;&#x4E0A;&#x6D77;&#xFF0C;&#x7531;&#x4E8E;&#x6709;&#x4E86;&#x4E4B;&#x524D;&#x7684;&#x7ECF;&#x9A8C;&#x6240;&#x4EE5;&#x8FD9;&#x4E09;&#x5929;&#x7684;&#x884C;&#x7A0B;&#x57FA;&#x672C;&#x6CA1;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x53C2;&#x52A0;Kalafina&#x7684;&#x6F14;&#x5531;&#x4F1A;&#xFF0C;&#x987A;&#x4FBF;&#x9762;&#x57FA;&#x4E86;&#x4E24;&#x4E2A;&#x7F51;&#x53CB;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x672C;&#x6B7B;&#x5B85;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x5750;&#x9AD8;&#x94C1;&#x3001;&#x7B2C;&#x4E00;&#x6B21;&#x53C2;&#x52A0;&#x6F14;&#x5531;&#x4F1A;&#xFF0C;&#x6211;&#x60F3;&#x719F;&#x6089;&#x52A8;&#x6F2B;&#x5708;&#x7684;&#x670B;&#x53CB;&#x5E94;&#x8BE5;&#x90FD;&#x77E5;&#x9053;K&#x56E2;&#x7684;&#x97F3;&#x4E50;&#x548C;&#x5531;&#x529F;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x5427;&#xFF01;</p>
<p><img src="/&#x5FC3;&#x60C5;&#x968F;&#x7B14;/2016&#x56DE;&#x987E;/kalafina.jpeg" alt="logo"></p>
<p>&#x4E0A;&#x6D77;&#x7684;&#x7ECF;&#x6D4E;&#x6C34;&#x5E73;&#x867D;&#x7136;&#x8FDC;&#x8FDC;&#x4E0D;&#x53CA;&#x4E1C;&#x4EAC;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4F53;&#x5374;&#x53C8;&#x6BD4;&#x5317;&#x4EAC;&#x4E0A;&#x4E86;&#x4E00;&#x4E2A;&#x53F0;&#x9636;&#xFF0C;&#x5317;&#x4EAC;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x53D7;&#x662F;&#x5230;&#x5904;&#x90FD;&#x662F;&#x5927;&#x7247;&#x7684;&#x8352;&#x5730;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5B9E;&#x4F53;&#x7ECF;&#x6D4E;&#xFF0C;&#x53BB;&#x54EA;&#x90FD;&#x8981;&#x8D70;&#x5F88;&#x4E45;&#xFF0C;&#x65F6;&#x95F4;&#x90FD;&#x8017;&#x5728;&#x4E86;&#x8DEF;&#x4E0A;&#xFF0C;&#x8DEF;&#x8FB9;&#x90FD;&#x662F;&#x5149;&#x79C3;&#x79C3;&#x7684;&#xFF0C;&#x800C;&#x4E0A;&#x6D77;&#x5219;&#x662F;&#x7C7B;&#x4F3C;&#x4E09;&#x91CC;&#x5C6F;&#x7684;&#x5730;&#x65B9;&#x6BD4;&#x6BD4;&#x7686;&#x662F;&#xFF0C;&#x5E76;&#x4E14;&#x52A8;&#x6F2B;&#x5468;&#x8FB9;&#x4EA7;&#x4E1A;&#x6BD4;&#x5317;&#x4EAC;&#x4E5F;&#x53D1;&#x8FBE;&#x4E0D;&#x5C11;&#x3002;</p>
<p>&#x516B;&#x6708;&#x521D;&#x88AB;&#x5927;&#x5B66;&#x540C;&#x5B66;&#x62C9;&#x53BB;&#x5927;&#x8FDE;&#x65C5;&#x6E38;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x4EA4;&#x7ED9;&#x4ED6;&#x6765;&#x5B89;&#x6392;&#xFF0C;&#x8BB2;&#x771F;&#x6211;&#x53EA;&#x662F;&#x62B1;&#x7740;&#x51FA;&#x53BB;&#x770B;&#x770B;&#x7684;&#x5FC3;&#x7B54;&#x5E94;&#x53BB;&#x65C5;&#x6E38;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x5BF9;&#x5927;&#x8FDE;&#x7684;&#x5370;&#x8C61;&#x5E76;&#x4E0D;&#x597D;&#xFF0C;&#x7A7A;&#x6C14;&#x4E2D;&#x5F25;&#x6F2B;&#x7740;&#x5783;&#x573E;&#x7684;&#x5473;&#x9053;&#xFF0C;&#x5927;&#x7247;&#x4FC4;&#x5F0F;&#x7684;&#x9AD8;&#x697C;&#x91CC;&#x9762;&#x5374;&#x7A7A;&#x65E0;&#x4E00;&#x4EBA;&#xFF0C;&#x6253;&#x4E0D;&#x5230;&#x8F66;&#xFF0C;&#x4EBA;&#x7FA4;&#x6DF7;&#x6742;&#x8052;&#x566A;&#x5374;&#x4F53;&#x4F1A;&#x4E0D;&#x5230;&#x7E41;&#x534E;&#x3002;</p>
<p><img src="/&#x5FC3;&#x60C5;&#x968F;&#x7B14;/2016&#x56DE;&#x987E;/dalian.jpeg" alt="logo"></p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#x4ECA;&#x540E;&#x300C;&#x56FD;&#x5185;&#x65C5;&#x6E38;&#x8981;&#x614E;&#x91CD;&#x300D;&#xFF0C;&#x65E2;&#x7136;&#x5404;&#x79CD;&#x5C42;&#x6B21;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x53BB;&#x8FC7;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5411;&#x5F80;&#x7684;&#x7A76;&#x7ADF;&#x662F;&#x4E00;&#x79CD;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x5207;&#x5B9E;&#x7406;&#x89E3;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x5916;&#x5730;&#x4EBA;&#x90FD;&#x4E0D;&#x60DC;&#x4E00;&#x5207;&#x5730;&#x300C;&#x5317;&#x6F02;&#x300D;&#x6362;&#x6765;&#x66F4;&#x597D;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x800C;&#x4E2D;&#x4EA7;&#x90FD;&#x4E0D;&#x60DC;&#x4E00;&#x5207;&#x5730;&#x300C;&#x6D77;&#x6F02;&#x300D;&#x6362;&#x6765;&#x66F4;&#x597D;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x6536;&#x83B7;&#x5427;&#x3002;</p>
<p>&#x4ECA;&#x5E74;&#x56DB;&#x6708;&#x4EFD;&#x6253;&#x7B97;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x897F;&#x65E5;&#x672C;&#x4F11;&#x5047;&#xFF0C;&#x5728;&#x4EAC;&#x90FD;&#x591A;&#x8F6C;&#x8F6C;&#xFF0C;&#x4F53;&#x4F1A;&#x4E00;&#x4E0B;&#x300C;&#x771F;&#x6B63;&#x7684;&#x65E5;&#x672C;&#x300D;&#x2014;&#x2014;&#x4E5F;&#x5C31;&#x662F;&#x4E2D;&#x56FD;&#x672C;&#x8BE5;&#x6709;&#x7684;&#x6837;&#x5B50;&#x2014;&#x2014;&#x7A76;&#x7ADF;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#xFF0C;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x7B56;&#x5212;&#x5F53;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x673A;&#x4F1A;&#x7684;&#x8BDD;&#x4E5F;&#x51C6;&#x5907;&#x53BB;&#x53F0;&#x6E7E;&#x770B;&#x770B;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x4E2D;&#x56FD;&#x5728;&#x53F0;&#x6E7E;&#x3002;&#x6211;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x81EA;&#x5DF1;&#x65C5;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x548C;&#x81EA;&#x5DF1;&#x76F8;&#x5904;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x62FF;&#x4E3B;&#x610F;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6765;&#x81EA;(&#x80FD;&#x529B;&#x6BD4;&#x8F83;&#x5DEE;&#x7684;)&#x4ED6;&#x4EBA;&#x7684;&#x62D6;&#x7D2F;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x4EAB;&#x53D7;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x65F6;&#x5149;&#x3002;</p>
<h2 id="&#x751F;&#x6D3B;&#x548C;&#x5A31;&#x4E50;"><a href="#&#x751F;&#x6D3B;&#x548C;&#x5A31;&#x4E50;" class="headerlink" title="&#x751F;&#x6D3B;&#x548C;&#x5A31;&#x4E50;"></a>&#x751F;&#x6D3B;&#x548C;&#x5A31;&#x4E50;</h2><p>&#x9996;&#x5148;&#x662F;&#x51CF;&#x80A5;&#xFF0C;&#x4E3A;&#x4E86;&#x51FA;&#x53BB;&#x65C5;&#x6E38;&#x65F6;&#x4F53;&#x529B;&#x80FD;&#x8DDF;&#x4E0A;&#xFF0C;&#x82B1;&#x4E86;&#x4E09;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x4ECE;84.5&#x516C;&#x65A4;&#x4E00;&#x53E3;&#x6C14;&#x51CF;&#x5230;&#x4E86;76.5&#x516C;&#x65A4;&#xFF0C;&#x4F46;&#x662F;&#x597D;&#x666F;&#x4E0D;&#x957F;&#xFF0C;&#x56DE;&#x56FD;&#x4E4B;&#x540E;&#x4F53;&#x91CD;&#x4E00;&#x76F4;&#x9636;&#x6BB5;&#x6027;&#x5730;&#x4E0A;&#x4E0B;&#x6CE2;&#x52A8;&#xFF0C;&#x73B0;&#x5728;&#x53C8;&#x53CD;&#x5F39;&#x56DE;&#x4E86;81&#x516C;&#x65A4;&#x5DE6;&#x53F3;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x8981;&#x9501;&#x4F4F;&#x51CF;&#x80A5;&#x7684;&#x6548;&#x679C;&#x5C31;&#x9700;&#x8981;&#x589E;&#x808C;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5B9E;&#x5728;&#x662F;&#x89C9;&#x5F97;&#x808C;&#x8089;&#x5757;&#x8D85;&#x6076;&#x5FC3;&#x554A;&#x6709;&#x6728;&#x6709;&#xFF01;&#x5176;&#x5B9E;&#x51CF;&#x80A5;&#x4E5F;&#x5E76;&#x4E0D;&#x53EF;&#x6015;&#xFF0C;&#x9053;&#x7406;&#x561B;&#x4E5F;&#x542C;&#x4E86;&#x592A;&#x591A;&#xFF0C;&#x5173;&#x952E;&#x8FD8;&#x662F;&#x5728;&#x6BC5;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B8C;&#x6210;&#x4E86;&#x65C5;&#x6E38;&#x4EFB;&#x52A1;&#x627E;&#x4E0D;&#x5230;&#x76EE;&#x6807;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x751F;&#x6D3B;&#x5B9E;&#x5728;&#x662F;&#x6BD4;&#x8F83;&#x5145;&#x5B9E;&#x7B49;&#x5404;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x603B;&#x4E4B;&#x5728;&#x6BC5;&#x529B;&#x8FD9;&#x65B9;&#x9762;&#x662F;&#x6CA1;&#x6709;&#x8DDF;&#x4E0A;&#x7684;&#xFF0C;&#x4ECA;&#x5E74;&#x5728;&#x5065;&#x5EB7;&#x65B9;&#x9762;&#x81EA;&#x5DF1;&#x4E00;&#x5B9A;&#x5F97;&#x591A;&#x63A7;&#x5236;&#x63A7;&#x5236;&#x3002;</p>
<p>&#x7136;&#x540E;&#x662F;&#x5F39;&#x7434;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x5730;&#xFF0C;&#x575A;&#x6301;&#x201C;&#x81EA;&#x5B66;&#x597D;&#x4E45;&#x627E;&#x4F60;&#x4E00;&#x6B21;&#x5E2E;&#x6211;&#x8BCA;&#x65AD;&#x201D;&#x7684;&#x539F;&#x5219;&#x4E0A;&#x8BFE;&#xFF0C;&#x4ECA;&#x5E74;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x7EED;&#x8BFE;&#xFF08;&#x5176;&#x5B9E;&#x8001;&#x5E08;&#x90FD;&#x633A;&#x8BA8;&#x538C;&#x6211;&#x8FD9;&#x79CD;&#x806A;&#x660E;&#x5B66;&#x751F;&#x7684;&#xFF0C;&#x4E0A;&#x8BFE;&#x7D2F;&#xFF09;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x6BCF;&#x4E2A;&#x6708;&#x82B1;&#x5728;&#x7EC3;&#x7434;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6050;&#x6015;&#x90FD;&#x4E0D;&#x5230;20&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x53E4;&#x5178;&#x5409;&#x4ED6;&#x7684;&#x7EC3;&#x4E60;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;&#x57FA;&#x672C;&#x529F;&#x2014;&#x2014;&#x5404;&#x79CD;&#x722C;&#x683C;&#x5B50;&#x4EE5;&#x53CA;&#x5BF9;&#x5DE6;&#x624B;&#x5C0F;&#x65F6;&#x65E0;&#x540D;&#x6307;&#x548C;&#x5BF9;&#x53F3;&#x624B;&#x529B;&#x5EA6;&#x7684;&#x628A;&#x63A7;&#xFF0C;&#x5C31;&#x62FF;&#x6700;&#x5165;&#x95E8;&#x7684;&#x300A;&#x98CE;&#x4E4B;&#x8BD7;&#x300B;&#x6765;&#x8BF4;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x4E00;&#x9996;&#x66F2;&#x5B50;&#x660E;&#x660E;&#x53EF;&#x4EE5;&#x5BF9;&#x7740;&#x8C31;&#x5B50;&#x5F39;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x548C;&#x5927;&#x5E08;&#x5F39;&#x51FA;&#x7684;&#x97F3;&#x8272;&#x548C;&#x7EC6;&#x8282;&#x76F8;&#x6BD4;&#x5B8C;&#x5168;&#x662F;&#x4E24;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x50CF;&#x6211;&#x8FD9;&#x79CD;&#x559C;&#x6B22;&#x8282;&#x594F;&#x6162;&#x7684;&#x6292;&#x60C5;&#x66F2;&#x5B50;&#x7684;&#x66F4;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x867D;&#x8BF4;&#x6F14;&#x594F;&#x66F2;&#x5B50;&#x662F;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7EC3;&#x7434;&#x7684;&#x91CD;&#x70B9;&#x5E76;&#x4E0D;&#x5728;&#x4E8E;&#x80FD;&#x5F39;&#x51FA;&#x591A;&#x5C11;&#x66F2;&#x5B50;&#x2014;&#x2014;&#x90A3;&#x53EA;&#x662F;&#x6307;&#x6CD5;&#x7684;&#x7EC4;&#x5408;&#x800C;&#x5DF2;&#x2014;&#x2014;&#x800C;&#x5728;&#x4E8E;&#x57FA;&#x672C;&#x529F;&#x3002;&#x597D;&#x5728;&#x73B0;&#x5728;&#x57FA;&#x672C;&#x529F;&#x5DF2;&#x7ECF;&#x63D0;&#x5347;&#x4E0A;&#x53BB;&#xFF0C;&#x4ECA;&#x5E74;&#x53EF;&#x4EE5;&#x518D;&#x591A;&#x4E0A;&#x4E00;&#x4E9B;&#x66F2;&#x5B50;&#x4E86;&#xFF01;</p>
<p>&#x6628;&#x5929;&#x770B;&#x4E86;&#x770B;&#x7F51;&#x6613;&#x4E91;&#x97F3;&#x4E50;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6BCF;&#x5929;&#x90FD;&#x6709;140&#x5206;&#x949F;&#x4EE5;&#x4E0A;&#x5728;&#x542C;&#x97F3;&#x4E50;&#xFF0C;&#x4E0D;&#x8FC7;&#x503C;&#x5F97;&#x5E86;&#x5E78;&#x7684;&#x662F;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x4E86;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x542C;&#x7684;3200&#x591A;&#x9996;&#x6B4C;&#x548C;&#x66F2;&#x5B50;&#x4E2D;&#x5C42;&#x5C42;&#x7B5B;&#x9009;&#x5220;&#x9664;&#xFF0C;&#x627E;&#x51FA;&#x4E86;&#x4E0D;&#x5230;50&#x9996;&#x6700;&#x559C;&#x6B22;&#x7684;&#x8F7B;&#x97F3;&#x4E50;&#x548C;&#x4E0D;&#x5230;20&#x9996;&#x6B4C;&#xFF0C;&#x8FD9;&#x6837;&#x81EA;&#x5DF1;&#x7A76;&#x7ADF;&#x559C;&#x6B22;&#x4EC0;&#x4E48;&#x5C31;&#x8D8A;&#x6765;&#x8D8A;&#x660E;&#x786E;&#x4E86;&#xFF01;&#x4ECA;&#x5E74;&#x8FD9;&#x79CD;&#x7B5B;&#x9009;&#x4E60;&#x60EF;&#x8FD8;&#x662F;&#x8981;&#x4E0D;&#x65AD;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#xFF01;</p>
<p>&#x81F3;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x6742;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x90FD;&#x89C9;&#x5F97;&#x5FAE;&#x535A;&#x7684;&#x623E;&#x6C14;&#x5F88;&#x91CD;&#xFF0C;&#x4E8E;&#x662F;&#x5728;&#x5E74;&#x521D;&#x5F7B;&#x5E95;&#x9000;&#x51FA;&#x4E86;&#x5FAE;&#x535A;&#x8F6C;&#x800C;&#x5F00;&#x59CB;&#x5728;&#x63A8;&#x7279;&#x7684;&#x65E5;&#x672C;&#x4EBA;&#x5708;&#x73A9;&#xFF0C;&#x8FD9;&#x4E00;&#x5E74;&#x4E0B;&#x6765;&#x867D;&#x8BF4;&#x6CA1;&#x6709;&#x82B1;&#x4EC0;&#x4E48;&#x7CBE;&#x529B;&#x300C;&#x4ED4;&#x7EC6;&#x5B66;&#x300D;&#x65E5;&#x8BED;&#xFF0C;&#x4E5F;&#x8033;&#x6FE1;&#x76EE;&#x67D3;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x81F3;&#x5C11;&#x5728;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x601D;&#x548C;&#x65E5;&#x5E38;&#x804A;&#x5929;&#x4E0A;&#x662F;&#x4E0D;&#x4F1A;&#x9047;&#x5230;&#x4EC0;&#x4E48;&#x969C;&#x788D;&#x4E86;&#xFF01;&#x53E6;&#x5916;&#x8FD9;&#x4E00;&#x5E74;&#x548C;&#x4E24;&#x4F19;&#x670B;&#x53CB;&#x53BB;&#x4E86;&#x4E0D;&#x5C11;&#x6B21;&#x65E5;&#x8BED;KTV&#x8FD8;&#x662F;&#x86EE;&#x5F00;&#x5FC3;&#x7684;~</p>
<p>&#x4E00;&#x76F4;&#x5BF9;&#x7535;&#x5F71;&#x8FD9;&#x4E1C;&#x897F;&#x4E0D;&#x611F;&#x5192;&#xFF0C;&#x53EA;&#x5728;&#x7535;&#x5F71;&#x9662;&#x770B;&#x4E86;&#x4E24;&#x4E2A;&#x7535;&#x5F71;&#x2014;&#x2014;&#x67EF;&#x5357;M20&#x548C;&#x4F60;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x518D;&#x6709;&#x5C31;&#x662F;&#x7ECF;&#x5178;&#x8001;&#x7535;&#x5F71;&#x300A;Always&#x4E09;&#x4E01;&#x76EE;&#x7684;&#x5915;&#x9633;&#x300B;&#x548C;&#x8001;&#x65E5;&#x5267;&#x300A;&#x5973;&#x738B;&#x7684;&#x6559;&#x5BA4;&#x300B;&#xFF0C;&#x6700;&#x8FD1;&#x8FD8;&#x770B;&#x4E86;&#x300A;FF15&#x738B;&#x8005;&#x4E4B;&#x5251;&#x300B;&#xFF0C;&#x51C6;&#x5907;&#x7B49;&#x7535;&#x5F71;&#x9662;&#x4E0A;&#x6620;&#x4E86;&#x518D;&#x53BB;&#x5237;&#x4E00;&#x6B21;&#xFF0C;&#x52A8;&#x6F2B;&#x5012;&#x662F;&#x8FFD;/&#x8865;&#x4E86;&#x597D;&#x51E0;&#x90E8;&#xFF0C;&#x6BD4;&#x5982;&#x300A;&#x95EA;&#x7535;&#x5341;&#x4E00;&#x4EBA;GO 1&#x3001;2&#x3001;3&#x300B;&#x3001;&#x300A;&#x9B54;&#x6CD5;&#x5C11;&#x5973;&#x80B2;&#x6210;&#x8BA1;&#x5212;&#x300B;&#x3001;&#x300A;&#x6697;&#x6740;&#x6559;&#x5BA4;2&#x300B;&#x3001;&#x300A;&#x7537;&#x5B50;&#x9AD8;&#x6821;&#x751F;&#x7684;&#x65E5;&#x5E38;&#x300B;&#x3001;&#x300A;&#x6DF1;&#x6E0A;&#x4F20;&#x8BF4;&#x300B;&#x3001;&#x300A;&#x4ED9;&#x4E50;&#x4F20;&#x8BF4;&#x300B;&#x3001;&#x300A;&#x60C5;&#x70ED;&#x4F20;&#x8BF4;&#x300B;&#x3001;&#x300A;MAGI&#x8F9B;&#x5DF4;&#x5FB7;&#x7684;&#x5192;&#x9669;&#x300B;&#x2026;&#x6709;&#x9057;&#x6F0F;&#x7684;&#x6211;&#x4E5F;&#x8BB0;&#x4E0D;&#x6E05;&#x4E86;&#x3002;</p>
<p>&#x6E38;&#x620F;&#x7684;&#x8BDD;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x6253;&#x4E86;&#x591A;&#x5C11;&#xFF0C;&#x300A;&#x5DEB;&#x5E08;3&#x300B;&#x6CA1;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x70C2;&#x5C3E;&#x4E86;&#x3001;&#x901A;&#x5173;&#x7684;&#x6709;&#x300A;&#x6700;&#x7EC8;&#x5E7B;&#x60F3;15&#x300B;&#x3001;&#x300A;&#x6570;&#x7801;&#x5B9D;&#x8D1D;&#x7F51;&#x7EDC;&#x4FA6;&#x63A2;&#x300B;&#x3001;&#x300A;&#x60C5;&#x70ED;&#x4F20;&#x8BF4;&#x300B;&#x3001;&#x300A;&#x52C7;&#x8005;&#x6597;&#x6076;&#x9F99;4(3&#x5468;&#x76EE;)&#x300B;&#x3001;&#x300A;&#x8840;&#x6E90;&#x300B;&#x3001;&#x300A;&#x52C7;&#x8005;&#x6597;&#x6076;&#x9F99;&#x5EFA;&#x9020;&#x8005;&#x300B;&#x3001;&#x300A;GTA5&#x300B;&#x2026;&#x2026;&#x540C;&#x6837;&#x6570;&#x4E0D;&#x6E05;&#x4E86;&#xFF01;&#x54E6;&#xFF0C;&#x8FD8;&#x6709;&#x8BFE;&#x91D1;&#x624B;&#x6E38;&#x667A;&#x9F99;&#x8FF7;&#x57CE;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x65E5;&#x670D;&#xFF0C;&#x7740;&#x5B9E;&#x8BFE;&#x4E86;&#x4E0D;&#x5C11;&#x91D1;&#x554A;&#xFF01;</p>
<h2 id="&#x5DE5;&#x4F5C;&#x548C;&#x6280;&#x672F;"><a href="#&#x5DE5;&#x4F5C;&#x548C;&#x6280;&#x672F;" class="headerlink" title="&#x5DE5;&#x4F5C;&#x548C;&#x6280;&#x672F;"></a>&#x5DE5;&#x4F5C;&#x548C;&#x6280;&#x672F;</h2><p>&#x867D;&#x8BF4;&#x8FDC;&#x6CA1;&#x6709;&#x524D;&#x51E0;&#x5E74;&#x90A3;&#x4E48;&#x809D;&#x4E86;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FD9;&#x4E00;&#x5E74;&#x662F;&#x5949;&#x884C;&#x751F;&#x6D3B;&#x7B2C;&#x4E00;&#x653F;&#x7B56;&#x7684;&#x561B;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E00;&#x5E74;&#x5B66;&#x6280;&#x672F;&#x5012;&#x662F;&#x4E5F;&#x6CA1;&#x592A;&#x61C8;&#x6020;&#xFF0C;&#x5E74;&#x521D;&#x4E0D;&#x600E;&#x4E48;&#x5FD9;&#xFF0C;&#x5165;&#x95E8;&#x4E86;&#x4E00;&#x628A;ES6&#x548C;React&#x90A3;&#x5957;&#xFF0C;&#x5165;&#x95E8;&#x4E86;&#x4E00;&#x628A;Docker&#xFF0C;&#x4E4B;&#x540E;&#x641E;&#x4E86;&#x4E2A;Java+Golang+Node&#x7684;&#x6DF7;&#x5408;&#x9879;&#x76EE;&#x4E5F;&#x7528;&#x5230;&#x4E86;Redis&#xFF0C;&#x540E;&#x6765;&#x4E00;&#x76F4;&#x5728;&#x5543;&#x5927;&#x6570;&#x636E;&#x90A3;&#x5957;&#x4E1C;&#x897F;&#xFF0C;&#x4ECE;RPC&#x7684;&#x5B9E;&#x73B0;&#x3001;ZooKeeper&#x5206;&#x5E03;&#x5F0F;&#x4E00;&#x81F4;&#x6027;&#x5B9E;&#x73B0;&#x3001;&#x5230;HDFS&#x539F;&#x7406;&#x3001;&#x5230;Hadoop&#x3001;Storm&#x3001;Spark&#x5404;&#x79CD;&#x5185;&#x90E8;&#x673A;&#x5236;&#x3001;&#x8FD8;&#x6709;&#x90A3;&#x4E00;&#x5927;&#x5768;&#x96F6;&#x96F6;&#x788E;&#x788E;&#x7684;&#x5927;&#x6570;&#x636E;&#x5468;&#x8FB9;&#x5DE5;&#x5177;&#x4EC0;&#x4E48;HBase&#x3001;Flume&#x3001;ES&#x4E4B;&#x7C7B;&#x7684;&#x90FD;&#x73A9;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x6700;&#x540E;&#x51E0;&#x4E2A;&#x6708;&#x641E;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x4ECE;0&#x8D77;&#x7684;&#x5178;&#x578B;&#x7684;&#x79BB;&#x7EBF;&#x5927;&#x6570;&#x636E;&#x8BA1;&#x7B97;&#x9879;&#x76EE;&#x7684;&#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#x548C;&#x5F00;&#x53D1;&#xFF0C;&#x7528;&#x7684;Scala&#x548C;Python&#x3002;&#x505A;&#x6280;&#x672F;&#x5E74;&#x5934;&#x4E5F;&#x4E0D;&#x592A;&#x77ED;&#x4E86;&#xFF0C;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x548C;&#x5E73;&#x53F0;&#x57FA;&#x672C;&#x641E;&#x4E86;&#x4E2A;&#x904D;&#xFF0C;&#x6700;&#x8FD1;&#x6709;&#x8FD9;&#x4E48;&#x51E0;&#x70B9;&#x4F53;&#x4F1A;&#xFF1A;</p>
<p>&#x522B;&#x88AB;&#x8BED;&#x8A00;&#x62F4;&#x4E0A;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6309;&#x9879;&#x76EE;&#x9700;&#x6C42;&#x548C;&#x56E2;&#x961F;&#x60C5;&#x51B5;&#x9009;&#x8BED;&#x8A00;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x6211;&#x7684;&#x573A;&#x666F;&#x5C31;&#x9700;&#x8981;Node&#x7684;&#x5F02;&#x6B65;&#x6027;&#xFF0C;&#x8BED;&#x6CD5;&#x5C24;&#x5176;&#x662F;&#x8BED;&#x6CD5;&#x7CD6;&#x5219;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4E5F;&#x8BB0;&#x4E0D;&#x4F4F;&#x554A;&#x3002;&#x7136;&#x800C;&#x53C8;&#x4E0D;&#x80FD;&#x4E0D;&#x88AB;&#x62F4;&#x4E0A;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x505A;&#x8C03;&#x4F18;&#x548C;&#x5904;&#x7406;&#x6076;&#x5FC3;&#x7684;&#x5751;(&#x6BD4;&#x5982;&#x5947;&#x602A;&#x7684;&#x7A7A;&#x6307;&#x9488;&#x548C;&#x5185;&#x5B58;&#x6CC4;&#x9732;)&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;/&#x6846;&#x67B6;&#x7684;&#x673A;&#x5236;&#x6709;&#x76F8;&#x5BF9;&#x6DF1;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x6846;&#x67B6;&#x539F;&#x7406;/&#x6A21;&#x5F0F;&#x4E43;&#x81F3;&#x6E90;&#x7801;&#x7684;&#x786E;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5927;&#x6570;&#x636E;&#x8FD9;&#x5957;&#x4E1C;&#x897F;&#xFF0C;&#x53C8;&#x591A;&#x53C8;&#x7EC6;&#x788E;&#xFF0C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x5F53;&#x65F6;&#x5B66;&#x5230;&#x624B;&#x540E;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#x6839;&#x672C;&#x8BB0;&#x4E0D;&#x4F4F;&#xFF0C;&#x6700;&#x591A;&#x4F1A;&#x6210;&#x4E3A;&#x6240;&#x8C13;&#x7684;&#x601D;&#x7EF4;&#x6216;&#x5185;&#x529F;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x53BB;&#x9762;&#x8BD5;&#x88AB;&#x95EE;&#x5230;&#x8FD9;&#x4E9B;&#x8BB0;&#x4E0D;&#x4F4F;&#x7684;&#x4E1C;&#x897F;&#x8FD8;&#x662F;&#x4F1A;&#x6BD4;&#x8F83;&#x72FC;&#x72C8;&#xFF0C;&#x800C;&#x6211;&#x53C8;&#x4E0D;&#x662F;&#x8001;&#x5E08;&#x5929;&#x5929;&#x8BB2;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x4EFF;&#x4F5B;&#x662F;&#x4E00;&#x79CD;&#x65E0;&#x5948;&#x3002;&#x8111;&#x5B50;&#x8FD9;&#x4E1C;&#x897F;&#x771F;&#x4E0D;&#x662F;&#x786C;&#x76D8;&#x554A;&#xFF01;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x7684;&#x786E;&#x6BD4;&#x8F83;&#x8BA8;&#x538C;&#x8FD9;&#x79CD;&#x8FFD;&#x7EC6;&#x8282;&#x7684;&#x9762;&#x8BD5;&#x5B98;&#xFF08;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x666E;&#x901A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E00;&#x9762;&#xFF09;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x53BB;&#x8FD9;&#x6837;&#x9762;&#x8BD5;&#x522B;&#x4EBA;&#xFF0C;&#x6211;&#x9762;&#x4EBA;&#x6BD4;&#x8F83;&#x53BB;&#x559C;&#x6B22;&#x7EFC;&#x5408;&#x5730;&#x770B;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x5DE5;&#x4F5C;&#x4E2D;90%&#x7684;&#x5DE5;&#x4F5C;&#x53EA;&#x7528;&#x5230;&#x4E86;10%&#x7684;&#x6280;&#x80FD;&#x50A8;&#x5907;&#xFF0C;&#x80FD;master&#x6389;&#x90A3;10%&#x5C31;&#x4E0D;&#x9519;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x867D;&#x8BF4;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x6295;&#x5165;&#x65F6;&#x95F4;&#x5199;&#x4E00;&#x5957;Zookeeper&#x6216;&#x8005;HDFS&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x800C;&#x771F;&#x6709;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#x7684;&#x516C;&#x53F8;&#x4E5F;&#x662F;&#x5C11;&#x4E4B;&#x53C8;&#x5C11;&#x7684;&#x3002;</p>
<p>&#x53EF;&#x662F;&#x8BDD;&#x53C8;&#x8BF4;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x4F60;&#x4EE3;&#x7801;&#x5199;&#x7684;&#x518D;&#x5389;&#x5BB3;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x88AB;&#x4EBA;&#x7BA1;&#x7684;&#x5B9E;&#x73B0;&#x8005;&#xFF0C;&#x4F60;&#x89E3;&#x51B3;&#x518D;&#x591A;bug&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x5BF9;&#x7740;&#x4E00;&#x5768;&#x5C0F;&#x5BC6;&#x7801;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#x6298;&#x817E;&#xFF0C;&#x6211;&#x7684;&#x6027;&#x683C;&#x5012;&#x662F;&#x66F4;&#x559C;&#x6B22;&#x62FF;&#x8D77;&#x6307;&#x6325;&#x68D2;&#x6765;&#x7BA1;&#x4E8B;&#xFF0C;&#x80FD;&#x6574;&#x4F53;&#x628A;&#x63E1;&#x4E00;&#x4EF6;&#x4E8B;&#x3001;&#x80FD;&#x9A7E;&#x9A6D;&#x6574;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65B9;&#x5411;&#x548C;&#x8282;&#x594F;&#x3001;&#x80FD;&#x6574;&#x5408;&#x5404;&#x79CD;&#x6280;&#x80FD;&#x548C;&#x4EBA;&#x624D;&#x6765;&#x8FBE;&#x6210;&#x9879;&#x76EE;&#x9884;&#x671F;&#x3001;&#x80FD;&#x8BBE;&#x8BA1;&#x67B6;&#x6784;&#x548C;&#x81EA;&#x52A8;&#x5316;&#x6D41;&#x7A0B;&#x6765;&#x8BA9;&#x5404;&#x65B9;&#x5408;&#x4F5C;&#x987A;&#x7545;&#xFF0C;&#x8FD9;&#x6837;&#x66F4;&#x80FD;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x7EFC;&#x5408;&#x80FD;&#x529B;&#x3002;&#x81F3;&#x4E8E;&#x4E00;&#x4E2A;&#x5E72;&#x8FC7;&#x51E0;&#x5E74;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4ECA;&#x540E;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#xFF0C;&#x8FD8;&#x771F;&#x662F;&#x6027;&#x683C;&#x548C;&#x504F;&#x597D;&#x6765;&#x51B3;&#x5B9A;&#x7684;&#x3002;</p>
<h2 id="&#x8C08;&#x8C08;&#x4ECA;&#x5E74;"><a href="#&#x8C08;&#x8C08;&#x4ECA;&#x5E74;" class="headerlink" title="&#x8C08;&#x8C08;&#x4ECA;&#x5E74;"></a>&#x8C08;&#x8C08;&#x4ECA;&#x5E74;</h2><p>&#x4ECA;&#x5E74;&#x51C6;&#x5907;&#x6BD4;&#x53BB;&#x5E74;&#x5C11;&#x4F11;&#x95F2;&#x4E00;&#x4E9B;&#xFF0C;&#x5DE5;&#x4F5C;&#x5B66;&#x4E60;&#x4E0A;&#xFF0C;&#x4ECA;&#x5E74;&#x91CD;&#x70B9;&#x6295;&#x5165;&#x7684;&#x8BED;&#x8A00;&#x662F;Spark&#x548C;Python&#xFF0C;&#x60F3;&#x6DF1;&#x5165;&#x5543;&#x5543;Spark&#x7684;&#x5E95;&#x5C42;&#xFF0C;&#x8FD8;&#x60F3;&#x641E;&#x5B9A;&#x6570;&#x5B66;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x90A3;&#x5957;&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x4E0D;&#x53EF;&#x80FD;&#x82B1;&#x51E0;&#x5E74;&#x65F6;&#x95F4;&#x53BB;&#x8BFB;&#x7814;&#x7A76;&#x751F;&#xFF0C;&#x6280;&#x672F;&#x8FD9;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x662F;&#x56F4;&#x7ED5;&#x7740;&#x5DE5;&#x4F5C;&#x9700;&#x8981;&#x6765;&#x5B66;&#x4E60;&#x9760;&#x8C31;&#x3002;&#x987A;&#x9053;&#x62FF;&#x4E2A;PMP&#xFF0C;&#x4E3A;&#x4ECA;&#x540E;&#x8F6C;&#x578B;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x7559;&#x6761;&#x8DEF;&#xFF0C;&#x8981;&#x662F;&#x6709;&#x7A7A;&#x5C31;&#x628A;&#x8F66;&#x5B66;&#x4E86;&#x5427;&#x3002;&#x8BB2;&#x771F;&#x6211;&#x5F88;&#x4F69;&#x670D;&#x67D0;&#x4F4D;&#x4ECE;&#x6EF4;&#x6EF4;&#x8F9E;&#x804C;&#x53BB;&#x8BFB;&#x7814;&#x7684;&#x670B;&#x53CB;&#x505A;&#x51FA;&#x8FD9;&#x4E2A;&#x9009;&#x62E9;&#x7684;&#x52C7;&#x6C14;&#xFF0C;&#x8BA4;&#x771F;&#x7528;&#x597D;&#x4E24;&#x5E74;&#x7684;&#x7814;&#x7A76;&#x751F;&#x65F6;&#x95F4;&#x5E26;&#x6765;&#x7684;&#x6536;&#x83B7;&#x8FDC;&#x4E0D;&#x662F;&#x51E0;&#x5341;&#x4E07;&#x5DE5;&#x8D44;&#x7684;&#x635F;&#x5931;&#x53EF;&#x4EE5;&#x8861;&#x91CF;&#x7684;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4ECA;&#x540E;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x73A9;&#xFF0C;&#x4ECA;&#x5E74;&#x60F3;&#x628A;&#x65E5;&#x8BED;&#x6280;&#x80FD;&#x6811;&#x518D;&#x70B9;&#x4E0A;&#x4E00;&#x4E2A;RANK&#xFF0C;&#x867D;&#x8BF4;&#x73B0;&#x5728;&#x662F;&#x5165;&#x95E8;&#x7FFB;&#x8BD1;&#x7EA7;&#x522B;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x9897;&#x6280;&#x80FD;&#x6811;&#x5DF2;&#x7ECF;5&#x5E74;&#x6CA1;&#x6709;&#x5411;&#x4E0A;&#x70B9;&#x4E86;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x5403;&#x8001;&#x672C;&#xFF0C;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x60C5;&#x5883;&#x65F6;&#x8FD8;&#x662F;&#x4F1A;&#x611F;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x65E5;&#x8BED;&#x6BD4;&#x8F83;&#x65E0;&#x529B;&#x7684;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x597D;&#x597D;&#x953B;&#x70BC;&#x8EAB;&#x4F53;&#xFF0C;&#x597D;&#x597D;&#x7EC3;&#x7434;&#xFF0C;&#x7EC3;&#x5230;&#x771F;&#x6B63;&#x62FF;&#x5F97;&#x51FA;&#x624B;&#xFF01;</p>
<p>&#x5C31;&#x8FD9;&#x6837;&#x5427;&#xFF01;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/数据存储/本地Spark访问AWS-S3的那些坑/" rel="next" title="本地Spark访问AWS中国区S3的坑和正确姿势">
                <i class="fa fa-chevron-left"></i> 本地Spark访问AWS中国区S3的坑和正确姿势
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/机器学习/机器学习概念与线性回归/" rel="prev" title="机器学习概念与线性回归">
                机器学习概念与线性回归 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/icon.jpeg"
               alt="アカリ" />
          <p class="site-author-name" itemprop="name">アカリ</p>
          <p class="site-description motion-element" itemprop="description">很羡慕工作后辞职读研的人，能腾出一两年的大片时间来专心学习某个自己喜欢的领域的知识技能其实是一件非常幸福的事……</p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/">
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#旅行"><span class="nav-number">1.</span> <span class="nav-text">旅行</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#生活和娱乐"><span class="nav-number">2.</span> <span class="nav-text">生活和娱乐</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#工作和技术"><span class="nav-number">3.</span> <span class="nav-text">工作和技术</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#谈谈今年"><span class="nav-number">4.</span> <span class="nav-text">谈谈今年</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">アカリ</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	





  




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=default"></script>
  


  

  

  


</body>
</html>
