<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="和统计学习不同，神经网络是一种连接主义的模型，利用两层神经网络可以区分平面上任何凸多边形，具备很强大的模型容量。">
<meta property="og:type" content="article">
<meta property="og:title" content="人工神经网络">
<meta property="og:url" content="http://yoursite.com/机器学习/人工神经网络/index.html">
<meta property="og:site_name" content="アカリの部屋">
<meta property="og:description" content="和统计学习不同，神经网络是一种连接主义的模型，利用两层神经网络可以区分平面上任何凸多边形，具备很强大的模型容量。">
<meta property="og:image" content="http://yoursite.com/机器学习/人工神经网络/神经网络结构.png">
<meta property="og:image" content="http://yoursite.com/机器学习/人工神经网络/整合计算.png">
<meta property="og:updated_time" content="2017-07-11T05:17:43.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="人工神经网络">
<meta name="twitter:description" content="和统计学习不同，神经网络是一种连接主义的模型，利用两层神经网络可以区分平面上任何凸多边形，具备很强大的模型容量。">
<meta name="twitter:image" content="http://yoursite.com/机器学习/人工神经网络/神经网络结构.png">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/机器学习/人工神经网络/"/>





  <title> 人工神经网络 | アカリの部屋 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">アカリの部屋</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <p class="site-subtitle"></p>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-links">
          <a href="/links" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-question-circle"></i> <br />
            
            友链
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/机器学习/人工神经网络/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="アカリ">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/icon.jpeg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="アカリの部屋">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="アカリの部屋" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                人工神经网络
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-05-12T18:00:00+08:00">
                2017-05-12
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/机器学习/" itemprop="url" rel="index">
                    <span itemprop="name">机器学习</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          
              <div class="post-description">
                  和统计学习不同，神经网络是一种连接主义的模型，利用两层神经网络可以区分平面上任何凸多边形，具备很强大的模型容量。
              </div>
          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;"><a href="#&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;" class="headerlink" title="&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;"></a>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;</h2><p>&#x7B80;&#x5355;&#x6765;&#x8BB2;&#xFF0C;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C31;&#x662F;&#x5C06;&#x5F88;&#x591A;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x5206;&#x5C42;&#x52A0;&#x6743;&#x53E0;&#x52A0;&#x7684;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#xFF0C;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x5206;&#x4E3A;&#x8F93;&#x5165;&#x5C42;&#x3001;&#x8F93;&#x51FA;&#x5C42;&#x548C;&#x4E00;&#x5230;&#x591A;&#x4E2A;&#x9690;&#x5C42;&#x4E09;&#x90E8;&#x5206;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x611F;&#x77E5;&#x5668;&#x3002;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;.png" alt="logo"></p>
<p>&#x611F;&#x77E5;&#x5668;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x56DE;&#x5F52;&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x7279;&#x5F81; $ X{_1} $ &#x548C; $ X{_2} $&#xFF08;&#x5305;&#x62EC;&#x5E38;&#x6570;&#x9879;1&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x611F;&#x77E5;&#x5668;&#x90FD;&#x628A;&#x5B83;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x523A;&#x6FC0;&#xFF08;&#x8F93;&#x5165;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x523A;&#x6FC0;&#x6709;&#x4E00;&#x5B9A;&#x5F3A;&#x5EA6; $ z = &#x3B8;{_0} + &#x3B8;{_1}X{_1} + &#x3B8;{_2}X{_2} $&#xFF0C;&#x6BCF;&#x4E00;&#x9879;&#x524D;&#x9762;&#x6709;&#x4E2A;&#x6743;&#x91CD;&#xFF0C;&#x611F;&#x77E5;&#x5668;&#x5C31;&#x662F;&#x8981;&#x8BA9;&#x8FD9;&#x4E2A;&#x523A;&#x6FC0;&#x8FC7;&#x4E00;&#x4E2A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5982; $ g(z) = \frac{1}{1 + e^{-z}} $&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x4F1A;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;0&#x5230;1&#x7684;&#x6982;&#x7387;&#x503C;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x56DE;&#x5230;&#x4E86;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x505A;&#x5206;&#x7C7B;&#xFF0C;&#x53EF;&#x662F;&#x4F20;&#x7EDF;&#x6A21;&#x578B;&#x8981;&#x9762;&#x4E34;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;LR&#x8981;&#x505A;&#x9AD8;&#x6B21;&#x9879;&#x7EC4;&#x5408;&#x9879;&#xFF0C;&#x5728;&#x7EF4;&#x5EA6;&#x672C;&#x6765;&#x5C31;&#x5F88;&#x9AD8;&#x7684;&#x65F6;&#x5019;&#x5BB9;&#x6613;&#x5927;&#x5E45;&#x5EA6;&#x7EE7;&#x7EED;&#x62AC;&#x9AD8;&#x7EF4;&#x5EA6;&#x6570;&#xFF0C;SVM&#x8981;&#x52A0;&#x6838;&#x53C8;&#x6162;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x90FD;&#x5F88;&#x5206;&#x51FA;&#x201C;&#x4E24;&#x8FB9;&#x548C;&#x4E2D;&#x95F4;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x7EBF;&#x6027;&#x4E0D;&#x53EF;&#x5206;&#x95EE;&#x9898;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x5E0C;&#x671B;&#x6709;&#x4E2A;&#x65B9;&#x5F0F;&#x4E0D;&#x5173;&#x5FC3;&#x5B83;&#x7684;&#x7279;&#x5F81;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5C31;&#x80FD;&#x5206;&#x7C7B;&#x3002;</p>
<h2 id="&#x9690;&#x5C42;&#x7684;&#x4F5C;&#x7528;"><a href="#&#x9690;&#x5C42;&#x7684;&#x4F5C;&#x7528;" class="headerlink" title="&#x9690;&#x5C42;&#x7684;&#x4F5C;&#x7528;"></a>&#x9690;&#x5C42;&#x7684;&#x4F5C;&#x7528;</h2><p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8981;&#x7528;&#x591A;&#x4E2A;&#x611F;&#x77E5;&#x5668;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x7F51;&#x7EDC;&#x5F53;&#x4E2D;&#x6DFB;&#x52A0;&#x9690;&#x5C42;&#x3002;&#x53EA;&#x6709;&#x4E00;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EB;&#x6D45;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;SNN&#xFF09;&#xFF0C;&#x5C42;&#x6B21;&#x8F83;&#x591A;&#x7684;&#x53EB;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;DNN&#xFF09;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x7ECF;&#x8FC7;&#x7EC4;&#x5408;&#x540E;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x975E;&#x7EBF;&#x6027;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x4E0B;&#x4E00;&#x5C42;&#x5F53;&#x505A;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x7EBF;&#x6027;&#x4E0D;&#x53EF;&#x5206;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x60F3;&#x8BC6;&#x522B;&#x67D0;&#x4E2A;&#x70B9;&#x662F;&#x5426;&#x5728;&#x4E24;&#x6761;&#x76F4;&#x7EBF;&#x6240;&#x5939;&#x6210;&#x7684;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E24;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x9690;&#x5C42;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x5B66;&#x5F97;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x8FB9;&#x754C;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x9690;&#x5C42;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x5C06;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x7ED3;&#x679C;&#x505A;&#x6216;/&#x4E14;&#x903B;&#x8F91;&#x64CD;&#x4F5C;&#xFF0C;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x8F93;&#x51FA;&#x7ED9;&#x4E0B;&#x4E00;&#x5C42;&#x3002;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x662F;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x5404;&#x81EA;&#x7684;&#x53C2;&#x6570;&#x6743;&#x91CD;&#xFF0C;&#x6765;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x6700;&#x4F73;&#x7EC4;&#x5408;&#x6548;&#x679C;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x9690;&#x5C42;&#x4F1A;&#x5C06;&#x4E0A;&#x5C42;&#x7684;&#x7279;&#x5F81;&#x505A;&#x7EC4;&#x5408;&#xFF0C;&#x8FD9;&#x7B49;&#x4E8E;&#x5728;&#x5E2E;&#x4F60;&#x505A;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#xFF0C;&#x6765;<strong>&#x6316;&#x6398;&#x51FA;&#x90A3;&#x4E9B;&#x7EBF;&#x6027;&#x4E0D;&#x53EF;&#x5206;&#x7684;&#x9690;&#x542B;&#x7279;&#x5F81;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x5728;&#x8FD9;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x91CC;&#x53D8;&#x6210;&#x7EBF;&#x6027;&#x53EF;&#x5206;&#x7684;</strong>&#xFF01;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;/&#x6574;&#x5408;&#x8BA1;&#x7B97;.png" alt="logo"></p>
<p>&#x663E;&#x7136;&#xFF0C;LR&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x4E00;&#x4E2A;&#x65E0;&#x9690;&#x5C42;&#x7684;&#x611F;&#x77E5;&#x5668;&#xFF0C;&#x5B83;&#x5206;&#x51FA;&#x7684;&#x5F62;&#x72B6;&#x662F;&#x4E00;&#x6761;&#x7EBF;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x5F02;&#x6216;&#x7EC4;&#x5408;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6761;&#x7EBF;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x8C03;&#x6574;&#x659C;&#x7387;&#x622A;&#x8DDD;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x201C;&#x5206;&#x51FA;&#x4E24;&#x8FB9;&#x201D;&#x3002;</p>
<p>&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9690;&#x5C42;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;AND&#x548C;OR&#x903B;&#x8F91;&#x64CD;&#x4F5C;&#x6765;&#x6C47;&#x603B;&#x4E24;&#x6761;&#x51B3;&#x7B56;&#x8FB9;&#x754C;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x80FD;&#x8BC6;&#x522B;&#x4EFB;&#x4F55;&#x5F00;/&#x95ED;&#x51F8;&#x533A;&#x57DF;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x8BB2;&#xFF0C;&#x53EA;&#x8981;&#x795E;&#x7ECF;&#x5143;&#x8DB3;&#x591F;&#x591A;&#xFF0C;<strong>&#x5355;&#x9690;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C31;&#x53EF;&#x4EE5;&#x903C;&#x8FD1;&#x4EFB;&#x4F55;&#x8FDE;&#x7EED;&#x51FD;&#x6570;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x8BBA;&#x66F2;&#x7EBF;&#x591A;&#x4E48;&#x66F2;&#x6298;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x7AEF;&#x70B9;&#x8DB3;&#x591F;&#x8FD1;&#x7684;&#x7EBF;&#x6BB5;&#x7EC4;&#x5408;&#x3002;&#x66F4;&#x591A;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x4F1A;&#x589E;&#x52A0;&#x6A21;&#x578B;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x518D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9690;&#x5C42;&#x540E;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x53EF;&#x4EE5;&#x5728;AND&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x505A;OR&#xFF0C;&#x6240;&#x4EE5;<strong>&#x4E24;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x533A;&#x5206;&#x5F00;/&#x95ED;&#x51F8;&#x591A;&#x8FB9;&#x5F62;&#x7684;&#x533A;&#x57DF;</strong>&#x3002;&#x5BF9;&#x4E8E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;2&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x80FD;&#x5F97;&#x5230;&#x5F88;&#x597D;&#x7684;&#x5DE5;&#x7A0B;&#x6548;&#x679C;&#xFF0C;3&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6548;&#x679C;&#x4E5F;&#x8BB8;&#x66F4;&#x597D;&#xFF0C;&#x53EF;&#x52A0;&#x5230;&#x66F4;&#x591A;&#x5C42;&#x5219;&#x6548;&#x679C;&#x63D0;&#x5347;&#x8D8A;&#x53D1;&#x4E0D;&#x660E;&#x663E;&#xFF0C;&#x800C;&#x4E14;&#x5BB9;&#x6613;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F2;&#x76EE;&#x5730;&#x964D;&#x4F4E;&#x6A21;&#x578B;&#x7684;&#x62DF;&#x5408;&#x80FD;&#x529B;&#x3002;</p>
<h2 id="&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x548C;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;"><a href="#&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x548C;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;" class="headerlink" title="&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x548C;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;"></a>&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x548C;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;</h2><p>&#x5F53;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x7ECF;&#x8FC7;&#x611F;&#x77E5;&#x5668;&#x540E;&#xFF0C;&#x8981;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x5982;Sigmoid&#x51FD;&#x6570;&#x5904;&#x7406;&#x624D;&#x80FD;&#x5411;&#x540E;&#x8F93;&#x51FA;&#x5230;&#x4E0B;&#x4E00;&#x5C42;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x628A;&#x7ED3;&#x679C;&#x5411;&#x540E;&#x4F20;&#x5462;&#xFF1F;&#x5982;&#x679C; $ wx+b $ &#x76F4;&#x63A5;&#x5F80;&#x540E;&#x8D70;&#xFF0C;&#x6210;&#x4E3A; $ w(wx+b)+b $&#xFF0C;&#x90A3;&#x672C;&#x8D28;&#x8FD8;&#x662F; $ wx+b $ &#xFF0C;&#x9690;&#x5C42;&#x5C31;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5B9A;&#x8981;&#x7528;&#x4E00;&#x4E2A;&#x201C;&#x975E;&#x7EBF;&#x6027;&#x201D;&#x7684;&#x51FD;&#x6570;&#x6765;&#x6574;&#x5408;&#x591A;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8BAD;&#x7EC3;&#x539F;&#x7406;&#xFF0C;&#x662F;&#x7ECF;&#x8FC7;&#x591A;&#x4E2A;&#x9690;&#x5C42;&#xFF0C;&#x5C06;&#x4FE1;&#x53F7;&#x4ECE;x&#x53D8;&#x6210;o&#xFF0C;&#x8F93;&#x51FA;&#x5C42;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x7B54;&#x6848;o&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x4E9B;o&#x548C;&#x6807;&#x51C6;&#x7B54;&#x6848;d&#x6709;&#x504F;&#x5DEE;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x5B9A;&#x4E00;&#x4E2A;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E2A;&#x8BEF;&#x5DEE;&#x4ECE;&#x540E;&#x5411;&#x524D;&#x4F20;&#x9012;&#xFF0C;&#x8FFD;&#x6EAF;&#x56DE;&#x53BB;&#xFF0C;&#x6765;&#x4FEE;&#x6B63;&#x6BCF;&#x4E00;&#x5C42;&#x5404;&#x4E2A;&#x611F;&#x77E5;&#x5668;&#x7684;&#x6743;&#x91CD;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x662F;L2&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x5DEE;&#x7684;&#x5E73;&#x65B9;&#x518D;&#x5E73;&#x5747;&#xFF1A;$ E = \frac{1}{2} (d-O)^2 $<br>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x8BEF;&#x5DEE;&#x5C55;&#x5F00;&#x5230;&#x9690;&#x5C42;&#x5C31;&#x662F;&#xFF1A;$ E = \frac{1}{2} \sum{_k} [d{_k}-sigmoid(net{_k})]^2 $ &#xFF0C;&#x8FD9;&#x91CC;&#x7684;net&#x8868;&#x793A;&#x8FD9;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x5165;&#x662F;&#x524D;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x3002;<br>&#x90A3;&#x4E48;&#x518D;&#x5F80;&#x524D;&#x4F20;&#x9012;&#xFF0C;&#x76F4;&#x5230;&#x8F93;&#x5165;&#x5C42;&#xFF0C;&#x8BEF;&#x5DEE;&#x5C31;&#x53EF;&#x4EE5;&#x4E00;&#x5C42;&#x4E00;&#x5C42;&#x4EE5;&#x5D4C;&#x5957;&#x590D;&#x5408;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x5728;&#x4E60;&#x60EF;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#x90FD;&#x8BBE;&#x7F6E;&#x6210;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6BD4;&#x5982;sigmoid&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x8BEF;&#x5DEE;&#x5C55;&#x5F00;&#x5230;&#x9690;&#x5C42;&#x4E2D;&#x5B58;&#x5728;&#x4E00;&#x4E2A;sigmoid&#x9879;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x6027;&#x8D28;&#x662F;&#x63A5;&#x8FD1;1&#x7684;&#x65F6;&#x5019;&#x659C;&#x7387;&#x5F88;&#x5C0F;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x5982;&#x679C;&#x521D;&#x59CB;&#x8BEF;&#x5DEE;&#x5F88;&#x5927;&#x7684;&#x8BDD;&#xFF0C;&#x635F;&#x5931;&#x4F1A;&#x6536;&#x655B;&#x5F97;&#x5F88;&#x6162;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x8D77;&#x6765;&#x5C31;&#x4F1A;&#x5F88;&#x6162;&#xFF0C;&#x7136;&#x800C;&#x6211;&#x4EEC;&#x53C8;&#x4E0D;&#x80FD;&#x7C97;&#x66B4;&#x5730;&#x6362;&#x6389;Sigmoid&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x597D;&#x7684;&#x6570;&#x5B66;&#x6027;&#x8D28;&#xFF0C;&#x6240;&#x4EE5;&#x5E38;&#x89C1;&#x7684;&#x624B;&#x6BB5;&#x662F;<strong>&#x7528;&#x6CA1;&#x6709;Sigmoid&#x9879;&#x7684;&#x4EA4;&#x53C9;&#x71B5;&#x635F;&#x5931;&#x51FD;&#x6570;&#x66FF;&#x4EE3;L2&#x635F;&#x5931;&#x51FD;&#x6570;</strong>&#x3002;</p>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x4FEE;&#x6B63;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6743;&#x503C; $ w $&#xFF0C;&#x5C31;&#x8981;&#x7528;&#x5230;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x3002;<br>&#x5F53;&#x6BD4;&#x8F83;&#x51FA;&#x8F93;&#x51FA;&#x5C42;&#x7ED3;&#x679C;d&#x548C;o&#x7684;&#x5DEE;&#x8DDD;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x5DEE;&#x8DDD;&#x6765;&#x81EA;&#x524D;&#x9762;&#x4E00;&#x4E2A;&#x9690;&#x5C42;&#x7684;&#x6240;&#x6709;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5BF9;&#x524D;&#x4E00;&#x5C42;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x8D21;&#x732E;&#x7684;&#x6743;&#x91CD;&#x6C42;&#x504F;&#x5BFC;&#x7684;&#x65B9;&#x5F0F;&#x8FFD;&#x6EAF;&#x51FA;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x4FEE;&#x6B63;&#x503C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x66F4;&#x65B0;&#x8FD9;&#x4E2A;&#x6743;&#x91CD;&#x4E86;&#x3002;&#x7136;&#x540E;&#x518D;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x9010;&#x5C42;&#x5411;&#x524D;&#x8FFD;&#x6EAF;&#x3002;<br>&#x5F53;&#x7136;&#xFF0C;&#x8F93;&#x51FA;&#x5C42;&#xFF08;&#x540E;&#x4E00;&#x5C42;&#xFF09;&#x4E5F;&#x6709;&#x591A;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x90A3;&#x4E48;&#x540E;&#x4E00;&#x5C42;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8BEF;&#x5DEE;&#x90FD;&#x4F1A;&#x5BF9;&#x524D;&#x4E00;&#x5C42;&#x67D0;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x8BEF;&#x5DEE;&#x505A;&#x8D21;&#x732E;&#xFF0C;&#x90A3;&#x5B9E;&#x9645;&#x8FD9;&#x5C31;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x52A0;&#x6CD5;&#x590D;&#x5408;&#x51FD;&#x6570; $ f(x)+g(x) $ &#x6C42;&#x504F;&#x5BFC;&#x7684;&#x8FC7;&#x7A0B;&#x4E86;&#x3002;</p>
<h2 id="&#x8BAD;&#x7EC3;&#x4E2D;&#x7684;&#x95EE;&#x9898;"><a href="#&#x8BAD;&#x7EC3;&#x4E2D;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x8BAD;&#x7EC3;&#x4E2D;&#x7684;&#x95EE;&#x9898;"></a>&#x8BAD;&#x7EC3;&#x4E2D;&#x7684;&#x95EE;&#x9898;</h2><p>&#x6709;&#x4E9B;&#x591A;&#x5C42;&#x590D;&#x5408;&#x51FD;&#x6570;&#x7684;&#x5BFC;&#x6570;&#x7684;&#x5F62;&#x5F0F;&#x662F; $ F&#x2019; = m&#x2019; * n&#x2019; * g&#x2019; * f&#x2019; $ &#xFF0C;&#x8FD9;&#x79CD;&#x8FDE;&#x4E58;&#x5F62;&#x5F0F;&#x4EE3;&#x8868;&#x4E86;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x4F1A;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#xFF0C;&#x4E00;&#x65E6;&#x67D0;&#x4E2A;&#x503C;&#x975E;&#x5E38;&#x5927;&#x6216;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;Sigmoid&#x6C42;&#x51FA;&#x6765;&#x7684;&#x504F;&#x5BFC;&#x5C31;&#x4F1A;&#x903C;&#x8FD1;0&#xFF0C;&#x7B49;&#x4E8E;&#x68AF;&#x5EA6;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x7531;&#x4E8E;&#x6709;&#x6269;&#x6563;&#x7684;&#x6548;&#x5E94;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x56E0;&#x4E3A;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x6302;&#x4E86;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x5B66;&#x4E0D;&#x5230;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x73B0;&#x8C61;&#x53EB;&#x505A;<strong>&#x68AF;&#x5EA6;&#x6D88;&#x5931;</strong>&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x590D;&#x5408;&#x51FD;&#x6570;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x590D;&#x6742;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5F53;&#x4E2D;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x5C40;&#x90E8;&#x6700;&#x4F4E;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5DE5;&#x4E1A;&#x4E0A;&#xFF0C;&#x5E76;&#x4E0D;&#x5728;&#x610F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8D70;&#x5230;&#x5C40;&#x90E8;&#x6700;&#x4F4E;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/其他技术/不要把架构搞得太复杂/" rel="next" title="不要把架构搞得太复杂">
                <i class="fa fa-chevron-left"></i> 不要把架构搞得太复杂
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/其他技术/关于是否应该使用MySQL外键的思考/" rel="prev" title="关于是否应该使用MySQL外键的思考">
                关于是否应该使用MySQL外键的思考 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/icon.jpeg"
               alt="アカリ" />
          <p class="site-author-name" itemprop="name">アカリ</p>
          <p class="site-description motion-element" itemprop="description">很羡慕工作后辞职读研的人，能腾出一两年的大片时间来专心学习某个自己喜欢的领域的知识技能其实是一件非常幸福的事……</p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/">
                <span class="site-state-item-count">18</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#神经网络结构"><span class="nav-number">1.</span> <span class="nav-text">神经网络结构</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#隐层的作用"><span class="nav-number">2.</span> <span class="nav-text">隐层的作用</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#激活函数和训练方法"><span class="nav-number">3.</span> <span class="nav-text">激活函数和训练方法</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#训练中的问题"><span class="nav-number">4.</span> <span class="nav-text">训练中的问题</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">アカリ</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	





  




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=default"></script>
  


  

  

  


</body>
</html>
