<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="只有数据和机器学习模型理论是不好使的，我们要知道究竟选什么样的模型、选什么样的特征、选什么样的参数才能达到最佳的学习效果。">
<meta property="og:type" content="article">
<meta property="og:title" content="模型调试与集成学习">
<meta property="og:url" content="http://yoursite.com/机器学习/模型调试与集成学习/index.html">
<meta property="og:site_name" content="Akali's Room">
<meta property="og:description" content="只有数据和机器学习模型理论是不好使的，我们要知道究竟选什么样的模型、选什么样的特征、选什么样的参数才能达到最佳的学习效果。">
<meta property="og:image" content="http://yoursite.com/机器学习/模型调试与集成学习/机器学习模型.jpg">
<meta property="og:image" content="http://yoursite.com/机器学习/模型调试与集成学习/恰当的拟合状况.png">
<meta property="og:image" content="http://yoursite.com/机器学习/模型调试与集成学习/欠拟合和过拟合.png">
<meta property="og:image" content="http://yoursite.com/机器学习/模型调试与集成学习/Boosting学习过程.png">
<meta property="og:image" content="http://yoursite.com/机器学习/模型调试与集成学习/Boosting融合结果.png">
<meta property="og:image" content="http://yoursite.com/机器学习/模型调试与集成学习/残差学习.png">
<meta property="og:updated_time" content="2017-03-11T10:05:54.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="模型调试与集成学习">
<meta name="twitter:description" content="只有数据和机器学习模型理论是不好使的，我们要知道究竟选什么样的模型、选什么样的特征、选什么样的参数才能达到最佳的学习效果。">
<meta name="twitter:image" content="http://yoursite.com/机器学习/模型调试与集成学习/机器学习模型.jpg">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/机器学习/模型调试与集成学习/"/>





  <title> 模型调试与集成学习 | Akali's Room </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Akali's Room</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <p class="site-subtitle"></p>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-links">
          <a href="/links" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-question-circle"></i> <br />
            
            友链
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/机器学习/模型调试与集成学习/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="アカリ">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/icon.jpeg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Akali's Room">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Akali's Room" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                模型调试与集成学习
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-02-28T21:00:00+08:00">
                2017-02-28
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/机器学习/" itemprop="url" rel="index">
                    <span itemprop="name">机器学习</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          
              <div class="post-description">
                  只有数据和机器学习模型理论是不好使的，我们要知道究竟选什么样的模型、选什么样的特征、选什么样的参数才能达到最佳的学习效果。
              </div>
          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x6A21;&#x578B;&#x9009;&#x62E9;"><a href="#&#x6A21;&#x578B;&#x9009;&#x62E9;" class="headerlink" title="&#x6A21;&#x578B;&#x9009;&#x62E9;"></a>&#x6A21;&#x578B;&#x9009;&#x62E9;</h2><p>&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x3001;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x3001;&#x51B3;&#x7B56;&#x6811;&#x548C;SVM&#x7684;&#x5177;&#x4F53;&#x7B97;&#x6CD5;&#xFF0C;&#x6B64;&#x5916;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x6A21;&#x578B;&#x6765;&#x89E3;&#x51B3;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x5728;sklearn&#x5E93;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x5F20;&#x7ECF;&#x5178;&#x7684;&#x6A21;&#x578B;&#x9009;&#x62E9;&#x53C2;&#x8003;&#x56FE;&#xFF1A;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x6A21;&#x578B;&#x8C03;&#x8BD5;&#x4E0E;&#x96C6;&#x6210;&#x5B66;&#x4E60;/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;.jpg" alt="logo"></p>
<p>&#x4E0B;&#x9762;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x8FD9;&#x5F20;&#x56FE;&#xFF1A;<br>1.&#x9996;&#x5148;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6765;&#x641E;&#x3002;&#x4E4B;&#x540E;&#x5C31;&#x8981;&#x770B;&#x81EA;&#x5DF1;&#x8981;&#x505A;&#x7684;&#x4EFB;&#x52A1;&#x7684;&#x76EE;&#x7684;&#x9009;&#x62E9;&#x6A21;&#x578B;&#x56E2;&#x3002;<br>2.&#x5982;&#x679C;&#x505A;&#x4E8C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x5224;&#x5B9A;&#x662F;&#x732B;&#x8FD8;&#x662F;&#x72D7;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x79BB;&#x6563;&#x503C;&#xFF0C;&#x5C31;&#x5C5E;&#x4E8E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8005;&#x5C5E;&#x4E8E;&#x7ED9;&#x6570;&#x636E;&#x6253;&#x6807;&#x7B7E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8D70;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;classification&#x3002;<br>3.&#x5982;&#x679C;&#x573A;&#x666F;&#x662F;&#x7535;&#x5546;&#x5F53;&#x4E2D;&#x3001;&#x4E0D;&#x53EF;&#x80FD;&#x4ECE;&#x5355;&#x4E00;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x4E00;&#x4E9B;&#x89C4;&#x5F8B;&#xFF0C;&#x9700;&#x8981;&#x4ECE;&#x201C;&#x5241;&#x624B;&#x515A;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x5171;&#x6027;&#x7FA4;&#x7EC4;&#x91CC;&#x627E;&#x89C4;&#x5F8B;&#xFF0C;&#x90A3;&#x4E48;&#x89E3;&#x51B3;&#x5982;&#x4F55;&#x628A;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x805A;&#x6210;&#x4E00;&#x7C7B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x805A;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x8D70;&#x5DE6;&#x4E0B;&#x89D2;&#x7684;clustering&#x3002;<br>4.&#x5982;&#x679C;&#x8981;&#x9884;&#x6D4B;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x5C06;&#x6765;&#x7684;&#x623F;&#x4EF7;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x503C;&#xFF0C;&#x5C31;&#x662F;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#xFF0C;&#x8D70;&#x53F3;&#x4E0A;&#x89D2;&#x7684;regression&#x3002;<br>5.&#x53F3;&#x4E0B;&#x89D2;&#x7684;dimensionality reducting&#x7684;&#x76EE;&#x7684;&#x662F;&#x8981;&#x628A;&#x5F88;&#x9AD8;&#x7684;&#x7EF4;&#x5EA6;&#x7684;&#x6570;&#x636E;&#x964D;&#x4F4E;&#x5230;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x548C;&#x6613;&#x4E8E;&#x8BA1;&#x7B97;&#x7684;&#x4F4E;&#x7EF4;&#x5EA6;&#x3002;</p>
<p>&#x8FD9;&#x5F20;&#x56FE;&#x7684;&#x4E0A;&#x9762;&#x4E24;&#x56E2;&#x7B97;&#x6CD5;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x7B54;&#x6848;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x662F;&#x6709;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x3002;<br>&#x800C;&#x4E0B;&#x9762;&#x4E24;&#x56E2;&#x7B97;&#x6CD5;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7B54;&#x6848;&#xFF0C;&#x662F;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x3002;</p>
<h2 id="&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x63CF;&#x8FF0;&#x62DF;&#x5408;&#x6548;&#x679C;"><a href="#&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x63CF;&#x8FF0;&#x62DF;&#x5408;&#x6548;&#x679C;" class="headerlink" title="&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x63CF;&#x8FF0;&#x62DF;&#x5408;&#x6548;&#x679C;"></a>&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x63CF;&#x8FF0;&#x62DF;&#x5408;&#x6548;&#x679C;</h2><p>&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x6548;&#x679C;&#x662F;&#x8FC7;&#x62DF;&#x5408;&#x8FD8;&#x662F;&#x6B20;&#x62DF;&#x5408;&#x662F;&#x53EF;&#x4EE5;&#x5229;&#x7528;<strong>&#x5B66;&#x4E60;&#x66F2;&#x7EBF;</strong>&#x53EF;&#x89C6;&#x5316;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x62DF;&#x5408;&#x7A0B;&#x5EA6;&#x6BD4;&#x8F83;&#x6070;&#x5F53;&#x7684;&#x6A21;&#x578B;&#x7684;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x5927;&#x6982;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x6A21;&#x578B;&#x8C03;&#x8BD5;&#x4E0E;&#x96C6;&#x6210;&#x5B66;&#x4E60;/&#x6070;&#x5F53;&#x7684;&#x62DF;&#x5408;&#x72B6;&#x51B5;.png" alt="logo"></p>
<p>&#x8FD9;&#x6761;&#x66F2;&#x7EBF;&#x5E76;&#x4E0D;&#x662F;&#x5E73;&#x6ED1;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4F53;&#x8D8B;&#x52BF;&#x662F;&#x5411;&#x4E2D;&#x95F4;&#x6536;&#x655B;&#x7684;&#xFF0C;&#x56FE;&#x7684;&#x6A2A;&#x5750;&#x6807;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x6837;&#x672C;&#x91CF;&#xFF0C;&#x7EB5;&#x5750;&#x6807;&#x662F;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x66F2;&#x7EBF;&#x8868;&#x793A;&#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x4E0B;&#x9762;&#x4F60;&#x7684;&#x66F2;&#x7EBF;&#x8868;&#x793A;&#x9A8C;&#x8BC1;&#x96C6;&#x7684;&#x51C6;&#x786E;&#x7387;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x66F2;&#x7EBF;&#x8868;&#x793A;&#xFF0C;&#x968F;&#x7740;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x76EE;&#x7684;&#x589E;&#x591A;&#xFF0C;&#x5B66;&#x51FA;&#x7684;&#x6A21;&#x578B;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x7CBE;&#x5EA6;&#x662F;&#x9010;&#x6B65;&#x4E0B;&#x964D;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E24;&#x4E09;&#x4E2A;&#x6570;&#x636E;&#x505A;&#x8BAD;&#x7EC3;&#xFF0C;&#x90A3;&#x4E48;&#x5F97;&#x5230;&#x7684;&#x6A21;&#x578B;&#x5F88;&#x5BB9;&#x6613;cover&#x4F4F;&#x8FD9;&#x51E0;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x662F;&#x6570;&#x636E;&#x591A;&#x4E86;&#xFF0C;&#x5C31;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x5B66;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x76F4;&#x7EBF;&#x5BB9;&#x6613;&#x7A7F;&#x8FC7;&#x4E24;&#x4E2A;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x96BE;&#x7A7F;&#x8FC7;1000&#x4E2A;&#x70B9;&#x3002;<br>&#x4E0B;&#x9762;&#x7684;&#x66F2;&#x7EBF;&#x8868;&#x793A;&#xFF0C;&#x968F;&#x7740;&#x8BAD;&#x7EC3;&#x96C6;&#x6570;&#x76EE;&#x7684;&#x589E;&#x591A;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x6A21;&#x578B;&#x8D8A;&#x6765;&#x8D8A;&#x7CBE;&#x51C6;&#xFF0C;&#x5728;&#x9A8C;&#x8BC1;&#x96C6;&#x4E0A;&#x505A;&#x5F97;&#x7684;&#x51C6;&#x786E;&#x7387;&#x5C31;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x3002;<br>&#x4E2D;&#x95F4;&#x7684;&#x6A2A;&#x7EBF;&#x662F;&#x6211;&#x4EEC;&#x671F;&#x5F85;&#x7684;&#x4E00;&#x4E2A;&#x51C6;&#x786E;&#x7387;&#xFF08;&#x6307;&#x6807;&#x53EB;AUC&#xFF09;&#xFF0C;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x51C6;&#x786E;&#x7387;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x8003;&#xFF0C;&#x662F;&#x5F97;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x767E;&#x5EA6;&#x6216;&#x8C37;&#x6B4C;&#x53EF;&#x80FD;&#x662F;90%&#x3002;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x6A21;&#x578B;&#x8C03;&#x8BD5;&#x4E0E;&#x96C6;&#x6210;&#x5B66;&#x4E60;/&#x6B20;&#x62DF;&#x5408;&#x548C;&#x8FC7;&#x62DF;&#x5408;.png" alt="logo"></p>
<p>&#x4E0A;&#x56FE;&#x4E2D;&#x5DE6;&#x4FA7;&#x8868;&#x793A;&#x6B20;&#x62DF;&#x5408;&#xFF0C;&#x8FD9;&#x79CD;&#x66F2;&#x7EBF;&#x7684;&#x7279;&#x6027;&#x662F;&#xFF0C;&#x4E24;&#x6761;&#x66F2;&#x7EBF;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x5F88;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#x6536;&#x655B;&#x5C31;&#x6BD4;&#x8F83;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x8BBA;&#x54EA;&#x6761;&#x66F2;&#x7EBF;&#x7684;&#x5206;&#x6570;&#x90FD;&#x6BD4;&#x8F83;&#x4F4E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x7684;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x5F88;&#x4F4E;&#xFF0C;&#x8FBE;&#x4E0D;&#x5230;&#x8981;&#x6C42;&#x3002;<br>&#x53F3;&#x8FB9;&#x7684;&#x66F2;&#x7EBF;&#x8868;&#x793A;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x8F83;&#x5927;&#x7684;&#x65F6;&#x5019;&#x4E0A;&#x9762;&#x7684;&#x8BAD;&#x7EC3;&#x66F2;&#x7EBF;&#x7684;&#x5206;&#x6570;&#x6BD4;&#x671F;&#x5F85;&#x7684;&#x7EA2;&#x7EBF;&#x8FD8;&#x8981;&#x9AD8;&#x51FA;&#x4E00;&#x622A;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x6821;&#x9A8C;&#x96C6;&#x5F53;&#x4E2D;&#x7684;&#x7ED3;&#x679C;&#x5E76;&#x4E0D;&#x597D;&#xFF0C;&#x4E8C;&#x8005;&#x5DEE;&#x503C;&#x5F88;&#x5927;&#xFF0C;&#x8BF4;&#x660E;&#x5B83;&#x53BB;&#x201C;&#x80CC;&#x4E66;&#x201D;&#x4E86;&#x3002;<br>&#x800C;&#x53EA;&#x6709;&#x5728;&#x4E24;&#x4E2A;&#x96C6;&#x5408;&#x4E0A;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x4E00;&#x81F4;&#x7684;&#x51C6;&#x786E;&#x7387;&#x65F6;&#xFF0C;&#x624D;&#x80FD;&#x8BF4;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x7406;&#x60F3;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x627E;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x8BA9;&#x5B83;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x201C;&#x8BB0;&#x4F4F;&#x201D;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x6B63;&#x5219;&#x5316;&#x7CFB;&#x6570;&#x524A;&#x5F31;&#x9AD8;&#x7EA7;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x3002;&#x964D;&#x7EF4;&#x662F;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x6BD4;&#x8F83;&#x5C11;&#x7684;&#x6B20;&#x62DF;&#x5408;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x627E;&#x66F4;&#x591A;&#x7279;&#x6027;&#x6765;&#x66F4;&#x6709;&#x6548;&#x5730;&#x63CF;&#x8FF0;&#x6A21;&#x578B;&#xFF0C;&#x6216;&#x8005;&#x51CF;&#x5C0F;&#x6B63;&#x5219;&#x5316;&#x7CFB;&#x6570;&#x3002;</p>
<h2 id="&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;"><a href="#&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;" class="headerlink" title="&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;"></a>&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;</h2><p>&#x5728;&#x4E4B;&#x524D;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x63D0;&#x53CA;&#x4E86;&#x6A21;&#x578B;&#x5F53;&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#x6B63;&#x5219;&#x5316;&#x9879;&#x7684;&#x53C2;&#x6570;&#x9009;&#x591A;&#x5C11;&#x3001;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x7A76;&#x7ADF;&#x9009;&#x51E0;&#x6B21;&#x65B9;&#x3001;SVM&#x7A76;&#x7ADF;&#x9009;&#x4EC0;&#x4E48;&#x6838;&#x7B49;&#xFF0C;&#x5982;&#x679C;&#x9009;&#x62E9;&#x4E0D;&#x5F53;&#x5219;&#x4F1A;&#x9020;&#x6210;&#x6B20;&#x62DF;&#x5408;&#x548C;&#x8FC7;&#x62DF;&#x5408;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x6A21;&#x578B;&#x672C;&#x8EAB;&#x7684;&#x9009;&#x62E9;&#x4E0D;&#x5F53;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x6548;&#x679C;&#x7406;&#x60F3;&#xFF0C;&#x6BD4;&#x5982;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x548C;SVM&#x5728;&#x51C6;&#x786E;&#x6027;&#x4E0A;&#x5C31;&#x662F;&#x6709;&#x5DEE;&#x5F02;&#x7684;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x79CD;&#x60EF;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x628A;&#x6570;&#x636E;&#x6309;&#x6BD4;&#x4F8B;&#x62C6;&#x5206;&#x6210;<strong>&#x8BAD;&#x7EC3;&#x96C6;</strong>&#x3001;<strong>&#x9A8C;&#x8BC1;&#x96C6;</strong>&#x3001;<strong>&#x6D4B;&#x8BD5;&#x96C6;</strong>&#x4E09;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x770B;&#x4EC0;&#x4E48;&#x53C2;&#x6570;&#x5408;&#x9002;&#xFF0C;&#x5C31;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x8BAD;&#x7EC3;&#x4E0D;&#x540C;&#x53C2;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FC7;&#x9A8C;&#x8BC1;&#x96C6;&#xFF0C;&#x8C03;&#x6574;&#x51FA;&#x6BCF;&#x4E2A;&#x7B97;&#x6CD5;&#x6A21;&#x578B;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x53C2;&#x6570;&#x540E;&#xFF0C;&#x518D;&#x62FF;&#x4E0D;&#x540C;&#x7B97;&#x6CD5;&#x7684;&#x6210;&#x7EE9;&#x4F5C;&#x6BD4;&#x8F83;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EB;<strong>&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;</strong>&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x5751;&#xFF0C;&#x6309;&#x6BD4;&#x4F8B;&#x5206;&#x5272;&#x8BAD;&#x7EC3;&#x96C6;&#x3001;&#x6821;&#x9A8C;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x65E0;&#x6CD5;&#x5B8C;&#x5168;&#x4FDD;&#x8BC1;&#x4EE5;&#x524D;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x9A8C;&#x8BC1;&#x96C6;&#x5F53;&#x4E2D;&#x6709;&#x4E9B;&#x7279;&#x6027;&#x662F;&#x8BAD;&#x7EC3;&#x96C6;&#x5F53;&#x4E2D;&#x6839;&#x672C;&#x6CA1;&#x5B66;&#x8FC7;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x5207;&#x5206;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p><strong>k&#x6298;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;</strong>&#xFF0C;&#x5B83;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x628A;&#x8BAD;&#x7EC3;&#x96C6;&#x62C6;&#x6210;k&#x4EFD;&#xFF0C;&#x5982;5&#x4EFD;&#xFF0C;&#x7136;&#x540E;&#x7528;4&#x4EFD;&#x505A;&#x8BAD;&#x7EC3;&#xFF0C;&#x6700;&#x540E;1&#x4EFD;&#x6700;&#x9A8C;&#x8BC1;&#xFF0C;&#x53CD;&#x590D;5&#x6B21;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x5F97;&#x5230;5&#x4E2A;&#x9A8C;&#x8BC1;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x540E;&#x5E73;&#x5747;5&#x4E2A;&#x8BC4;&#x4F30;&#x7ED3;&#x679C;&#x7684;&#x5F97;&#x5206;&#x3002;&#x5728;&#x5DE5;&#x4E1A;&#x4E0A;&#x4E60;&#x60EF;&#x5206;&#x5230;3&#x6298;&#x6216;5&#x6298;&#xFF0C;&#x6570;&#x636E;&#x8DB3;&#x591F;&#x5927;&#x5C31;&#x5206;&#x6210;10&#x6298;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x89C2;&#x5BDF;&#x5230;&#x5206;&#x6210;&#x51E0;&#x6298;&#x7684;&#x7ED3;&#x679C;&#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F;&#x8FD9;&#x79CD;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x65B9;&#x5F0F;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x5F88;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4F01;&#x4E1A;&#x90FD;&#x4F1A;&#x7528;&#x3002;</p>
<h2 id="&#x96C6;&#x6210;&#x5B66;&#x4E60;"><a href="#&#x96C6;&#x6210;&#x5B66;&#x4E60;" class="headerlink" title="&#x96C6;&#x6210;&#x5B66;&#x4E60;"></a>&#x96C6;&#x6210;&#x5B66;&#x4E60;</h2><p>&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x4E5F;&#x53EB;&#x6A21;&#x578B;&#x878D;&#x5408;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x7EC4;Individual Learner&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x5982;&#x679C;Individual Learner&#x540C;&#x8D28;&#xFF08;&#x6BD4;&#x5982;&#x90FD;&#x662F;&#x6811;&#x7ED3;&#x6784;&#xFF09;&#xFF0C;&#x79F0;&#x4E3A;base learner&#xFF0C;&#x5982;&#x679C;&#x5F02;&#x8D28;&#xFF08;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x6811;&#x4E00;&#x4E2A;LR&#xFF09;&#xFF0C;&#x5219;&#x79F0;&#x4E3A;component learner&#x3002;</p>
<p>&#x6A21;&#x578B;&#x878D;&#x5408;<strong>&#x6709;&#x53EF;&#x80FD;</strong>&#x83B7;&#x5F97;&#x6BD4;&#x5355;&#x4E2A;&#x6A21;&#x578B;&#x5F97;&#x5230;&#x7684;&#x6548;&#x679C;&#x66F4;&#x597D;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5F88;&#x591A;&#x6A21;&#x578B;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x51F8;&#x51FD;&#x6570;&#x6027;&#x8D28;&#x672A;&#x5FC5;&#x5F88;&#x597D;&#xFF0C;&#x53EF;&#x80FD;&#x53EA;&#x80FD;&#x8D70;&#x5230;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x7684;&#x6700;&#x4F4E;&#x70B9;&#xFF0C;&#x800C;&#x4E14;&#x4F18;&#x5316;&#x7684;&#x8DEF;&#x5F84;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x4E0D;&#x540C;&#x6A21;&#x578B;&#x7684;&#x7ED3;&#x679C;&#x53D6;&#x4E2A;&#x5E73;&#x5747;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6709;&#x66F4;&#x5927;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x66F4;&#x903C;&#x8FD1;&#x5168;&#x5C40;&#x6700;&#x4F4E;&#x70B9;&#x3002;&#x4F46;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x6570;&#x636E;&#x6BD4;&#x8D5B;&#x4E0A;&#x878D;&#x5408;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x53EA;&#x80FD;&#x63D0;&#x9AD8;2%&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5DE5;&#x4E1A;&#x754C;&#x7528;&#x7684;&#x4E0D;&#x591A;&#x3002;&#x6709;&#x4E00;&#x4E9B;&#x5957;&#x8DEF;&#x6765;&#x878D;&#x5408;&#x591A;&#x4E2A;&#x6A21;&#x578B;&#xFF1A;</p>
<h2 id="Bagging"><a href="#Bagging" class="headerlink" title="Bagging"></a>Bagging</h2><p><strong>Bagging&#x7B97;&#x6CD5;&#x6846;&#x67B6;</strong>&#x6307;&#x628A;&#x8BAD;&#x7EC3;&#x96C6;&#x5207;&#x6210;&#x591A;&#x4EFD;&#xFF0C;&#x6784;&#x5EFA;&#x591A;&#x4E2A;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x6BCF;&#x4E2A;&#x51B3;&#x7B56;&#x6811;&#x53EF;&#x6709;&#x91CD;&#x590D;&#x5730;&#x5B66;&#x4E60;&#x5176;&#x4E2D;&#x7684;&#x51E0;&#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x6D4B;&#x8BD5;&#x96C6;&#x53BB;&#x8DD1;&#x6BCF;&#x4E2A;&#x6811;&#xFF0C;&#x6700;&#x540E;&#x5982;&#x679C;&#x505A;&#x5206;&#x7C7B;&#xFF0C;&#x5C31;&#x62FF;&#x591A;&#x4E2A;&#x6811;&#x7684;&#x7ED3;&#x679C;&#x6295;&#x7968;&#xFF0C;&#x5982;&#x679C;&#x505A;&#x56DE;&#x5F52;&#xFF0C;&#x5C31;&#x53D6;&#x5E73;&#x5747;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x9002;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x5982;&#x679C;&#x8BA9;&#x6BCF;&#x4E2A;&#x6811;&#x53BB;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x96C6;&#x5F53;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5C31;&#x9632;&#x6B62;&#x4E86;&#x6240;&#x6709;&#x7684;&#x6811;&#x90FD;&#x80FD;&#x5B66;&#x5230;&#x566A;&#x58F0;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x5C31;&#x964D;&#x4F4E;&#x4E86;&#x53D1;&#x751F;&#x8BEF;&#x5224;&#x7684;&#x6982;&#x7387;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x5B83;&#x4E3B;&#x8981;&#x89E3;&#x51B3;<strong>&#x8FC7;&#x62DF;&#x5408;&#x95EE;&#x9898;</strong>&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6709;bug&#xFF0C;&#x5982;&#x679C;&#x5B66;&#x4E60;&#x7EF4;&#x5EA6;&#x9009;&#x5F97;&#x4E0D;&#x597D;&#xFF0C;&#x6DF7;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x4F1A;&#x8BA9;&#x4F60;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x5E9F;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x65E5;&#x671F;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x5C31;&#x4F1A;&#x88AB;&#x6DF7;&#x5165;&#x6240;&#x6709;&#x7684;&#x6811;&#x4E2D;&#x3002;</p>
<p><strong>&#x968F;&#x673A;&#x68EE;&#x6797;</strong>&#x5219;&#x7279;&#x6307;&#x628A;&#x51B3;&#x7B56;&#x6811;&#x7528;&#x5728;Bagging&#x7B97;&#x6CD5;&#x6846;&#x67B6;&#x4E0A;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x68F5;&#x6811;&#x53EA;&#x9009;&#x62E9;&#x81EA;&#x5DF1;&#x8BAD;&#x7EC3;&#x96C6;&#x5F53;&#x4E2D;&#x7684;&#x968F;&#x673A;&#x51E0;&#x4E2A;&#x5C5E;&#x6027;&#x505A;&#x8BAD;&#x7EC3;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x6BCF;&#x68F5;&#x6811;&#x90FD;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x6709;&#x9650;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x5C31;&#x907F;&#x514D;&#x4E86;Bagging&#x7684;bug&#xFF0C;&#x5982;&#x679C;&#x6811;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x8BDD;&#xFF0C;&#x663E;&#x7136;&#x6240;&#x6709;&#x5C5E;&#x6027;&#x90FD;&#x80FD;&#x88AB;cover&#x6389;&#xFF0C;&#x6BCF;&#x4E2A;&#x6811;&#x5BF9;&#x5B83;&#x81EA;&#x5DF1;&#x80FD;&#x770B;&#x5230;&#x7684;&#x90A3;&#x51E0;&#x4E2A;&#x5C5E;&#x6027;&#x7684;&#x5206;&#x7C7B;&#x80FD;&#x529B;&#x4E5F;&#x5C31;&#x4F1A;&#x5F88;&#x5F3A;&#xFF0C;&#x7EC4;&#x5408;&#x51FA;&#x6765;&#x7684;&#x6548;&#x679C;&#x5C31;&#x66F4;&#x597D;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x80FD;&#x964D;&#x4F4E;&#x5E9F;&#x7EF4;&#x5EA6;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<h2 id="Boosting"><a href="#Boosting" class="headerlink" title="Boosting"></a>Boosting</h2><p><strong>Boosting&#x7B97;&#x6CD5;&#x6846;&#x67B6;</strong>&#x662F;&#x4E00;&#x79CD;&#x7EBF;&#x6027;&#x8FED;&#x4EE3;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x89E3;&#x51B3;<strong>&#x5B66;&#x4E60;&#x5668;&#x80FD;&#x529B;&#x8FC7;&#x5F31;&#x65F6;&#x7684;&#x6B20;&#x62DF;&#x5408;&#x95EE;&#x9898;</strong>&#xFF0C;&#x5148;&#x628A;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x505A;&#x5206;&#x7C7B;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6811;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x88AB;&#x5F88;&#x597D;&#x5730;&#x5206;&#x7C7B;&#xFF0C;&#x5931;&#x8BEF;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x4E4B;&#x540E;&#x628A;&#x8FD9;&#x4E9B;&#x5931;&#x8BEF;&#x6570;&#x636E;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x518D;&#x53BB;&#x91CD;&#x65B0;&#x5B66;&#x4E60;&#xFF0C;&#x505A;&#x4E0B;&#x4E00;&#x6B65;&#x5206;&#x7C7B;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x6811;&#x3002;&#x8FD9;&#x6837;&#x8FED;&#x4EE3;&#x4E0B;&#x53BB;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6811;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x4F1A;&#x901A;&#x8FC7;&#x52A0;&#x6743;&#x7EC4;&#x5408;&#x7684;&#x673A;&#x5236;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x6811;&#x3002;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x6A21;&#x578B;&#x8C03;&#x8BD5;&#x4E0E;&#x96C6;&#x6210;&#x5B66;&#x4E60;/Boosting&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;.png" alt="logo"></p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x6A21;&#x578B;&#x8C03;&#x8BD5;&#x4E0E;&#x96C6;&#x6210;&#x5B66;&#x4E60;/Boosting&#x878D;&#x5408;&#x7ED3;&#x679C;.png" alt="logo"></p>
<p>&#x4F8B;&#x5982;&#xFF0C;<strong>AdaBoost</strong>&#x662F;&#x4E00;&#x79CD;&#x5177;&#x4F53;&#x7684;Boosting&#x7B97;&#x6CD5;&#xFF0C;&#x9996;&#x5148;&#x628A;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x6837;&#x672C;&#x8D4B;&#x4E88;&#x76F8;&#x540C;&#x7684;&#x6743;&#x91CD; $ 1/N $ &#xFF0C;&#x7528; $ m $ &#x8868;&#x793A;&#x8FED;&#x4EE3;&#x8F6E;&#x6B21;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528;&#x6743;&#x503C;&#x5206;&#x5E03; $ Dm $ &#x7684;&#x5206;&#x7C7B;&#x5668;&#x6765;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x5206;&#x7C7B;&#x5668; $ G{_m} $&#xFF0C; &#x7136;&#x540E;&#x8BA1;&#x7B97;&#x8BEF;&#x5DEE;&#x7387; $ e{_m} = \sum_{i=1}^N w{_m}{_i}I(G{_m}(x{_i})&#x2260;y) $ &#xFF0C;&#x4E4B;&#x540E;&#x8BA1;&#x7B97; $ a{_m} = \frac{1}{2} log \frac{1-e{_m}}{e{_m}} $&#xFF0C; &#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x610F;&#x5473;&#x7740;&#x5206;&#x7C7B;&#x7684;&#x8BEF;&#x5DEE;&#x7387;&#x8D8A;&#x5C0F;&#xFF0C;&#x8FD9;&#x6B21;&#x65B0;&#x7684;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#x5728;&#x6700;&#x7EC8;&#x5206;&#x7C7B;&#x6295;&#x7968;&#x65F6;&#x7684;&#x4F5C;&#x7528;&#x4F1A;&#x8D8A;&#x5927;&#x3002;&#x6700;&#x540E;&#x66F4;&#x65B0;&#x6743;&#x503C;&#x5206;&#x5E03;&#xFF0C;&#x4F7F;&#x9519;&#x8BEF;&#x7387;&#x9AD8;&#x7684;&#x6570;&#x636E;&#x7684;&#x660E;&#x663E;&#x6027;&#x589E;&#x5927;&#xFF0C; $ D{_m}{_+}{_1} = \frac {w{_m}{_i}}{Z{_m}} exp (-&#x3B1;{_m}y{_iG{_m}(x{_i})})$ &#xFF0C;&#x5176;&#x4E2D;&#x89C4;&#x8303;&#x5316;&#x56E0;&#x5B50; $ Z{_m} = \sum_{i=1}^N exp (-&#x3B1;{_m}y{_iG{_m}(x{_i})}) $ &#x4F7F;&#x5F97;&#x4E0B;&#x4E00;&#x8F6E;&#x7684; $ Dm+1 $ &#x6210;&#x4E3A;&#x9AD8;&#x65AF;&#x5206;&#x5E03;&#x3002;&#x6700;&#x540E;&#x7EC4;&#x5408;&#x5404;&#x4E2A;&#x5F31;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5F97;&#x5230; $ G(x) = sign(\sum_{m=1}^M&#x3B1;{_m}G{_m}(x)) $&#xFF0C; &#x5176;&#x4E2D; $ sign $ &#x8868;&#x793A;&#x5927;&#x4E8E;0&#x8F93;&#x51FA;1&#xFF0C;&#x5C0F;&#x4E8E;0&#x8F93;&#x51FA;0&#x3002;</p>
<p><strong>GBDT&#x7B97;&#x6CD5;</strong>&#x548C;AdaBoost&#x7684;&#x9519;&#x8BEF;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;Ada&#x7B97;&#x6CD5;&#x53EA;&#x662F;&#x5355;&#x7EAF;&#x7684; $ I(G{_m}(x{_i})&#x2260;y) $&#xFF0C;&#x800C;&#x53EF;&#x4EE5;&#x6539;&#x6210;&#x65B9;&#x5DEE;&#x7B49;&#x5176;&#x4ED6;&#x7EBF;&#x6027;&#x65B9;&#x7A0B;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x53E6;&#x5916;Ada&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x7ED9;&#x9519;&#x8BEF;&#x7ED3;&#x679C;&#x91CD;&#x65B0;&#x52A0;&#x6743;&#x503C;&#xFF0C;&#x800C;GBDT&#x5219;&#x662F;&#x4EE5;&#x6B8B;&#x5DEE;&#x4F5C;&#x4E3A;&#x5B66;&#x4E60;&#x76EE;&#x6807;&#xFF0C;&#x5BF9;&#x4E8E;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#xFF0C;&#x5148;&#x7B97;&#x5F97;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x7B97;&#x5F97;&#x548C;&#x76EE;&#x6807;&#x503C;&#x7684;&#x6B8B;&#x5DEE;&#xFF08;&#x53EF;&#x4EE5;&#x505A;&#x51CF;&#x6CD5;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#xFF09;&#xFF0C;&#x5F97;&#x5230;&#x65B0;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4E4B;&#x540E;&#x5BF9;&#x6B8B;&#x5DEE;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#xFF0C;&#x627E;&#x5230;&#x65B0;&#x7684;&#x5206;&#x5272;&#x9608;&#x503C;&#xFF0C;&#x628A;&#x7ED3;&#x679C;&#x53E0;&#x52A0;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x7ED3;&#x679C;&#x4E0A;&#xFF0C;&#x5982;&#x6B64;&#x53CD;&#x590D;&#x4E0B;&#x53BB;&#x3002;</p>
<p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;/&#x6A21;&#x578B;&#x8C03;&#x8BD5;&#x4E0E;&#x96C6;&#x6210;&#x5B66;&#x4E60;/&#x6B8B;&#x5DEE;&#x5B66;&#x4E60;.png" alt="logo"></p>
<p>&#x76EE;&#x524D;&#x51C6;&#x786E;&#x7387;&#x6700;&#x9AD8;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x6027;&#x80FD;&#x6700;&#x597D;&#x3001;&#x7528;&#x9014;&#x6700;&#x5E7F;&#x7684;&#x5E93;&#x662F;<strong>XGBoost</strong>&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x52A0;&#x5165;L1 L2 Regularization&#x9879;&#x6253;&#x504F;&#x6BCF;&#x6B21;&#x7684;&#x5B66;&#x4E60;&#x7ED3;&#x679C;&#x6765;&#x6700;&#x5927;&#x5316;&#x5730;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<h2 id="Stacking"><a href="#Stacking" class="headerlink" title="Stacking"></a>Stacking</h2><p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x5957;&#x8DEF;&#x53EB;<strong>Stacking</strong>&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x7528;LR&#x3001;DT&#x3001;SVM&#x7B97;&#x51FA;&#x6765;&#x4E09;&#x5957;&#x6A21;&#x578B;&#xFF0C;&#x628A;&#x8FD9;&#x4E09;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x8F93;&#x51FA;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5728;&#x5176;&#x4E2D;&#x53EF;&#x4EE5;&#x505A;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x5B66;&#x5230;&#x6743;&#x91CD;&#x6765;&#x6574;&#x5408;&#x4E09;&#x5957;&#x6A21;&#x578B;&#x7684;&#x5B66;&#x4E60;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x53E0;&#x52A0;&#x4F1A;&#x6709;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x98CE;&#x9669;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/机器学习/支持向量机和核函数/" rel="next" title="支持向量机和核函数">
                <i class="fa fa-chevron-left"></i> 支持向量机和核函数
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/机器学习/Scikit-Learn编程方法/" rel="prev" title="Scikit-Learn编程方法">
                Scikit-Learn编程方法 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/icon.jpeg"
               alt="アカリ" />
          <p class="site-author-name" itemprop="name">アカリ</p>
          <p class="site-description motion-element" itemprop="description">很羡慕工作后辞职读研的人，能腾出一两年的大片时间来专心学习某个自己喜欢的领域的知识技能其实是一件非常幸福的事……</p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#模型选择"><span class="nav-number">1.</span> <span class="nav-text">模型选择</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#通过学习曲线描述拟合效果"><span class="nav-number">2.</span> <span class="nav-text">通过学习曲线描述拟合效果</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#交叉验证"><span class="nav-number">3.</span> <span class="nav-text">交叉验证</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#集成学习"><span class="nav-number">4.</span> <span class="nav-text">集成学习</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Bagging"><span class="nav-number">5.</span> <span class="nav-text">Bagging</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Boosting"><span class="nav-number">6.</span> <span class="nav-text">Boosting</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Stacking"><span class="nav-number">7.</span> <span class="nav-text">Stacking</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">アカリ</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	





  




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=default"></script>
  


  

  

  


</body>
</html>
